[
{"title": "Repair Technician", "location": "None", "company": "Phonezone Queenstown - Five Mile Shopping Centre", "type": "None", "duration": "None", "description": "Description Job Summary A successful applicant will: Work well in a team Must be able to work on a flexible Roster Need to be a mature person who can handle responsibilities during shifts for store and staff independently Show initiative to troubleshoot problems as they arise. Job Description\nDetermining software and hardware requirements to provide solutions to problems\nAssessing damage and cost of repairs \nOrdering replacement parts as required \nChip level Laptop and Mobile PCB Board repair\nTimely and Efficient repairs of Mobile phones  and electronic devices \nTest the parts to ensure they work properly and use diagnostic tools to assess computer systems\nAnalyze information and recommend appropriate hardware to users.\nService on site and in store  upgrade and maintain\nDownloading and installing appropriate software operating systems anti-virus and drivers \nProducts associated paperwork and documentation \nAttend and assist the company's’ customers with their computer support needs in a timely and professional manner\nTo build a strong relationship between the company its customer and staff and to build overall goodwill\nAssist customers to choose products providing information on quality characteristics of products warranties and maintenance.\nMaintain an up to date and comprehensive knowledge of products available for sale and ensure that customers have a wide selection to choose from.\nEnsure when new stock arrives that it is of correct model design and quantity.\nManage stock inventory to ensure that sufficient products are available and place orders with suppliers when necessary.\nTroubleshooting and performing diagnostics to repair mobile phones and computers.\nDeal with store level enquiries and complaints and monitor customer service.\nCheck that all the products you sell are well displayed.\nEnsure that promotional plans are properly communicated to customers in the aim of soft selling.\nSuggest methods for improving the client base and expanding the business.\nMaintaining health and safety standards and procedures. Number of Vacancies: 1 Primary work location: Queenstown Employment Type: Full-Time Permanent Minimum 30 hours per week as per roster Pay rate: $26.00 - $35.00 p/h depending on experience Visa sponsorship available for right candidate.", "source": "trademe", "skills": "[{\"name\": \"troubleshooting\", \"type\": \"soft skill\"}, {\"name\": \"customer service\", \"type\": \"soft skill\"}, {\"name\": \"diagnostic tools\", \"type\": \"tool\"}]", "salary": 72800, "date": "2024-11-18", "category": "service desk"},
{"title": "Mobile Phone Repair Technician", "location": "None", "company": "Tech Pro Repairs Ltd", "type": "None", "duration": "None", "description": "Description We are hiring 3x Mobile Phone Repair Technicians who are experienced in iPhone/Samsung phones and iPad repairs.\nThis role also includes selling and up selling of phone accessories.\nKnowledge of repairs on other phone models would be an advantage. Job duties:\n-Repairing iPhone/Samsung phones and iPads.\n-Sales of accessories and screen protector installations. Providing clients customer service including troubleshooting and identifying requirements and providing a thorough explanation of the services that meet their requirements & recommending products that suit their needs. Cashiering duties. Preparing and placing new orders for accessories and repair parts as and when required. Managing customer complaints if needed. Keep the workspace clean and organized. Other important requirements: Available to work on a flexible roster Excellent time-management skills Hardworking and a passionate individual Attention to detail Experience Needed:\n(Minimum Requirement set Below)\nMinimum 6 months experience as a technician/sales person. For suitable applicant, there is a chance to be promoted as Manager with excellent salary and benefits.", "source": "trademe", "skills": "[{\"name\": \"customer service\", \"type\": \"soft skill\"}, {\"name\": \"time management\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "service desk"},
{"title": "Senior Software Engineer", "location": "None", "company": "C3", "type": "None", "duration": "None", "description": "Description Our Technology Delivery team is a small and focused team of exceptional people who build, enhance, support and maintain C3's extensive technology environment. This highly integrated environment provides plenty of challenges and opportunity alike. Our Technology Delivery team works over a varied environment, ranging from traditional IT solutions, serverless cloud-based solutions through to mobile technology including business-critical systems. We are seeking an energetic and tenacious Senior Software Engineer to be part of an agile squad within a dynamic team, working on innovative solutions for our business and customers. To be considered for this role you will need: A sense of humour and a positive attitude, contributing to a team culture that values collaboration, resilience, and a little fun along the way Confidence in the following tech stacks Front end: AngularJS, React/React Native, HTML/CSS/JavaScript, Cordova (Android/iOS) Back end: NodeJS, AWS products and services, Python (nice to have) QA: Jest Testing Framework Databases: DynamoDB, NoSQL Cloud hosting: AWS with a focus on serverless CI/CD and DevOps: Linux, BASH, Linter, YAML Other (nice to have): .NET C#, MVC, SQL server, Entity Framework 7+ years relevant industry experience Experience working with Agile principles in a cross-functional team Proven understanding of architecture and proven software design skills Bachelor's degree in software engineering (or equivalent experience) AWS Certified Developer Associate  or working towards this C3 is a business on the go, with offices located on the foreshore of Tauranga Harbour, in one of New Zealand's fastest growing regions, with over 1300 staff around New Zealand and Australia. C3 has an established and proud history in the logistics industry and our longevity is based on building for the future and keeping ahead of the pack. You will play a key role in shaping our technology landscape. If you have great problem-solving skills, never let a bug beat you, and take pride in designing and building great software, then this is the perfect opportunity for you! The successful applicant will be required to pass a pre-employment medical, drug & alcohol test as well as criminal records checks.", "source": "trademe", "skills": "NULL", "salary": "NULL", "date": "2024-11-18", "category": "None"},
{"title": "Product Owner - 12 months Fixed Term", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description Trade Me is one of New Zealand's most popular websites with over four million members and more than 650,000 Kiwis visiting our site every day. This is a critical leadership role responsible for execution of our highest priority initiatives to deliver the outcomes and shift the metrics we care most about (OKRs). Product Owners execute initiatives through prioritisation and direct supervision of the work engineering squads do, from continuous planning, through discovery and refinement to delivery. They also ensure squads balance delivery commitments with plannable maintenance of our technology assets. Without this role we would not be able to reliably and consistently execute our strategic initiative and maintain the robust health, resilience and stability of our systems. This role would suit people with previous e-commerce experience working as a Product Manager, Product Owner or Senior Business Analyst. As a member of the Marketplace Engineering team this role's customers are Trade Me customers selling and purchasing goods and services on our e-commerce platform You'll have the best time working at Trade Me, and this is why: #Flexible Flexibility means different things to different people and we support you to find what works, including a home office set up and utilities allowance. We value team connection and come together in person on Monday and at least one other day a week. #Wellness Being your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way. #Leave We support you with leave when you need it, including 5 days wellness leave and 10 days sick leave from day 1. #Social Nothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company paid lunches. regular Friday drinks and nibbles, annual Trade Me company awards, celebrations and more. #Learning Whether it's on the job, formal training, mentoring or something else, you’ll grow with us from Day 1. Here's what you can expect from the role: Align squad work with Product and Technology Roadmaps and OKR's Create, refine and maintain and robust, adequately resourced Epic backlog Lead release change management including customer adoption/rollout planning and both internal and external engagement and communication around the change\n_ Be a strong advocate for the customers and our products Keep everyone informed and aligned Adhere to agile principles What you will bring to our team: 5+ years of experience of delivery leadership working in software development teams A proven track record of successfully developing flexible value driven product roadmaps to clarify where we are going, taking ownership of outcomes and delivering measurable results Experience with opportunity definition and discovery, goal-oriented product roadmaps and using outcome based metrics to measure the impact of change Experience working in technical roles within product driven software development teams within a complex and fast paced environment You're an outstanding communicator - able to explain ideas simply & clearly, listen carefully to others, and communicate across a wide audience You're highly organised and result oriented with strong planning and facilitation skills Experienced in leading technical teams within an agile environment with an excellent understanding of agile ways of working & engineering practices You are confident using collaborative tools to clarify work scope, sizing, trade offs, dependencies and other planning considerations. (eg. Miro, LucidChart, Jira) We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'. If you’re excited about this opportunity, we'd still really like to hear from you. Trade Me is an INZ accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"agile\", \"type\": \"methodology\"}, {\"name\": \"jira\", \"type\": \"tool\"}, {\"name\": \"miro\", \"type\": \"tool\"}, {\"name\": \"lucidchart\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "project management"},
{"title": "Full Stack Engineer - Senior", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description At Trade Me, we're about connecting Kiwi to create the life they want. Whether it's the big things like finding a home, a job, a car, or growing their business, or the smaller things, like finding that right bedside table or parting ways with some old stuff. At Trade Me our vision is to be the place where Kiwi look first. This is a great opportunity for an experienced developer to work with your squad, engineering, and product teams across Marketplace to bring product enhancements and new products to life, which deliver an experience to our customers that is second to none. You'll have the best time working at Trade Me, and this is why: #Flexible Flexible working is the new normal. We have our company connection day on Monday and there is another team connection day as well. We support you with a home office setup and a utilities allowance to ensure you can work comfortably #Wellness Being your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way. #Leave We support you with leave when you need it, including 5 days of wellness leave each year and 10 days of sick leave from day 1. #Social Nothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company-paid lunches. Friday drinks and nibbles every fortnight, annual Trade Me company awards, celebrations, and more. #Learning Whether it's on the job, formal training, mentoring, or something else, you'll grow with us from Day 1. Here's what you can expect from this role: As a trusted mentor, you'll guide and support junior team members through mentoring and coaching. Identify and tackle obstacles within our procedures and methodologies. Explore possibilities to apply new, innovative technologies to resolve existing business challenges. Devise plans, provide estimates, and organize tasks for the team's assignments. Write code and create unit tests to fulfill the objectives set for the team. Be responsible for the technical aspects of projects undertaken by the team. Conduct thorough code reviews and testing of code developed by fellow programmers. Maintain comprehensive documentation during the development process, facilitating future maintenance and expansion. Participate actively in conversations and endeavors aimed at enhancing the Trade Me code foundation and technical frameworks. What you will bring to our team: 5+ years experience in similar development roles. Sound C# development experience (or similar language), and ideally a good understanding of the .NET Framework. Experience with front-end technologies such as CSS, JavaScript and/or Angular. Understanding of relational databases and SQL, in particular Microsoft SQL Server. A good understanding of OO design patterns, and when to use them. Appreciation of SOLID principles, elegant and testable code and what that looks like in a constantly changing codebase with a history. A great team player and trusted advisor, able to provide support and advice to others with a positive attitude and a willingness to collaborate. We know some candidates can be reluctant to apply for roles if they feel they don't \"tick all the boxes\". If you're excited about this opportunity, we'd still really like to hear from you. Trade Me is an INZ accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"c#\", \"type\": \"language\"}, {\"name\": \".net framework\", \"type\": \"framework\"}, {\"name\": \"css\", \"type\": \"language\"}, {\"name\": \"javascript\", \"type\": \"language\"}, {\"name\": \"angular\", \"type\": \"framework\"}, {\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"microsoft sql server\", \"type\": \"database\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "programming & development"},
{"title": "Test Manager", "location": "None", "company": "Comspek International", "type": "None", "duration": "None", "description": "Description My Auckland based client seeks the expertise of a Test Manager. As the Test Manager you will need to display strong leadership qualities to develop, execute and own the overall Test Strategy, Test Plan and delivery for a new programme of work. Key deliverables will include but not limited to: Covering Technical, UAT and Process Document a detailed Test Plan for internal and external, track test cases, defect management and collating the artifacts Define test cases with suppliers and internal teams for functional and non-functional testing Cover system and integration testing as defined in the HL strategy Support teams during pilot and ensure defect management is applied and any resolutions If you're interested, please apply and we will reach out and have a confidential chat. Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "source": "trademe", "skills": "[{\"name\": \"leadership\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "testing"},
{"title": "Full Stack Engineer - Senior", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description At Trade Me, we're about connecting Kiwi to create the life they want. Whether it's the big things like finding a home, a job, a car, or growing their business, or the smaller things, like finding that right bedside table or parting ways with some old stuff. At Trade Me our vision is to be the place where Kiwi look first.    This is a great opportunity for an experienced developer to work with your squad, engineering, and product teams across Marketplace to bring product enhancements and new products to life, which deliver an experience to our customers that is second to none.     You'll have the best time working at Trade Me, and this is why:   #Flexible   Flexible working is the new normal. We have our company connection day on Monday and there is another team connection day as well. We support you with a home office setup and a utilities allowance to ensure you can work comfortably   #Wellness   Being your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way.   #Leave      We support you with leave when you need it, including 5 days of wellness leave each year and 10 days of sick leave from day 1.   #Social      Nothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company-paid lunches. Friday drinks and nibbles every fortnight, annual Trade Me company awards, celebrations, and more.   #Learning      Whether it's on the job, formal training, mentoring, or something else, you'll grow with us from Day 1.    Here's what you can expect from this role:      * As a trusted mentor, you'll guide and support junior team members through mentoring and coaching.   * Identify and tackle obstacles within our procedures and methodologies.   * Explore possibilities to apply new, innovative technologies to resolve existing business challenges.   * Devise plans, provide estimates, and organize tasks for the team's assignments.   * Write code and create unit tests to fulfill the objectives set for the team.   * Be responsible for the technical aspects of projects undertaken by the team.   * Conduct thorough code reviews and testing of code developed by fellow programmers.   * Maintain comprehensive documentation during the development process, facilitating future maintenance and expansion.   * Participate actively in conversations and endeavors aimed at enhancing the Trade Me code foundation and technical frameworks.    What you will bring to our team:      * 5+ years experience in similar development roles.   * Sound C# development experience (or similar language), and ideally a good understanding of the .NET Framework.   * Experience with front-end technologies such as CSS, JavaScript and/or Angular.   * Understanding of relational databases and SQL, in particular Microsoft SQL Server.   * A good understanding of OO design patterns, and when to use them.   * Appreciation of SOLID principles, elegant and testable code and what that looks like in a constantly changing codebase with a history.   * A great team player and trusted advisor, able to provide support and advice to others with a positive attitude and a willingness to collaborate.    We know some candidates can be reluctant to apply for roles if they feel they don't &quot;tick all the boxes&quot;. If you're excited about this opportunity, we'd still really like to hear from you.    Trade Me is an INZ accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"c#\", \"type\": \"language\"}, {\"name\": \".net framework\", \"type\": \"framework\"}, {\"name\": \"css\", \"type\": \"language\"}, {\"name\": \"javascript\", \"type\": \"language\"}, {\"name\": \"angular\", \"type\": \"framework\"}, {\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"microsoft sql server\", \"type\": \"database\"}, {\"name\": \"creativity\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "programming & development"},
{"title": "Software Solutions Specialist", "location": "None", "company": "Freshpork NZ", "type": "None", "duration": "None", "description": "Description Software Solution Specialist – Freshpork NZ (Based in Christchurch) Freshpork NZ is a family-owned business, passionate about producing quality New Zealand pork products and feed.  We have been delivering New Zealand pork to Kiwis for over 39 years and are the country’s leading pork specialist.  With over 150 staff operating from 4 sites, we are committed to the long-term sustainability of the NZ pig industry, through innovative processing and products that provide fresh, high quality food products to New Zealanders, their families and their animals. We have an exciting opportunity for an Software Solutions Specialist to join our Christchurch team and support our wider business in a technical capacity in person and remotely to our sites. Reporting to the ICT Manager, this role has responsibility for scripting, systems and software development to support the forward strategies of the business, along with providing technical system support for users, with hardware, software and network requirements.  We’re looking for someone who has technical capability and can align development progression with business initiatives for efficient and user-friendly outcomes. What you’ll bring to the role: Bachelor’s degree in Information Technology, Computer Science or related experience. With a solid application development background (7+ years experience), you’ll be quick to identify, design and apply innovative solutions while further developing our current applications. Specific experience in Power Apps / Automation, EDI, Scripting (e.g. python, powershell, office script). Experience in SQL, T-SQL and database admin is an advantage. Microsoft product expertise and knowledge of cloud-based systems, network infrastructure and ERP System experience. Respond to queries with practical solutions, in person and remotely. Strong analytical skills to troubleshoot and provide encouraging ICT support. Be an enabler with an approachable manner and effective communicator both verbally and with correspondence, to swiftly respond to all ICT queries in a customer-centric manner. Hands-on solution ownership from development to end-user empowerment. Willingness to learn new technologies and a passion for continuous learning. What you can expect: Be part of a successful professional family business. Your work will contribute to the future success of the business, while being part of a dedicated team who find time to enjoy a good laugh. A competitive salary package and additional benefits such a medical insurance and staff sales of our delicious pork and bacon, including our Heartland NZ and Freedom Farm products. To apply you will need to be eligible to work in New Zealand. How to apply:\nFor further information or to request a position description, please contact Nigel Lloyd on 022 174 4996. Please apply through the relevant vacancy on our website http://www.freshpork.co.nz.", "source": "trademe", "skills": "[{\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"powershell\", \"type\": \"language\"}, {\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"t-sql\", \"type\": \"language\"}, {\"name\": \"power apps\", \"type\": \"tool\"}, {\"name\": \"edi\", \"type\": \"protocol\"}, {\"name\": \"microsoft\", \"type\": \"platform\"}, {\"name\": \"cloud-based systems\", \"type\": \"platform\"}, {\"name\": \"network infrastructure\", \"type\": \"platform\"}]", "salary": 0, "date": "2024-11-18", "category": "other"},
{"title": "Website & Digital Marketing Specialist", "location": "None", "company": "Kelford Cams", "type": "None", "duration": "None", "description": "Description Kelford Technologies is looking for a Website Optimization & Digital Marketing Specialist with 1-3 years of experience to join our team! This role will put you in the driver’s seat of our website’s performance while letting you dive into exciting digital marketing projects that fuel our growth in the high-performance automotive sector. About the Role:\nAs our Website Optimization & Digital Marketing Specialist, you’ll oversee Kelford’s website performance, technical SEO, and customer re-engagement strategies. You'll also support digital marketing initiatives alongside our Digital Marketing & Content Coordinator, playing a crucial role in shaping our online presence to drive customer engagement and sales growth. What You’ll Do: Website Management & Development: Ensure fast, responsive, and seamless user experiences across all devices, focusing on mobile. CRM & Re-Targetting: Manage CRM data, create customer segments, and execute re-marketing strategies. Email Marketing: Develop and optimize email campaigns to boost engagement and conversions. Collaborate: Work closely with the sales and marketing teams to align content and campaigns with business goals. Branding & SEO: Ensure consistent branding across digital assets while optimizing for search visibility. Analytics & Reporting: Provide insights on website and campaign performance to inform strategic decisions. Technical Maintenance: Maintain website security, troubleshoot issues, and perform regular updates. Who You Are: Experience & Skills: 1-3 years of experience in website development, SEO, and digital marketing, ideally in e-commerce or the automotive industry. Familiarity with HTML, CSS, JavaScript, CMS (like WordPress/Shopify), and CRM platforms (e.g., HubSpot, Salesforce) is a plus. Tools of the Trade: Comfortable with tools like Google Analytics, SEMrush, and re-marketing platforms Passion for Motorsport: A love for motorsports and high-performance vehicles will make you feel right at home! Personal Drive: You’re proactive, detail-oriented, and excited about data-driven decision-making. Why Kelford?\nBe part of a high-energy team at the forefront of automotive performance. We’re committed to innovation, and your role will be pivotal in ensuring Kelford’s digital presence is as powerful as our products.\nReady to rev up your career with Kelford Technologies? Apply now by sending your CV along with a Covering Letter and turn your passion for motorsports and digital marketing into a thrilling career!", "source": "trademe", "skills": "[{\"name\": \"html\", \"type\": \"language\"}, {\"name\": \"css\", \"type\": \"language\"}, {\"name\": \"javascript\", \"type\": \"language\"}, {\"name\": \"wordpress\", \"type\": \"platform\"}, {\"name\": \"shopify\", \"type\": \"platform\"}, {\"name\": \"hubspot\", \"type\": \"tool\"}, {\"name\": \"salesforce\", \"type\": \"tool\"}, {\"name\": \"google analytics\", \"type\": \"tool\"}, {\"name\": \"semrush\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"creativity\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "other"},
{"title": "Full Stack Engineer - Senior", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description At Trade Me, we're about connecting Kiwi to create the life they want. Whether it's the big things like finding a home, a job, a car, or growing their business, or the smaller things, like finding that right bedside table or parting ways with some old stuff. At Trade Me our vision is to be the place where Kiwi look first. This is a great opportunity for an experienced developer to work with your squad, engineering, and product teams across Marketplace to bring product enhancements and new products to life, which deliver an experience to our customers that is second to none. You'll have the best time working at Trade Me, and this is why: #Flexible Flexible working is the new normal. We have our company connection day on Monday and there is another team connection day as well. We support you with a home office setup and a utilities allowance to ensure you can work comfortably #Wellness Being your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way. #Leave We support you with leave when you need it, including 5 days of wellness leave each year and 10 days of sick leave from day 1. #Social Nothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company-paid lunches. Friday drinks and nibbles every fortnight, annual Trade Me company awards, celebrations, and more. #Learning Whether it's on the job, formal training, mentoring, or something else, you'll grow with us from Day 1. Here's what you can expect from this role: As a trusted mentor, you'll guide and support junior team members through mentoring and coaching. Identify and tackle obstacles within our procedures and methodologies. Explore possibilities to apply new, innovative technologies to resolve existing business challenges. Devise plans, provide estimates, and organize tasks for the team's assignments. Write code and create unit tests to fulfill the objectives set for the team. Be responsible for the technical aspects of projects undertaken by the team. Conduct thorough code reviews and testing of code developed by fellow programmers. Maintain comprehensive documentation during the development process, facilitating future maintenance and expansion. Participate actively in conversations and endeavors aimed at enhancing the Trade Me code foundation and technical frameworks. What you will bring to our team: 5+ years experience in similar development roles. Sound C# development experience (or similar language), and ideally a good understanding of the .NET Framework. Experience with front-end technologies such as CSS, JavaScript and/or Angular. Understanding of relational databases and SQL, in particular Microsoft SQL Server. A good understanding of OO design patterns, and when to use them. Appreciation of SOLID principles, elegant and testable code and what that looks like in a constantly changing codebase with a history. A great team player and trusted advisor, able to provide support and advice to others with a positive attitude and a willingness to collaborate. We know some candidates can be reluctant to apply for roles if they feel they don't \"tick all the boxes\". If you're excited about this opportunity, we'd still really like to hear from you. Trade Me is an INZ accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"c#\", \"type\": \"language\"}, {\"name\": \".net framework\", \"type\": \"framework\"}, {\"name\": \"css\", \"type\": \"language\"}, {\"name\": \"javascript\", \"type\": \"language\"}, {\"name\": \"angular\", \"type\": \"framework\"}, {\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"microsoft sql server\", \"type\": \"database\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "programming & development"},
{"title": "Data Analyst", "location": "None", "company": "SKOPE Industries Ltd", "type": "None", "duration": "None", "description": "Description Contribute across the business Hybrid working role Work for a market-leading company SKOPE is a family-owned New Zealand company with a reputation for innovative design, manufacturing and service.  Market-leading SKOPE commercial refrigeration is supplied to some of the market's largest beverage, hospitality and retail brands.  With the largest design and innovation centre of its kind in Australasia, we are focused on developing low-energy, environmentally friendly, high-performance products. Are you an analytical thinker with a passion for uncovering meaningful insights from complex data? We are looking for a talented Data Analyst to join our dynamic team on a permanent basis.\nAs a Data Analyst at SKOPE, you will leverage your data and reporting expertise to deliver actionable insights that support strategic decision-making. In this role, you will: Collaborate with business stakeholders to continuously improve reporting capabilities as business requirements evolve. Develop visually compelling Power BI dashboards that empower stakeholders with actionable data visualisations. Produce in-depth reports with thorough analysis to inform strategic business decisions, covering sales metrics, projected future demand, stock levels, and key performance indicators (KPIs). Proactive monitoring and testing of the functionality and stability of data management systems to ensure their performance, accuracy and integrity. Maintain and optimise the data warehouse infrastructure to ensure efficient data extraction, transformation, and loading using SQL. Preferred Requirements: At least 3+ years of experience. Ability to analyse complex data and identify patterns or trends that contribute to business insights. Ability to translate business requirements into a clear reporting brief and execute them. Proven experience in the development of Power BI dashboards. Proficiency in programming in SQL / Python. Familiarity with Azure cloud infrastructure. A security-first mindset, ensuring security is interwoven throughout all activities and projects. Solid understanding of business process, experience in manufacturing industry is a plus. A passion for learning new technologies and skills. If you are ready to take your career to the next level in a forward-thinking environment, we want to hear from you. Start date will be Tuesday, 7 January 2025. Pre-employment checks will include drug & alcohol testing, a criminal conviction check, and reference checking. Diversity\nSKOPE is committed to ensuring equal employment opportunities to all qualified individuals. We believe a diverse workforce will enhance our ability to provide a more comprehensive experience for our customers. All applications are considered on the basis of merit, qualifications, and business need.\nApplicants must be legally entitled to work in New Zealand. If you are not a New Zealand Citizen, you must have the right of permanent residence or a valid work visa.", "source": "trademe", "skills": "[{\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"power bi\", \"type\": \"tool\"}, {\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"azure\", \"type\": \"platform\"}]", "salary": 0, "date": "2024-11-18", "category": "business & systems analysts"},
{"title": "Full Stack Engineer - Senior", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description At Trade Me, we're about connecting Kiwi to create the life they want. Whether it's the big things like finding a home, a job, a car, or growing their business, or the smaller things, like finding that right bedside table or parting ways with some old stuff. At Trade Me our vision is to be the place where Kiwi look first. This is a great opportunity for an experienced developer to work with your squad, engineering, and product teams across Marketplace to bring product enhancements and new products to life, which deliver an experience to our customers that is second to none. You'll have the best time working at Trade Me, and this is why: #Flexible Flexible working is the new normal. We have our company connection day on Monday and there is another team connection day as well. We support you with a home office setup and a utilities allowance to ensure you can work comfortably #Wellness Being your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way. #Leave We support you with leave when you need it, including 5 days of wellness leave each year and 10 days of sick leave from day 1. #Social Nothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company-paid lunches. Friday drinks and nibbles every fortnight, annual Trade Me company awards, celebrations, and more. #Learning Whether it's on the job, formal training, mentoring, or something else, you'll grow with us from Day 1. Here's what you can expect from this role: As a trusted mentor, you'll guide and support junior team members through mentoring and coaching. Identify and tackle obstacles within our procedures and methodologies. Explore possibilities to apply new, innovative technologies to resolve existing business challenges. Devise plans, provide estimates, and organize tasks for the team's assignments. Write code and create unit tests to fulfill the objectives set for the team. Be responsible for the technical aspects of projects undertaken by the team. Conduct thorough code reviews and testing of code developed by fellow programmers. Maintain comprehensive documentation during the development process, facilitating future maintenance and expansion. Participate actively in conversations and endeavors aimed at enhancing the Trade Me code foundation and technical frameworks. What you will bring to our team: 5+ years experience in similar development roles. Sound C# development experience (or similar language), and ideally a good understanding of the .NET Framework. Experience with front-end technologies such as CSS, JavaScript and/or Angular. Understanding of relational databases and SQL, in particular Microsoft SQL Server. A good understanding of OO design patterns, and when to use them. Appreciation of SOLID principles, elegant and testable code and what that looks like in a constantly changing codebase with a history. A great team player and trusted advisor, able to provide support and advice to others with a positive attitude and a willingness to collaborate. We know some candidates can be reluctant to apply for roles if they feel they don't \"tick all the boxes\". If you're excited about this opportunity, we'd still really like to hear from you. Trade Me is an INZ accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"c#\", \"type\": \"language\"}, {\"name\": \".net framework\", \"type\": \"framework\"}, {\"name\": \"css\", \"type\": \"language\"}, {\"name\": \"javascript\", \"type\": \"language\"}, {\"name\": \"angular\", \"type\": \"framework\"}, {\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"microsoft sql server\", \"type\": \"database\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"creativity\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "programming & development"},
{"title": "ICT Help Desk Officer", "location": "None", "company": "TRT", "type": "None", "duration": "None", "description": "Description At TRT we are a proud, privately-owned business, delivering engineered solutions to industry for over 50 years, as a leading manufacturer of Heavy Transport Trailers, Mobile Cranes and Specialised Equipment across multiple industry sectors in Australia and New Zealand. \nAbout the Role: We're on the hunt for a talented and experienced ICT Help Desk Oﬃcer to bolster our team. If you have a robust background assisting computer and phone users by resolving technical issues, we want to hear from you. \nYou'll be pivotal in providing top-tier technical support, ensuring the seamless operation of our IT systems, and delivering outstanding customer support to TRT staff. As well as managing our IT ticketing system, this role is responsible for hardware, software and IT risk mitigation requirements.\nSuitable applicants will be qualified through relevant experience and/or tertiary education.\nKey Responsibilities: Manage and prioritize help desk tickets, ensuring timely resolution and documentation of technical issues. Oversee hardware deployment, procurement, configuration, and maintenance, including imaging devices for user readiness. Administer software licensing, SharePoint, and printer support, ensuring efficient operation and compliance. Implement security protocols and address malware threats to protect organisational data and systems. Conduct security awareness training sessions for staff to promote a culture of cybersecurity.\nRequired skills: Management of an IT ticketing system; demonstrating excellent problem solving and customer service skills to ensure satisfaction of users Diagnosis and resolution of issues with software, such as Office 365, Azure, video conferencing technology, ERP systems Diagnosis and resolution of issues with hardware, such as Android, Apple, Windows devices Configuration of hardware and software to meet user needs\nPreferred skills: ERP systems administration, onboarding, security management Experience using Pronto Xi ERP Familiarity with cyber security training and testing programmes, particularly KnowBe4", "source": "trademe", "skills": "[{\"name\": \"office 365\", \"type\": \"software\"}, {\"name\": \"azure\", \"type\": \"platform\"}, {\"name\": \"android\", \"type\": \"hardware\"}, {\"name\": \"apple\", \"type\": \"hardware\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"customer service\", \"type\": \"soft skill\"}, {\"name\": \"erp\", \"type\": \"methodology\"}, {\"name\": \"pronto xi\", \"type\": \"software\"}, {\"name\": \"security management\", \"type\": \"methodology\"}]", "salary": 0, "date": "2024-11-18", "category": "service desk"},
{"title": "Senior Cyber Security Analyst", "location": "None", "company": "Comspek International", "type": "None", "duration": "None", "description": "Description Our client is looking for a Senior Cyber Security Analyst who will play a vital role in safeguarding monitoring, analysing, and responding to security threats. The analyst will be responsible for prioritising and triaging security incidents based on their potential business impact, determining the appropriate response approach, and assigning severity levels. This position also involves ongoing assessment of incident classification and making decisions on whether to close or escalate incidents to the Head of Cyber Security Operations. Key Responsibilities: Incident Management: Review, prioritise, and triage security incidents, assigning severity levels and determining appropriate responses. Technical Analysis and Reporting: Conduct thorough root cause analysis and post-incident reviews, producing comprehensive technical reports on security incidents. Threat Detection and Incident Response: Utilise Incident Response, Cyber Kill Chain, ATT&CK framework, and expertise in identifying attack vectors to manage threats. Network and Endpoint Analysis: Analyse network traffic using deep packet inspection and examine logs from endpoints, networks, and applications. Tool and Technology Expertise: Leverage experience with firewalls, web and email security, endpoint security, and SIEM to strengthen the organisation’s security posture. Collaboration and Escalation: Partner with the Head of Cyber Security Operations to escalate high-priority incidents and enable swift, effective response. Requirements: Experience: 5 to 7 years of relevant experience in cybersecurity analysis and incident management. Technical Skills: Advanced knowledge of cloud security practices for AWS and Azure. Strong understanding of networking concepts and protocols. Proficiency in using firewalls, web/email security, endpoint security, and SIEM. Hands-on experience with root cause analysis, network traffic analysis, and deep packet inspection tools. Proficiency in Python for security scripting and automation. Frameworks and Methodologies: Solid understanding of Incident Response, Cyber Kill Chain, ATT&CK framework, and attack vectors. Communication: Exceptional technical writing skills for creating detailed reports. Decision-Making: Proven ability to assess and prioritize incidents to minimise business impact. Preferred Qualifications: Relevant cybersecurity certifications (e.g., CISSP, CISM, AWS Certified Security Specialty). Experience working in a SOC (Security Operations Center) environment. Knowledge of security frameworks such as NIST, ISO 27001, and CIS. If this sounds like you apply now! Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "source": "trademe", "skills": "[{\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"aws\", \"type\": \"cloud platform\"}, {\"name\": \"azure\", \"type\": \"cloud platform\"}, {\"name\": \"cissp\", \"type\": \"certification\"}, {\"name\": \"cism\", \"type\": \"certification\"}, {\"name\": \"incident response\", \"type\": \"methodology\"}, {\"name\": \"cyber kill chain\", \"type\": \"methodology\"}, {\"name\": \"attack vector\", \"type\": \"methodology\"}, {\"name\": \"siem\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "security"},
{"title": "Customer Support Specialist", "location": "None", "company": "Tasman District Council", "type": "None", "duration": "None", "description": "Description Permanent, full time role Richmond, Tasman Combine your IT expertise and customer service skills Work in a supportive and collaborative team culture Opportunities for professional development and growth Base salary + benefits + health insurance + day off on your birthday About the role: In this role you will get to work in all area of the organisation, so a friendly and positive attitude to help build and maintain great working relationships is a must, prior customer service experience is essential. Some key tasks: To provide a high level of customer engagement and support for system, service and technology changes within the organisation To undertake ITIL incident and problem management response and resolution Ensure technology services operate effectively and staff are supported Deputise for the Team Lead - Service Delivery role when required About you: You will have an ITIL certification, a Level 4 or above qualification in an IT based subject and at least 2 years' experience within an IT service delivery team. You will have a passion for IT and customer service with excellent written and verbal communication skills. You will need to be well organised, have the ability to multitask as well as be able to adapt to changing work requirements. If you embrace change and get excited about technology this is the role for you. The rewards: Tasman District Council offers a welcoming, friendly and professionally rewarding environment where you can develop your career profile while working in a team who are passionate about their region and their work. At council we offer: A great team environment Ongoing professional development Flexible/Hybrid working arrangements Attractive benefits package Health insurance A day off on your birthday! Building great communities through employing great people. Will you be one of them? Please note we will review applications as they are received and may interview before the close date. Online applications can be submitted on our website careers.tasman.govt.nz and further information can be obtained by contacting the People & Wellbeing Team on (03) 543-8988 or at mailto:vacancy@tasman.govt.nz. Please submit your application online at https://careers.tasman.govt.nz/Vacancies. To view full details or for more information contact the People and Wellbeing Team on Ph. 03 543 8400. Ref. 6692900 Applications close 06 December 2024", "source": "trademe", "skills": "[{\"name\": \"itil\", \"type\": \"certification\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"customer service\", \"type\": \"soft skill\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "service desk"},
{"title": "Manager Operational Products and Support", "location": "None", "company": "Beyond Recruitment", "type": "None", "duration": "None", "description": "Description If you are a Product and Data expert with strong Leadership skills who can build and manage a team in the Data Strategy & Operational Products group, we would like to hear from you. You will make a real impact and have a vision for modern and innovative data solutions. With a focus on developing products and working closely with other insights teams, you will share information to the organisation’s groups in a way that makes data easy to understand and use. You will know what best practice looks like to lead and shape the data product strategy, and will understand how data can improve decision-making, particularly in a frontline setting. You will ensure that products are designed to support these operational needs whilst managing the team’s capacity and skills to ensure timely delivery on immediate and long-term goals. You will manage resources, relationships and processes including making changes and improvements, to ensure quality and effective delivery of work. Key Responsibilities:\nSupport the process of strategic management and initiate, develop and implement strategy to contribute to the strategic development of Insights across the organisation.\nEstablish, monitor and report on budget expenditure, whilst complying with financial, policies and standards expected of public servants.\nUnderstand how data products support performance ecosystems, whilst providing the correct information to the right level of operations to drive and improve decision making. \nAbility to translate complex technical information to a variety of audiences.\nManage and develop a plan to build the capability of staff and deliver to the ongoing requirements of the teams work programme.\nHave an understanding and respect for building and embedding Te Ao Māori in your leadership role. Knowledge, Experience & Skills Required:\nTertiary qualification in a relevant field or equivalent operational experience.\nLeadership experience with excellent skills in building and motivating teams.\nStrong technical knowledge of IT systems, channels and data structures.\nProven track record of delivering products that meet client needs.\nExperience with complex multi-project programmes, using management methodologies or working in business change management.\nGood understanding of policy implementation, process and parliamentary procedures.\nExperience in promoting and leading change.\nAbility to drive high-quality analysis and advice on complex issues within set timeframes. Benefits:\nRetirement savings schemes available.\nStudy assistance.\nFree flu jabs and wellbeing check-ups.\nSubsidy on the cost of eye tests, glasses and contact lenses. \nCounselling and coaching services.\nWorkplace mental health and wellbeing webinars.\nFree accident insurance.\nChildcare assistance and information for parents/caregivers.\nDiscounted health insurance benefits. \nKiwi Saver employer contributions. If this sounds like a good fit for you, please send your CV and Cover Letter to: mailto:bella.richardson@beyond.co.nz To apply for this role, you must already have the rights to work in New Zealand.\nJob# 128909", "source": "trademe", "skills": "[{\"name\": \"leadership\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "consultant"},
{"title": "Business Analyst - HRIS/Payroll and ERP Systems", "location": "None", "company": "Comspek International", "type": "None", "duration": "None", "description": "Description Business Analyst - HRIS/Payroll and ERP Systems\nWe are seeking an experienced Business Analyst to support a critical project involving the review and potential upgrade of HR and payroll systems. The organization recently implemented Microsoft Dynamics and ServiceNow but now needs to conduct an in-depth review to assess the current state, explore future solutions, and develop initial integration strategies.\nIn this role, you’ll leverage your expertise in HRIS/Payroll and ERP platforms, with a particular focus on finance/accounting, supply chain, payroll, and security and access management. A strong background in HRIS, payroll, or ERP systems (such as Microsoft Dynamics) will be essential as you help shape the direction of this high-impact transformation. Key Responsibilities: Conduct a comprehensive assessment of current HR and payroll systems, including evaluating current state vs. future state Analyze options for moving to an upgraded Microsoft Dynamics version, continuing with Chris21, or going out to RFP for a new system Engage in initial integration planning with existing platforms Support data and systems integration to ensure smooth transitions and functionality What We're Looking For: Proven experience in HRIS and Payroll systems, and/or ERP platforms with an emphasis on finance, payroll, supply chain, and access management modules Solid understanding of integration, data management, and system workflows Strong analytical, stakeholder engagement, and communication skills Details: Contract Duration: 6 months initially, with a strong likelihood of extension due to project scope Location: Hybrid role, requiring a minimum of 3 days per week in the office near Auckland Airport If this sounds like you APPLY NOW! Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "source": "trademe", "skills": "[{\"name\": \"microsoft dynamics\", \"type\": \"platform\"}, {\"name\": \"servicenow\", \"type\": \"tool\"}, {\"name\": \"hris\", \"type\": \"platform\"}, {\"name\": \"erp\", \"type\": \"platform\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "business & systems analysts"},
{"title": "Data Engineer", "location": "None", "company": "WEL Networks", "type": "None", "duration": "None", "description": "Description Work from home up to two days per week, nine day fortnight, flexible working hours Health, life and income protection insurance Work on existing projects with learning and development opportunities The Technology Group is a key enabler at WEL and has responsibility for applications, platforms, operations, data, information security and digital delivery teams. As a group we are embedding a new operating model and are on an exciting journey to develop new ways of enabling WEL to become a truly digital business. About the role The Data Engineer is responsible for supporting the Technology platform team in designing, delivering and maintaining solutions on WEL Networks Data platform. Initially the role will contribute significantly to Enterprise data capability adoption project and work with the project team to deliver high-end BI dashboards powered by automated data pipelines that support business reporting requirements and provide actionable intelligence to support business decisions. About you You will ideally have following skills and experience: A tertiary qualification in IT or related field Three plus years' experience as a data engineer Proven ability in building, optimizing, and maintaining ETL/ELT pipelines Strong understanding of data modelling principles and hands-on experience with schema design Experience with Snowflake, SQL and Python Experience with version control systems (e.g., GIT) and CI/CD pipelines Familiarity with data orchestration tools, preferably Coalesce Skills in ensuring data integrity, quality, and accuracy across pipelines Strong communication skills and the ability to work in a team-oriented environment Nice to have the following: Experience with data visualisation tools, especially PowerBI Background in both on-premises and cloud environments, ideally Azure Knowledge of the New Zealand electricity industry Familiarity with Data Governance practices Understanding of data architecture principles Experience with agile delivery methodologies Best-in-class benefits You'll benefit from a powerful package of benefits at WEL: Medical, life, and income protection insurance Flexible working options - including flexible working hours, nine day fortnight, ability to purchase additional annual leave, up to two days working from home per week, and more Ongoing career development Relocation costs and Most important of all, an excellent salary package We are committed to making sure our people go home safe every day, and with a drug and alcohol-free worksite we will require you to undertake testing as part of your pre-employment health assessment. About WEL Networks WEL Networks is unique. We've been serving the Waikato for over 100 years, distributing electricity from the national grid so we can power over 100,000 homes and businesses. With around 320 employees, we're proudly based in Hamilton and are owned by the community we work for. We play an important role in the region's economic and social development by identifying and investing in new technologies to future-proof our region - and keep our communities flourishing. Our vision is bold. And our ambition even stronger, especially as we diversify from traditional 'poles and lines' to an innovative and sustainable business. Ready to learn more? Start here We actively value diversity and inclusion, and we encourage you to be the 'real you' in your application. Applications will be screened as they arrive, and we may move quickly to interview Please review the position description for more details by copying and pasting this link into your browser: https://expressonline.haineslink.co.nz/pdfs/788661_JobDesc.pdf WEL offers a competitive package and a supportive working environment. If you feel this position is a good fit for your skills and experience please submit an online application.", "source": "trademe", "skills": "[{\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"snowflake\", \"type\": \"platform\"}, {\"name\": \"git\", \"type\": \"tool\"}, {\"name\": \"ci/cd\", \"type\": \"methodology\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"agile\", \"type\": \"methodology\"}]", "salary": 0, "date": "2024-11-18", "category": "database development & administration"},
{"title": "Technical Customer Support Specialist", "location": "None", "company": "Harvey Norman", "type": "None", "duration": "None", "description": "Description Combine your IT expertise and customer service skills in this Technical Customer Support Specialist position in our Porirua store, Computers department! This full-time role provides software and hardware support to customers and aims to grow the Tech2Home business. About the Role\nThis role installs software and hardware for customers both in the Techbay and customer homes providing a positive experience for all customers. Training will be provided on our systems and machinery to ensure you are fully supported when you start with us. Some key tasks will include: Troubleshoot, diagnose and provide solutions to customers on desktop, laptops, tablets, smart phones and other computer peripherals. Drive sales of Tech2Home services within the sales team, tech bay and with customers. Process all returns and faulty products correctly and despatch for repair, replacement or credit. Liaise with suppliers and repair agents to ensure that customers get their products repaired or replaced promptly. Undertake cashiering and sales duties as required. About You\nWe are looking for a technical expert who is able to provide great customer service. Some attributes we are looking for include: Technical understanding of computers and computer products. Customer service skills. Current, full NZ Drivers Licence. Retail experience desirable. IT certifications or qualifications desirable. Able to work weekends and public holidays essential. About Us\nHarvey Norman was introduced to New Zealand in 1997, since then we have become a household name, with over 45 stores nationwide plus offsite warehouses, commercial offices and the Auckland Support Office. Our diverse team is made up of over 2000 individuals who each bring a uniquely dynamic expertise to the workforce. Harvey Norman continues to grow throughout New Zealand with new stores opening each year and our team grows with us. We pride ourselves on being a market leader and have a great track record of providing high quality products and outstanding customer service. Here at Harvey Norman we are proud to boast that all our General Managers and retail Store Managers have been promoted from within the business. This is your opportunity to learn from the best and grow to be one of the best! About the benefits\nOur staff make our brand amazing and over the last 25 years have built our business into one of NZ’s leading retailers. Working with us means you get access to some exclusive staff perks, including: Discounted; gym membership, eye care, dental care and banking products. Exclusive staff discounts on our products. Access to Employee Assistant Programme Services (Raise). Long service recognition at each of your 5-year milestones. At Harvey Norman it’s never just a job, it’s a career. If you’re the kind of person who’s dedicated, people-oriented, loves tackling new challenges and has an interest in retail, you’re perfect for us. You’ll be encouraged to show your entrepreneurial side and, if the opportunity arises, explore a role you feel best suits your skill set. Don’t miss this opportunity, APPLY NOW!", "source": "trademe", "skills": "[{\"name\": \"customer service\", \"type\": \"soft skill\"}, {\"name\": \"it certifications\", \"type\": \"certification\"}]", "salary": 0, "date": "2024-11-18", "category": "service desk"},
{"title": ".NET Developer - Security", "location": "None", "company": "Comspek International", "type": "None", "duration": "None", "description": "Description We are looking for someone with .NET Development skills who enjoys working on the security side. You'll be in a team responsible for putting security at the forefront of everything our client develops. The security knowledge we need is around securely developing in C# .NET, OAuth would be ideal. Someone that is able to describe the different types of auth flows. The ideal candidate is someone who would know that like the back of their hand. As well as good client-side and server-side secure development practices. This is a key role for the company with responsibilities to ensure that our client are secure in everything they do, especially within their development group. Working closely with the security team, you will develop solutions to drive security best practices and mitigate security vulnerabilities identified through regular penetration testing and auditing. While also implementing and assessing for vulnerabilities during our SDLC. You will also regularly update the company on any developments in security, architecture, technologies and guidelines through setting standards and facilitating discussions and workshops to improve security knowledge and tooling. Some of the key responsibilities include the following, but please note, we don't require you to have worked in all these areas. OAuth, implementing security patching/fixes for vulnerabilities or able to talk to secure development practices Remediate vulnerabilities discovered during penetration tests, security reviews, or vulnerability discovery Perform security due diligence on new projects, products, and components Drive improvements to security tooling and standards within Software Development Lifecyle Work closely with security steering group to improve ISMS posture Work with Security Architect to review and provide analysis on the current design of the platform and the proposed designs for any future projects Provide, or facilitate provision of, mentoring, training and guidance with teams and individuals where required If you are a Developer starting your journey in security we would still love to hear from you, looking for at least 3 years in development, understanding of security principles, ISO standards and SecDevOp would be welcomed. Junior to Senior options welcome to apply. Please note, you will need a valid NZ Visa for this role. Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "source": "trademe", "skills": "[{\"name\": \".net\", \"type\": \"framework\"}, {\"name\": \"c#\", \"type\": \"language\"}, {\"name\": \"oauth\", \"type\": \"protocol\"}, {\"name\": \"iso standards\", \"type\": \"certification\"}, {\"name\": \"secdevop\", \"type\": \"methodology\"}]", "salary": 0, "date": "2024-11-18", "category": "security"},
{"title": "Technical Customer Support Specialist", "location": "None", "company": "Harvey Norman", "type": "None", "duration": "None", "description": "Description Combine your IT expertise and customer service skills in this Technical Customer Support Specialist position in our Ashburton store, Computers department! This fixed term part-time role provides software and hardware support to customers and aims to grow the Tech2Home business. About the Role\nThis role installs software and hardware for customers both in the Tech-bay and customer homes providing a positive experience for all customers. Training will be provided on our systems and machinery to ensure you are fully supported when you start with us. Some key tasks will include: Troubleshoot, diagnose and provide solutions to customers on desktop, laptops, tablets, smart phones and other computer peripherals. Drive sales of Tech2Home services within the sales team, tech bay and with customers. Process all returns and faulty products correctly and dispatch for repair, replacement or credit. Liaise with suppliers and repair agents to ensure that customers get their products repaired or replaced promptly. Undertake cashiering and sales duties as required. About You\nWe are looking for a technical expert who is able to provide great customer service.\nSome attributes we are looking for include: Technical understanding of computers and computer products. Customer service skills. Current, full NZ Drivers License. Retail experience desirable. Able to work weekends and public holidays essential. About Us\nHarvey Norman was introduced to New Zealand in 1997, since then we have become a household name, with over 45 stores nationwide plus offsite warehouses, commercial offices and the Auckland Support Office. Our diverse team is made up of over 2000 individuals who each bring a uniquely dynamic expertise to the workforce. Harvey Norman continues to grow throughout New Zealand with new stores opening each year and our team grows with us. We pride ourselves on being a market leader and have a great track record of providing high quality products and outstanding customer service. Here at Harvey Norman we are proud to boast that all our General Managers and retail Store Managers have been promoted from within the business. This is your opportunity to learn from the best and grow to be one of the best! About the benefits\nOur staff make our brand amazing and over the last 25 years have built our business into one of NZ’s leading retailers. Working with us means you get access to some exclusive staff perks, including: Discounted; gym membership, eye care, dental care and banking products. Exclusive staff discounts on our products. Access to Employee Assistant Programme Services (Raise). Long service recognition at each of your 5-year milestones. At Harvey Norman it’s never just a job, it’s a career. If you’re the kind of person who’s dedicated, people-oriented, loves tackling new challenges and has an interest in retail, you’re perfect for us. You’ll be encouraged to show your entrepreneurial side and, if the opportunity arises, explore a role you feel best suits your skill set. Don’t miss this opportunity, APPLY NOW!", "source": "trademe", "skills": "[{\"name\": \"customer service\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "service desk"},
{"title": "Product Owner - 12 months Fixed Term", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description Trade Me is one of New Zealand's most popular websites with over four million members and more than 650,000 Kiwis visiting our site every day. This is a critical leadership role responsible for execution of our highest priority initiatives to deliver the outcomes and shift the metrics we care most about (OKRs). Product Owners execute initiatives through prioritisation and direct supervision of the work engineering squads do, from continuous planning, through discovery and refinement to delivery. They also ensure squads balance delivery commitments with plannable maintenance of our technology assets. Without this role we would not be able to reliably and consistently execute our strategic initiative and maintain the robust health, resilience and stability of our systems. This role would suit people with previous e-commerce experience working as a Product Manager, Product Owner or Senior Business Analyst. As a member of the Marketplace Engineering team this role's customers are Trade Me customers selling and purchasing goods and services on our e-commerce platform You'll have the best time working at Trade Me, and this is why: #Flexible Flexibility means different things to different people and we support you to find what works, including a home office set up and utilities allowance. We value team connection and come together in person on Monday and at least one other day a week. #Wellness Being your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way. #Leave We support you with leave when you need it, including 5 days wellness leave and 10 days sick leave from day 1. #Social Nothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company paid lunches. regular Friday drinks and nibbles, annual Trade Me company awards, celebrations and more. #Learning Whether it's on the job, formal training, mentoring or something else, you’ll grow with us from Day 1. Here's what you can expect from the role: Align squad work with Product and Technology Roadmaps and OKR's Create, refine and maintain and robust, adequately resourced Epic backlog Lead release change management including customer adoption/rollout planning and both internal and external engagement and communication around the change Be a strong advocate for the customers and our products Keep everyone informed and aligned Adhere to agile principles What you will bring to our team: 5+ years of experience of delivery leadership working in software development teams A proven track record of successfully developing flexible value driven product roadmaps to clarify where we are going, taking ownership of outcomes and delivering measurable results Experience with opportunity definition and discovery, goal-oriented product roadmaps and using outcome based metrics to measure the impact of change Experience working in technical roles within product driven software development teams within a complex and fast paced environment You're an outstanding communicator - able to explain ideas simply & clearly, listen carefully to others, and communicate across a wide audience You're highly organised and result oriented with strong planning and facilitation skills Experienced in leading technical teams within an agile environment with an excellent understanding of agile ways of working & engineering practices You are confident using collaborative tools to clarify work scope, sizing, trade offs, dependencies and other planning considerations. (eg. Miro, LucidChart, Jira) We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'. If you’re excited about this opportunity, we'd still really like to hear from you. Trade Me is an INZ accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"agile\", \"type\": \"methodology\"}, {\"name\": \"jira\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"planning\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "project management"},
{"title": "Software Technical Test Engineer", "location": "None", "company": "ANZCO Foods", "type": "None", "duration": "None", "description": "Description Join our ICT Team at ANZCO Foods as a Technical Test Engineer. This position is a fulltime permanent position based at our Corporate Office in Christchurch. This position will see you reporting to our Application Support and Release Manager. The Software Technical Test Engineer will be responsible for manual and automated testing of different software/systems developed for the company. ANZCO's testing team is a pioneer in using RPA tool for automated regression testing and is integrated to Azure DevOps as our test and defect management tool. Ideal Candidates for this role will possess excellent communication skills, keen attention to detail, and a strong analytical mindset. Success in this position comes from a proactive approach to problem solving and the ability to work independently. If you thrive in a self driven environment and bring relevant experience this could be your next opportunity. Duties and Responsibilities will include but won't be limited to: Review user requirements document to ensure that requirements are testable and ask meaningful questions that will yield more information to help perform testing effectively. Recommend, build, and maintain automated testing tools that can integrate to ANZCO's ecosystem. Develop test plans, manual test cases, automated test scripts and test reports on multiple projects of varying size. Execute tests and log bug work items with complete information that helps in defect resolution. Engage in all test phases and testing activities to ensure the solutions are fully tested, test deliverables are documented and sign off acquired to proceed to next phase. Skills and Experience we are looking for: BSc/BA in Computer Science, Engineering, or a related field experience Proven experience as a Software Technical Test Engineer or similar role Knowledge in Software Development Life Cycle Methodologies such as Agile, V-Model, and Waterfall Knowledge in Test Automation Knowledge in Test and Defect Management Familiarity with CMMI and Agile processes Ability to perform root cause analysis and document the errors Working knowledge of test and defect management software (e.g., Azure DevOps, JIRA, ALM) and SQL or equivalent We deliver taste, nutrition, and wellbeing to the world with products made from New Zealand finest beef and lamb. Our values of atawhai­tanga, noho haepapa, kaitiakitanga, auahatanga, and whakawhirinakitanga guide us to work together, follow through on our commitments, make improvements, and do our best to make sustainable decisions for the future. We are committed to supporting and developing our people and we offer a competitive remuneration package.  If you are motivated, have the skills and experience we require and want to be part of the exciting future of our company then we want to hear from you. Apply today at http://www.careers.anzcofoods.com Applications close: Monday 18th November 2024", "source": "trademe", "skills": "[{\"name\": \"azure devops\", \"type\": \"tool\"}, {\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"agile\", \"type\": \"methodology\"}, {\"name\": \"v-model\", \"type\": \"methodology\"}, {\"name\": \"waterfall\", \"type\": \"methodology\"}, {\"name\": \"test automation\", \"type\": \"tool\"}, {\"name\": \"test and defect management\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "testing"},
{"title": "CONTRACT Angular / C#.Net Fullstack Software Devel", "location": "None", "company": "Sunstone Talent", "type": "None", "duration": "None", "description": "Description CONTRACT C#.Net Fullstack Engineer? TypeScript? Angular? AWS? Long-term gig? Work on leading edge AWS projects building new features & functionality? Good team environment modern offices, free park in Chch hybrid working An interesting company is looking for a CONTRACT Angular / C#.Net Fullstack Engineer working on new AWS cloud projects Do you enjoy solving real world problems? Do you like building new features & functionality for web apps in the cloud? What you'll bring: BSc or BEng or similar degree or not MUST have solid TypeScript & Angular2+ experience Any experience of Angular.js to Angular2+ migration experience of interest At least 4 years C#.Net / JavaScript (and/or TypeScript) experience Some experience with AWS Accustomed to working in agile / scrum teams Good SQL server and/or PostGreSQL What you'll get: Market hourly rate for 6 month contract (lots of work so will roll on) Work on a modern tech stack within a good team environment Modern offices role is based in Christchurch + Free parking + flexible hybrid working (2/3 days working from home) MUST have right to work in NZ and be based in Christchurch Come join a great bunch of humans working on new AWS cloud projects in a friendly, supportive & flexible team :-) Please Click Apply now sending your CV & Cover Letter (If you prefer happy to receive short video 60-90 secs max / MP4 with 1gb or less) or direct to mailto:paul@sunstonetalent.com", "source": "trademe", "skills": "[{\"name\": \"c#.net\", \"type\": \"language\"}, {\"name\": \"typescript\", \"type\": \"language\"}, {\"name\": \"angular\", \"type\": \"framework\"}, {\"name\": \"aws\", \"type\": \"platform\"}, {\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"postgresql\", \"type\": \"database\"}, {\"name\": \"agile\", \"type\": \"methodology\"}, {\"name\": \"scrum\", \"type\": \"methodology\"}]", "salary": 0, "date": "2024-11-18", "category": "programming & development"},
{"title": "Senior Consultant - ERP Cloud", "location": "None", "company": "Comspek International", "type": "None", "duration": "None", "description": "Description Are you an experienced ERP Consultant looking for a new challenge? \nWe are seeking a Senior Consultant to join our client's team, specialising in Oracle Cloud ERP, to work closely with clients to design, configure, and implement tailored business solutions across various ERP modules. Key Responsibilities: Provide high-quality business consulting services to clients, focusing on Oracle Cloud ERP solutions in modules including General Ledger, Accounts Payable, Accounts Receivable, Fixed Assets, and Cash Management. Lead or support the full cycle of ERP project implementation: from design and configuration to change management planning, business-focused testing, and training delivery. Contribute specialized knowledge in at least one business consulting discipline, such as business strategy, industry insights, organizational change, ERP product expertise, or business process architecture. Act as a business resource on project teams or lead and mentor other business consultants to deliver high-impact, effective ERP implementations. Requirements: Demonstrated expertise in Oracle Cloud ERP, with hands-on experience across the financial modules mentioned. Significant consulting experience, ideally within the New Zealand market, with a solid understanding of the local business landscape. Proven skills in stakeholder management, communication, and the ability to adapt to diverse client needs. A strong background in one or more business consulting disciplines, with the ability to advise and guide clients on best practices. Prior experience acting as a trusted advisor or leader in an ERP consulting capacity is highly desirable. If this sounds like you - apply now! Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "source": "trademe", "skills": "[{\"name\": \"oracle cloud erp\", \"type\": \"platform\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "consultant"},
{"title": "Graduate C++ Software Engineer", "location": "None", "company": "Sunstone Talent", "type": "None", "duration": "None", "description": "Description BSc Computer Science or Physics or Maths or BEng in Software Engineering? Build new features & functionality in C++ / QT desktop apps Get great training, work in a modern office in a supportive, friendly culture? A modern cloud-based company is looking for a Graduate C++ Software Engineer to join an Agile development team\nBSc in Computer Science or similar? BEng in Software Engineering or similar? Want to get great training, work in a modern office in a supportive, friendly culture? You'll work on building new features & functionality in C++ / QT desktop applications for the largest companies in the world What you'll bring: BSc Computer Science or Physics or Maths or BEng in Software Engineering or Mechatronics or hobbyist coder with C++ experience 0-6 months commercial internship software experience with C++ or similar OO programming experience like C#.Net, Java or Python Experience in development of desktop applications ideally with C++ / QT for multi-platform development (Windows, Mac & Linux) or similar Join a fun agile team delivering software to a global customer base A bonus if you have any Mobile iOS / Android dev skills or want to learn You'll be a collaborative team player What you'll get: Work on developing apps in C++ for multi-platform (Windows, MacOS, Linux, Android, iOS) Relaxed, innovative, supportive, kind agile team Modern deployment & tooling (Atlassian, GIT) Get your own electronic sit-stand desk, ultra-wide curved widescreen monitors, i9 powered desktop & Sony noise-cancelling headphones Christchurch based role with great benefits including: Bonus$$, pair programming, on the job training, great coffee, wellness benefit, modern offices & flexible / working from home Come join a great team culture that has great training, is kind & supportive with career progression Please Click Apply now sending your CV & Cover Letter (If you prefer happy to receive a short video 60-90 secs maximum / MP4 with 1gb or less) or direct to mailto:paul@sunstonetalent.com", "source": "trademe", "skills": "[{\"name\": \"c++\", \"type\": \"language\"}, {\"name\": \"qt\", \"type\": \"framework\"}, {\"name\": \"c#\", \"type\": \"language\"}, {\"name\": \"java\", \"type\": \"language\"}, {\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"agile\", \"type\": \"methodology\"}, {\"name\": \"git\", \"type\": \"tool\"}, {\"name\": \"atlassian\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "programming & development"},
{"title": "Senior Developer", "location": "None", "company": "Comspek International", "type": "None", "duration": "None", "description": "Description Are you a Senior Developer who loves to mentor and lead, utilising your 7-10 years of core Dev experience? Long term contract, ASAP start. You will be working in an agile team to analyse business processes and user requirements to establish the technical design of a key new banking platform. You will be writing quality code, with extensive test coverage in a high standard engineering environment, whilst providing support, peer reviewing code and technical leadership. About the tech stack, our client is looking for: Expertise in designing RESTful APls, OpenAPI Expertise in API security- authentication using OIDC flows, coarse grained authz using scopes, fine grained authz using PBAC, Oauth 2.0 for APlsExpert in developing Java Spring boot applications Experience in designing databases along with authentication, performance, security, batch jobs Proficiency in applying OWASP security practice Experience in using API gateways like Kong, Apigee Expertise with Kubernetes cloud development If interested, please apply ASAP or reach out to the team. Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;amp;rsquo; needs. So, if you&amp;amp;amp;rsquo;re excited about this role, we encourage you to apply.", "source": "trademe", "skills": "[{\"name\": \"java\", \"type\": \"language\"}, {\"name\": \"spring boot\", \"type\": \"framework\"}, {\"name\": \"api\", \"type\": \"protocol\"}, {\"name\": \"openapi\", \"type\": \"framework\"}, {\"name\": \"oidc\", \"type\": \"protocol\"}, {\"name\": \"oauth 2.0\", \"type\": \"protocol\"}, {\"name\": \"owasp\", \"type\": \"methodology\"}, {\"name\": \"kong\", \"type\": \"tool\"}, {\"name\": \"apigee\", \"type\": \"tool\"}, {\"name\": \"kubernetes\", \"type\": \"platform\"}]", "salary": 0, "date": "2024-11-18", "category": "programming & development"},
{"title": ".NET Developer - Intermediate", "location": "None", "company": "Comspek International", "type": "None", "duration": "None", "description": "Description We have a great opportunity for a skilled .NET Developer (Intermediate level) to join our client on a one-year fixed term contract. Based in the Wellington CBD, hybrid set up. Our client is in the financial sector, small - medium size with a lot of potential, constantly recruiting over the last few years with no signs of slowing down. This will be working across the Full Stack with slightly more weight towards the the back end. Hosted on AWS and main skills being C# / .NET. Don't want to list the full list of technologies as we don't need people ticking every single box there, it's more about team fit, someone confident in their coding ability. If you're interested, please apply and we will reach out, have a JD available too. Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "source": "trademe", "skills": "[{\"name\": \".net\", \"type\": \"framework\"}, {\"name\": \"c#\", \"type\": \"language\"}, {\"name\": \"aws\", \"type\": \"platform\"}]", "salary": 0, "date": "2024-11-18", "category": "programming & development"},
{"title": "Senior IT Support Specialist", "location": "None", "company": "Rocket Lab", "type": "None", "duration": "None", "description": "Description ABOUT ROCKET LAB Rocket Lab is a global leader in launch and space systems. The rockets and satellites we build and launch enable some of the most ambitious and vital space missions globally, supporting scientific exploration, Earth observation and missions to combat climate change, national security, and exciting new technology demonstrations. Our Electron rocket has provided reliable access to orbit since 2018, becoming one of the most frequently launched rockets in the world. Neutron will be our next rocket on the launch pad, an advanced 13-tonne payload class, reusable rocket to launch the mega constellations of the future. Our space systems business includes our extensive line of satellites and components that have enabled more than 1,700 missions including the James Webb Space Telescope, NASA Psyche Mission, Artemis I, Mars Ingenuity helicopter, and more.\nRocket Lab's IT team is responsible for how our global teams access information and run operations across our computer systems, networks, and devices. Our hardworking IT team is a group of flexible problem-solvers working in a fast-paced environment but who also thrive under the challenge of supporting all of our proprietary systems and people, from finance to launch operations. WHAT YOU'LL GET TO DO: The Senior IT Support Specialist, works closely with the IT Client Services Team Lead, and Warkworth Composites Complex (WCC) site Manager. You will be the sole support person for on-site IT Infrastructure (clients, servers and network) for the staff and Launch Engineers/ Technicians. Carrying out the day-to-day functions required to provide the efficient delivery of IT services to Rocket Lab You will also be first point of contact for any onboarding of new hires to ensure they are setup and productive from day one Provide instruction, guidance, technical support and documentation to different teams Deliver and support IT systems through efficient management of the IT Service Desk Build strong relationships - be the Subject Matter Expert Provide some Launch Operation support during Launch periods This position will suit someone who is seeking autonomy and ownership over their own facility whilst having the support of the wider IT team to collaborate on technical solutions. YOU'LL BRING THE BELOW EXPERIENCE: 2+ Years' experience in a support or service role Has a basic understanding and has experience in following a framework for service delivery such as ITIL Operational knowledge of: Windows and/or Linux desktop operating systems PC hardware including the ability to assemble and dissemble desktop PCs Active Directory and Group Policy Understanding of networking infrastructure Cloud based technologies: Azure, AWS, O365, etc THESE SKILLS WOULD BE NICE TO HAVE: Certifications in CompTIAA+ or ITIL would be highly desirable Windows and/or Linux server (Ubuntu/Debian) enterprise environments Virtualization technologies, public / private cloud. Security Frameworks and technology: ISO 27001, NIST 800-171, IPSEC, SSL VPNs, firewalls, etc. STAND OUT in your application: To increase your chances of being shortlisted for this position, please provide your CV and Cover Letter in PDF format only, and quote the value of a TXT record under the public job reference number subdomain of our domain (i.e. #.rocketlabusa.com). You can find the public job reference number on https://www.rocketlabusa.com/careers Important information: FOR CANDIDATES SEEKING TO WORK IN NEW ZEALAND OFFICES ONLY: For security reasons background checks will be undertaken prior to any employment offers being made to an applicant. These checks will include nationality checks as it is a requirement of this position that you be eligible to access equipment and data regulated by the United States' International Traffic in Arms Regulations. Under these Regulations, you may be ineligible for this role if you do not hold citizenship of Australia, Japan, New Zealand, Switzerland, the European Union or a country that is part of NATO, or if you hold ineligible dual citizenship or nationality. For more information on these Regulations, click here ITAR Regulations.", "source": "trademe", "skills": "[{\"name\": \"azure\", \"type\": \"platform\"}, {\"name\": \"aws\", \"type\": \"platform\"}, {\"name\": \"o365\", \"type\": \"platform\"}, {\"name\": \"itil\", \"type\": \"certification\"}, {\"name\": \"compTIA a+\", \"type\": \"certification\"}, {\"name\": \"iso 27001\", \"type\": \"certification\"}, {\"name\": \"nist 800-171\", \"type\": \"certification\"}, {\"name\": \"ipsec\", \"type\": \"protocol\"}, {\"name\": \"ssl vpn\", \"type\": \"protocol\"}, {\"name\": \"firewalls\", \"type\": \"tool\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "service desk"},
{"title": "Software Test Lead & Applications Support", "location": "None", "company": "Sunstone Talent", "type": "None", "duration": "None", "description": "Description Test Lead & Applications Support of large software enterprise software? Love getting QA just right? Enjoy breaking systems? Lead by example? Work on a large project transformation project that will make a difference? A growing company is looking for a Software Test Lead & Applications Support to help design & develop test methodology & strategy, and support software applications within a large CRM / Salesforce project Do you enjoy testing & supporting great software? Enterprise software project experience? Any CRM/ERP or Salesforce experience of interest? As a Test Lead do you enjoy being hands-on, leading by example, solving problems, working with internal customers and a variety of relationships including development / delivery teams and 3rd party vendors? Get awesome outcomes? What you'll bring: BA, BCom or BSc or similar degree or not 6 years+ software testing experience including manual, exploratory, functional and understanding of automation You'll have an analytical approach and love championing QA Develop test scripts in JIRA Train SMEs on the testing process Organise and set up testing, oversee & manage Manage bug reporting and retest Develop reports/metrics to illustrate test progress Advise on environment setup/deployment Test strategy and design, execution and reporting Good understanding of Agile, JIRA the full SDLC Happy to help out with App support when needed on the project - ie good trouble-shooting skills & root cause analysis Love getting great win / win outcomes for everyone in the business :-) What you'll get: Good down-to-earth culture with modern offices Work on a large Salesforce / CRM project that will make a difference On-going project work with great people Get in touch with Paul if you're a Test Lead who enjoys championing QA and doesn't mind rolling up their sleeves, helping out with Apps support and leading a small team with a smile :-) Please Click Apply now sending your CV & Cover Letter (Happy to receive a short video 60-90 secs maximum / MP4 with 1gb or less if you prefer) or direct to mailto:paul@sunstonetalent.com", "source": "trademe", "skills": "[{\"name\": \"salesforce\", \"type\": \"platform\"}, {\"name\": \"jira\", \"type\": \"tool\"}, {\"name\": \"agile\", \"type\": \"methodology\"}, {\"name\": \"troubleshooting\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "testing"},
{"title": "Product Designer - Senior", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description Trade Me is one of New Zealand's most popular websites with over four million members and more than 650,000 Kiwis visiting our site every day. Our Property team delivers exceptional product experiences that keep Kiwi engaged and coming back to us. We're now looking for a Senior Product Designer to join us in delivering visual and interactive design solutions on our Property app that meets both user and business needs in an engaging, 'Trade Me' way. You'll have the best time working at Trade Me, and this is why:\n#Flexible - Flexible working is the new normal. We have a guideline for our people to be in the office 60% of the time, with the remaining time being flexible. We support you with a home office setup and a utilities allowance to ensure you can work comfortably\n#Wellness - Being your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way.\n#Leave - We support you with leave when you need it, including 5 days of wellness leave each year and 10 days of sick leave from day 1.\n#Social - Nothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company paid lunches. Regular drinks and nibbles, annual Trade Me company awards, celebrations and more.\n#Learning - Whether it's on the job, formal training, mentoring or something else, you'll grow with us from Day 1. Here's what you can expect from this role: Be involved in all stages of design, from project inception through to live product. Foster a culture of design collaboration and advocate for great design practice through leading by example. Create high-fidelity designs, crafting the visual details using design software. Promote and encourage user testing of your work throughout the design lifecycle. Use creative problem solving, such as Design Thinking, to guide design processes to understand the best way to solve customer problems. Use Key Experience Indicators (KEI's) to ensure that we are creating polished products our users love Work within a squad, and with other cross-functional teams to deliver product features that  solve customer problems and deliver business value. What you will bring to our team: You're curious and driven to understand our consumers and their problems deeply. A strong focus and consideration on UX and UI in the design of products and features. 5+ years' experience in similar design roles using Figma, HTML & CSS (basic understanding), presentation software (Microsoft PowerPoint, Keynote, Google Slides). A solid understanding of Material Design guidelines for Android and Human Interface Guidelines for iOS. Ability to build strong and influential stakeholder relationships across the business We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'. If you're excited about this opportunity, we'd still really like to hear from you. Trade Me is an INZ accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"figma\", \"type\": \"tool\"}, {\"name\": \"html\", \"type\": \"language\"}, {\"name\": \"css\", \"type\": \"language\"}, {\"name\": \"design thinking\", \"type\": \"methodology\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "web design"},
{"title": "CTO - Hands On", "location": "None", "company": "Comspek International", "type": "None", "duration": "None", "description": "Description We are looking for a star to join our client, a start-up with strong momentum in the AI/SaaS space. Our client has a long road-map of product development which includes growing the business offshore, and they're strongly funded. This is more than just a Full Stack Developer role, you will play a big part in the technology strategy and own the tech, working as a Lead Developer / CTO. Potential for shares/equity/co-founder opportunity. The tech stack is below: Backend: Experience in Python, ideally also in FastAPI, SQLalchemy, Alembic. Frontend: Typescript and VueJS, ideally also in Vite, Pina, TailwindCSS. Infrastructure: Experience deploying on major IaaS providers (Azure preferred). Tools: Terraform, docker, Github Actions. LLMs: Experience or working knowledge of OpenAI, Chat GPT, or similar. Ideally working with their APIs and with prompt engineering. Looking for someone who can spearhead a faster GTM developer delivery model, where our client can fully leverage AI in the coding strategy. If you would like to have a phone chat to go over the role more, feel free to reach out direct, or please apply and we can respond with a JD. Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "source": "trademe", "skills": "NULL", "salary": "NULL", "date": "2024-11-18", "category": "None"},
{"title": "L1 IT Support Technician", "location": "None", "company": "Adecco Personnel Limited", "type": "None", "duration": "None", "description": "Description Qualifications Education : Associate degree in Information Technology or a related field preferred; relevant certifications (e.g., CompTIA A+, ITIL) are a plus. Experience : Previous 3 years of experience in an IT support role is advantageous. Technical Skills : Familiarity with Windows and macOS operating systems. Basic understanding of networking concepts and hardware components. Experience with mobile device configuration (iOS and Android). Soft Skills : Excellent communication and interpersonal skills. Strong problem-solving abilities and attention to detail. Ability to work independently and as part of a team. Working Conditions Full-time position, may require occasional evening or weekend support. Work is primarily conducted in an office environment, with some on-site visits to assist users. Key Responsibilities Technical Support : Provide first-level support for hardware and software issues via phone, email, or in-person. Diagnose and troubleshoot computer and network problems. Resolve user issues related to operating systems, applications, and hardware peripherals. Asset Management : Maintain accurate inventory of IT assets, including laptops, mobile devices, and software licenses. Assist with the procurement and deployment of IT equipment as needed. Track and manage the lifecycle of IT assets from acquisition to disposal. Configuration and Setup : Configure laptops and mobile devices for new users according to company standards. Install and update software applications and system updates. Ensure all devices are secure and compliant with company policies. Documentation and Reporting : Maintain detailed records of support requests, resolutions, and user interactions in the ticketing system. Generate reports on support trends and asset utilization. User Training and Guidance : Provide basic training and guidance to users on software applications and IT tools. Assist in creating user manuals and instructional materials. \"As one of the world's largest employers, we believe in talent not labels, and focus on the diverse and unique skills our people bring. Our commitment to equal opportunity, inclusion, and diversity is part of our broader dedication to respecting fundamental human rights across our value chain. We seek to foster a culture of belonging and purpose, an environment where everyone can thrive and feel engaged, and where difference is respected and valued.\"", "source": "trademe", "skills": "[{\"name\": \"comptia a+\", \"type\": \"certification\"}, {\"name\": \"itil\", \"type\": \"certification\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "service desk"},
{"title": "Systems Support Specialist", "location": "None", "company": "Octane", "type": "None", "duration": "None", "description": "Description About the company\nOctane has over 20 years of experience in the fuel industry and is the leading end-to-end ERP solution for fuel distributors. With an international presence, Octane has operations in Australia, New Zealand, and Canada.  A major component of the Octane solution is the class-leading in-cab touchscreen computing solution that allows fuel delivery drivers to record every aspect of their daily tasks.  It provides real-time capture &amp; recording of fuel transactions, route optimisation, inventory monitoring, customer signature capture, GPS mapping and many more relevant functions.  The application is delivered over specialist rugged hardware and communicates with the Octane ERP system via web services.\nAbout the Role\nReporting to the Octane Onboards Support Manager, this role involves application &amp; hardware support.  Customer support is predominantly via email and phone, along with direct involvement in customer rollout and upgrade projects.  The role also requires involvement in testing upgrades, new features and the latest releases liaising directly with the development team.\nTo be successful in this role, you will have: Remote support experience in a related area Exposure to ERP system support Strong verbal and written communication skills including sound English language skills An ability to quickly understand customer issues and provide fast and efficient resolution in a professional manner Documentation skills A keen eye for detail and the ability to translate technical jargon into non-technical responses Demonstrated proficiency using and managing MS Windows 10/11 operating systems Desirable skills &amp; experience: Experience in supporting bespoke software Experience with Remote Support applications ? N-Central, TeamViewer Experience with N-Central for group-wide device management We are seeking someone who thrives on providing excellent customer service with strong attention to detail and a passion for problem-solving.  You will be comfortable working in a team environment as well as independently.\nIn return, you will be given the opportunity to be part of a high performing team in a company with strong values and excellent international growth potential. \nThis is a full-time position based in our Hamilton Office. Regular after-hours On Call Support (on a shared Rota basis) will also be required in this role.", "source": "trademe", "skills": "[{\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"customer service\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"documentation\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"n-central\", \"type\": \"tool\"}, {\"name\": \"teamviewer\", \"type\": \"tool\"}, {\"name\": \"erp\", \"type\": \"platform\"}]", "salary": 0, "date": "2024-11-18", "category": "service desk"},
{"title": "Senior Project Manager", "location": "None", "company": "Comspek International", "type": "None", "duration": "None", "description": "Description Our client is looking for an experienced Senior Project Manager to work on projects for a large finance transformation. Requirements: Proven experience in project management within large enterprise finance functions Strong understanding of IT and Finance processes and workflows Excellent project planning skills, with expertise in using project management tools Ability to manage stakeholders and work collaboratively across departments If this sounds like you then apply now and one of our consultants will be in touch. Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "source": "trademe", "skills": "[{\"name\": \"project management\", \"type\": \"methodology\"}, {\"name\": \"project management tools\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "project management"},
{"title": "Senior Reporting Analyst - 12-Month Fixed Term", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description Trade Me, we're about connecting Kiwi to create the life they want. Whether it's the big things like finding a home, a job, a car or growing their business, or the smaller things, like finding that right bedside table or parting ways with some old stuff. At Trade Me our vision is to be the place where Kiwi look first. We are looking for a passionate Senior Insights or Reporting Analyst with commercial acumen who has a keen interest in working with all things data across our Motors team for a 12-month fixed-term role. You'll play an important role in understanding our customers and providing meaningful insights that help us to identify opportunities, test hypotheses and inform our sales, product, and marketing strategies. This role can be based out of Auckland, Wellington or Christchurch. You'll have the best time working at Trade Me, and this is why:\n#Flexibility\nFlexible working is the new normal. We have a guideline for our people to be in the office 60% of the time, with the remaining time being flexible. We support you with a home office setup and a utilities allowance to ensure you can work comfortably.\n#Wellness\nBeing your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way.\n#Leave \nWe support you with leave when you need it, including 5 days of wellness leave each year and 10 days of sick leave from day 1. #Social Nothing beats getting together to have some fun and celebrate our success.  Join us in the office on payday for company paid lunches.  Regular Friday drinks and nibbles, annual Trade Me company awards, celebrations and more.\n#Learning \nWhether it's on the job, formal training, mentoring or something else, you'll grow with us from Day 1. Here's what you can expect from this role: Work with stakeholders and analysts to migrate our reporting suite in PowerBI to using the new Snowflake data source Design, and develop data/dashboard requests for BAU reporting Work with product managers and squad members to ideate and undertake competitor research (if required), thinking of ways to evaluate options and influence the direction of products aligned to the Trade Me Strategic focus areas Go beyond the numbers to identify causes for user behaviour with sight of the potential for commercial value Dig into the data to understand the drivers of our business, causes of the trends and what we can do about it Design, produce and present insights products to stakeholders across the business in a way that allows them to make decisions Lead the use of data to evaluate experimentation such as A/B test design and monitoring Provide mentoring and coaching to other members of the team, helping them to understand different approaches, tools, and insights What you will bring to our team: Approximately 5+ years' experience in commercial data environments BI and/or analytics experience working with large datasets Experience with SQL and any data visualisation tool (e.g. Power BI) is a must Experience in Python or R are desirable Experience with Google data products are desirable (e.g. Google Analytics, Big Query, Google Tag * Manager, Adwords, Google Cloud Services) Experience with AB testing and experimentation would be desirable A proven ability to establish excellent cross-functional working relationships across all people within the company and key customers The ability to convey complex, technical information to non-technical persons Demonstrated ability to deliver projects in a fast-paced, results-oriented environment Good organisation, communication, negotiation, and analytical skills We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'.  If you're excited about this opportunity, we'd still really like to hear from you. Trade Me is an INZ-accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"power bi\", \"type\": \"tool\"}, {\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"r\", \"type\": \"language\"}, {\"name\": \"google analytics\", \"type\": \"tool\"}, {\"name\": \"big query\", \"type\": \"database\"}, {\"name\": \"google cloud services\", \"type\": \"platform\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"analytical\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "business & systems analysts"},
{"title": "Product Manager - Senior", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description Trade Me is one of New Zealand's most popular websites with over four million members and more than 650,000 Kiwis visiting our site every day. We are seeking two highly motivated Senior Product Managers to join our Marketplace and Property B2B teams. The ideal candidates will be customer-centric individuals with a proven track record in product leadership and commercial acumen. They will have excellent communication and influencing skills, and be able to inspire and lead a cross-functional team to deliver outstanding results. Property B2B:  \nThis strategic role will need to help customers advertising property. Working closely together with your engineering, design, sales and marketing teams, you’ll identify opportunities and take solutions to market that align with our company and Property strategy. Marketplace:  \nYour focus will be on leading the product strategy and long term roadmap for our buyer and casual sellers across our Marketplace. This is a highly autonomous role with a high impact for our customers and business outcomes. Please let us know in your cover letter or CV if you have a preference for either Property or Marketplace or both. You'll have the best time working at Trade Me, and this is why: \n#Flexible \nFlexible working is the new normal. We have a guideline for our people to be in the office 60% of the time, with the remaining time being flexible. We support you with a home office setup and a utilities allowance to ensure you can work comfortably\n#Wellness \nBeing your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way.\n#Leave \nWe support you with leave when you need it, including 5 days of wellness leave each year and 10 days of sick leave from day 1.\n#Social \nNothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company paid lunches. Regular Friday drinks and nibbles, annual Trade Me company awards, celebrations and more.\n#Learning \nWhether it's on the job, formal training, mentoring or something else, you'll grow with us from Day 1. Here's what you can expect from this role: We're making meaningful headway into solving our customers' problems through improvements and innovations to our product offering, and we're achieving our desired customer and commercial outcomes. We have a 1 -3 year view of the problems we’re aiming to tackle and an outcome based roadmap to support it that our teams buy into. Strong discovery practices help us deeply understand the customer challenges we seek to solve. Problems are validated before we start building. Our teams are highly engaged with the ongoing customer and business value we're looking to deliver, and we're great at experimenting to quickly learn how to deliver the most value. We have transparent measurements of success that focus our efforts on outcomes over outputs, and help align our execution efforts with our long term strategic goals. Your stakeholders are involved and well informed with the problem you are trying to solve. We ruthlessly prioritise. We only work on things that provide value, we know when to stop iterating on an idea. You're creating and fostering a diverse and inclusive environment. What you will bring to our team: An experienced product professional (5+ years), having led product strategies that have achieved proven customer and commercial results. Experienced at building & creating digital products that New Zealanders love. Able to demonstrate experience across all aspects of product management, including prioritisation, measuring impact, competitor analysis, market research, UX testing, product marketing and strategy & roadmap development. A good strategist, creative thinker and commercially astute. You'll have a good understanding of what works online, and be able to use sound judgement to assess the value of a diverse range of initiatives. Commercially savvy, able to assess performance vs expectations. Adept in analytical capabilities, ability to identify patterns and convert to recommendations. Empathetic to customer needs and consistently seek opportunities to meet and understand our customers better Experienced in the Agile software development framework. Energetic, driven and enthusiastic for excellent results and have a genuine desire to help engage and motivate other cross-functional teams. An outstanding communicator - able to explain ideas simply & clearly, listen carefully to others, and proactively improve team communication. Confident in communicating to stakeholders and consumers. We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'. If you're excited about this opportunity, we'd still really like to hear from you. Trade Me is an INZ accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"agile\", \"type\": \"framework\"}]", "salary": 0, "date": "2024-11-18", "category": "other"},
{"title": "ICT Support Technician", "location": "None", "company": "VIP Coatings", "type": "None", "duration": "None", "description": "Description VIP coatings have a full year booked for production and is a well-established operating business we are looking for an experienced ICT Support Technician to join our team in Rolleston.\nVIP Coatings are embracing staff to make a positive impact, have mutual respect, and enjoy the process with the team.\nThe Coatings division is owned and operated by the VIP Steel brand which has proven itself to have a strong dedicated culture that bonds teamwork and produces results. We are looking for experienced ICT Support Technician that has the below attributes and abilities. At least three years of relevant experience Ability to determining software and hardware requirements to provide solutions to problems Able to linking data throughout our systems Implementing computer networks Responding to inquiries about software and hardware problems Automate systems and processes Installing and downloading appropriate software General emailing and correspondence with Project Managers of tracking status Adapting existing programs to meet VIP Coatings requirements Designing and maintaining websites Repairing and replacing peripheral equipment such as terminals, printers and modems Key Attributes Required Interested to learn the industry and processes Must have a great attitude and be a team player Excellent Computer navigation and competency Accurate, organised and proactive Self-motivated and a forward-thinking attitude Willingness to grow and develop with the company Health and safety focused The role is Permanent Monday-Friday Guaranteed minimum 30 hours, normal working hours are 40-45 hours a week Pay from $28.50 per hour minimum to $32.00 depending on experience and role. Location of the job is Rolleston, Canterbury Stability with job security Health and safety focused operations Team orientated culture Applicants for this position should have NZ residency or a valid NZ work visa", "source": "trademe", "skills": "[{\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}]", "salary": 66560, "date": "2024-11-18", "category": "service desk"},
{"title": "Senior Reporting Analyst - 12-Month Fixed Term", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description Trade Me, we're about connecting Kiwi to create the life they want. Whether it's the big things like finding a home, a job, a car or growing their business, or the smaller things, like finding that right bedside table or parting ways with some old stuff. At Trade Me our vision is to be the place where Kiwi look first. We are looking for a passionate Senior Insights or Reporting Analyst with commercial acumen who has a keen interest in working with all things data across our Motors team for a 12-month fixed-term role. You'll play an important role in understanding our customers and providing meaningful insights that help us to identify opportunities, test hypotheses and inform our sales, product, and marketing strategies. This role can be based out of Auckland, Wellington or Christchurch. You'll have the best time working at Trade Me, and this is why:\n#Flexibility\nFlexible working is the new normal. We have a guideline for our people to be in the office 60% of the time, with the remaining time being flexible. We support you with a home office setup and a utilities allowance to ensure you can work comfortably.\n#Wellness\nBeing your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way.\n#Leave \nWe support you with leave when you need it, including 5 days of wellness leave each year and 10 days of sick leave from day 1. #Social Nothing beats getting together to have some fun and celebrate our success.  Join us in the office on payday for company paid lunches.  Regular Friday drinks and nibbles, annual Trade Me company awards, celebrations and more.\n#Learning \nWhether it's on the job, formal training, mentoring or something else, you'll grow with us from Day 1. Here's what you can expect from this role: Work with stakeholders and analysts to migrate our reporting suite in PowerBI to using the new Snowflake data source Design, and develop data/dashboard requests for BAU reporting Work with product managers and squad members to ideate and undertake competitor research (if required), thinking of ways to evaluate options and influence the direction of products aligned to the Trade Me Strategic focus areas Go beyond the numbers to identify causes for user behaviour with sight of the potential for commercial value Dig into the data to understand the drivers of our business, causes of the trends and what we can do about it Design, produce and present insights products to stakeholders across the business in a way that allows them to make decisions Lead the use of data to evaluate experimentation such as A/B test design and monitoring Provide mentoring and coaching to other members of the team, helping them to understand different approaches, tools, and insights What you will bring to our team: Approximately 5+ years' experience in commercial data environments BI and/or analytics experience working with large datasets Experience with SQL and any data visualisation tool (e.g. Power BI) is a must Experience in Python or R are desirable Experience with Google data products are desirable (e.g. Google Analytics, Big Query, Google Tag * Manager, Adwords, Google Cloud Services) Experience with AB testing and experimentation would be desirable A proven ability to establish excellent cross-functional working relationships across all people within the company and key customers The ability to convey complex, technical information to non-technical persons Demonstrated ability to deliver projects in a fast-paced, results-oriented environment Good organisation, communication, negotiation, and analytical skills We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'.  If you're excited about this opportunity, we'd still really like to hear from you. Trade Me is an INZ-accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"power bi\", \"type\": \"tool\"}, {\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"r\", \"type\": \"language\"}, {\"name\": \"google analytics\", \"type\": \"tool\"}, {\"name\": \"big query\", \"type\": \"tool\"}, {\"name\": \"google tag manager\", \"type\": \"tool\"}, {\"name\": \"adwords\", \"type\": \"tool\"}, {\"name\": \"google cloud services\", \"type\": \"tool\"}, {\"name\": \"a/b testing\", \"type\": \"methodology\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"negotiation\", \"type\": \"soft skill\"}, {\"name\": \"analytical\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "other"},
{"title": "Product Manager - Customer Engagement", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description Trade Me is one of New Zealand's most popular websites with over four million members and more than 650,000 Kiwis visiting our site every day. We are seeking a Product Manager to join our Marketplace team. The ideal candidate will be a customer-centric individual with a proven track record in product leadership and commercial acumen. You will have excellent communication and influencing skills, and be able to inspire and lead a cross-functional team to deliver outstanding results. Product managers at Trade Me are great at adapting to different challenges and collaborating closely with their teams and colleagues, always keeping our customers' needs front and centre. \nWhile we continuously evolve our product practice you can expect your role to include these responsibilities: You shape, own and communicate the mission and product strategy for marketing technology at Trade Me, to meet our business goals and create value for customers aligned with our long term vision. You develop and maintain an outcome-based roadmap of customer engagement opportunities and bets prioritised against our OKR and KPI. Working with data analysts, UX designers and engineers, and by talking with customers as often as possible, you gain and share deep knowledge of customer needs, both current and expected future requirements. This specific role has stakeholders across all of Trade Me's product verticals, as well as in leadership teams, so your internal customer engagement and understanding of needs and requirements is critical to generating external customer value. You realise continuous return on investment of our third party marketing technology platforms by regularly identifying and validating new product opportunities, maintaining great relationships with the vendors, and managing the full product lifecycle from go-to-market, to pricing and end-of-life. Working closely with product owners and lead engineers, you translate the product strategy into a delivery roadmap of customer outcomes, managing dependencies and priorities across multiple teams. Considering your product domain, you take a leading role in measuring product performance and customer behavioural metrics, helping us shape our practice of measuring customer value and product success across all product teams. For this demanding role stretching across product management, technology and marketing, we think you should bring these qualifications and experience: You've helped to create and build digital products that Kiwis love - we're Trade Me after all! You've got at least 5 years of working in product management roles, having led product strategies and demonstrated customer value and commercial results. In those roles, you've gained extensive and hands-on experience across all aspects of product management, including ideation, prioritisation frameworks, measuring impact, competitor analysis, market research, experimentation and UX testing, product marketing, strategy and roadmap development. You bring a good balance between strategic and creative thinking for commercial outcomes. You have a good understanding of what works online, and are able to use sound judgement to assess the value of a diverse range of initiatives. Data forms the basis of all your decision and suggestion making, including assessing business performance vs. expectations, analysing and identifying customer behaviour, and interpreting qualitative customer research. You're familiar with a range of research and experimentation techniques to build customer empathy and identify opportunities to test hypotheses and learn more about our customers' needs. You love sharing what you've learned and are used to communicating in different ways tailored to the audience. And if you have experience working in a digital marketing/media agency environment that would be the cherry on top! We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'. If you're excited about this opportunity, we'd still really like to hear from you. Trade Me is an INZ-accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"leadership\", \"type\": \"soft skill\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"creativity\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "other"},
{"title": "Technical Customer Support Specialist", "location": "None", "company": "Harvey Norman", "type": "None", "duration": "None", "description": "Description Combine your IT expertise and customer service skills in this Technical Customer Support Specialist position in our Pukekohe store, Computers department! This full-time role provides software and hardware support to customers and aims to grow the Tech2Home business. About the Role\nThis role installs software and hardware for customers both in the Techbay and customer homes providing a positive experience for all customers. Training will be provided on our systems and machinery to ensure you are fully supported when you start with us. Some key tasks will include: Troubleshoot, diagnose and provide solutions to customers on desktop, laptops, tablets, smart phones and other computer peripherals. Drive sales of Tech2Home services within the sales team, tech bay and with customers. Process all returns and faulty products correctly and despatch for repair, replacement or credit. Liaise with suppliers and repair agents to ensure that customers get their products repaired or replaced promptly. Undertake cashiering and sales duties as required. About You\nWe are looking for a technical expert who is able to provide great customer service. Some attributes we are looking for include: Technical understanding of computers and computer products. Customer service skills. Current, full NZ Drivers Licence. Retail experience desirable. IT certifications or qualifications desirable. Able to work weekends and public holidays essential. About Us\nHarvey Norman was introduced to New Zealand in 1997, since then we have become a household name, with over 45 stores nationwide plus offsite warehouses, commercial offices and the Auckland Support Office. Our diverse team is made up of over 2000 individuals who each bring a uniquely dynamic expertise to the workforce. Harvey Norman continues to grow throughout New Zealand with new stores opening each year and our team grows with us. We pride ourselves on being a market leader and have a great track record of providing high quality products and outstanding customer service. Here at Harvey Norman we are proud to boast that all our General Managers and retail Store Managers have been promoted from within the business. This is your opportunity to learn from the best and grow to be one of the best! About the benefits\nOur staff make our brand amazing and over the last 25 years have built our business into one of NZ’s leading retailers. Working with us means you get access to some exclusive staff perks, including: Discounted; gym membership, eye care, dental care and banking products. Exclusive staff discounts on our products. Access to Employee Assistant Programme Services (Raise). Long service recognition at each of your 5-year milestones. At Harvey Norman it’s never just a job, it’s a career. If you’re the kind of person who’s dedicated, people-oriented, loves tackling new challenges and has an interest in retail, you’re perfect for us. You’ll be encouraged to show your entrepreneurial side and, if the opportunity arises, explore a role you feel best suits your skill set. Don’t miss this opportunity, APPLY NOW!", "source": "trademe", "skills": "[{\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"customer service\", \"type\": \"soft skill\"}, {\"name\": \"it certifications or qualifications\", \"type\": \"certification\"}]", "salary": 0, "date": "2024-11-18", "category": "service desk"},
{"title": "Senior Reporting Analyst - 12-Month Fixed Term", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description Trade Me, we're about connecting Kiwi to create the life they want. Whether it's the big things like finding a home, a job, a car or growing their business, or the smaller things, like finding that right bedside table or parting ways with some old stuff. At Trade Me our vision is to be the place where Kiwi look first. We are looking for a passionate Senior Insights or Reporting Analyst with commercial acumen who has a keen interest in working with all things data across our Motors team for a 12-month fixed-term role. You'll play an important role in understanding our customers and providing meaningful insights that help us to identify opportunities, test hypotheses and inform our sales, product, and marketing strategies. This role can be based out of Auckland, Wellington or Christchurch. You'll have the best time working at Trade Me, and this is why:\n#Flexibility\nFlexible working is the new normal. We have a guideline for our people to be in the office 60% of the time, with the remaining time being flexible. We support you with a home office setup and a utilities allowance to ensure you can work comfortably.\n#Wellness\nBeing your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way.\n#Leave \nWe support you with leave when you need it, including 5 days of wellness leave each year and 10 days of sick leave from day 1. #Social Nothing beats getting together to have some fun and celebrate our success.  Join us in the office on payday for company paid lunches.  Regular Friday drinks and nibbles, annual Trade Me company awards, celebrations and more.\n#Learning \nWhether it's on the job, formal training, mentoring or something else, you'll grow with us from Day 1. Here's what you can expect from this role: Work with stakeholders and analysts to migrate our reporting suite in PowerBI to using the new Snowflake data source Design, and develop data/dashboard requests for BAU reporting Work with product managers and squad members to ideate and undertake competitor research (if required), thinking of ways to evaluate options and influence the direction of products aligned to the Trade Me Strategic focus areas Go beyond the numbers to identify causes for user behaviour with sight of the potential for commercial value Dig into the data to understand the drivers of our business, causes of the trends and what we can do about it Design, produce and present insights products to stakeholders across the business in a way that allows them to make decisions Lead the use of data to evaluate experimentation such as A/B test design and monitoring Provide mentoring and coaching to other members of the team, helping them to understand different approaches, tools, and insights What you will bring to our team: Approximately 5+ years' experience in commercial data environments BI and/or analytics experience working with large datasets Experience with SQL and any data visualisation tool (e.g. Power BI) is a must Experience in Python or R are desirable Experience with Google data products are desirable (e.g. Google Analytics, Big Query, Google Tag * Manager, Adwords, Google Cloud Services) Experience with AB testing and experimentation would be desirable A proven ability to establish excellent cross-functional working relationships across all people within the company and key customers The ability to convey complex, technical information to non-technical persons Demonstrated ability to deliver projects in a fast-paced, results-oriented environment Good organisation, communication, negotiation, and analytical skills We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'.  If you're excited about this opportunity, we'd still really like to hear from you. Trade Me is an INZ-accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"power bi\", \"type\": \"tool\"}, {\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"r\", \"type\": \"language\"}, {\"name\": \"google analytics\", \"type\": \"tool\"}, {\"name\": \"big query\", \"type\": \"tool\"}, {\"name\": \"google tag manager\", \"type\": \"tool\"}, {\"name\": \"adwords\", \"type\": \"tool\"}, {\"name\": \"google cloud services\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"negotiation\", \"type\": \"soft skill\"}, {\"name\": \"analytical\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "consultant"},
{"title": "Product Manager - Customer Engagement", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description Trade Me is one of New Zealand's most popular websites with over four million members and more than 650,000 Kiwis visiting our site every day. We are seeking a Product Manager to join our Marketplace team. The ideal candidate will be a customer-centric individual with a proven track record in product leadership and commercial acumen. You will have excellent communication and influencing skills, and be able to inspire and lead a cross-functional team to deliver outstanding results. The role of the Product Manager - Customer Engagement is to work with our marketing and product teams to develop and integrate dynamic personalised experiences for our customers to increase audience, engagement and conversion. You'll be comfortable working at pace, and act as a conduit between our customers, consumers and our business to ensure we deliver products and features that create customer and business value. You'll be someone who thrives off working with others to co-create journeys and experiences for our customers that can quickly translate into business benefit. As a passionate leader of your product portfolio, you will help us fulfil our long-term vision to be where Kiwi look first. This is a highly autonomous role with a high impact for our customers and business outcomes. You'll have the best time working at Trade Me, and this is why: #Flexible Flexible working is the new normal. We have a guideline for our people to be in the office 60% of the time, with the remaining time being flexible. We support you with a home office setup and a utilities allowance to ensure you can work comfortably\n#Wellness Being your best self means caring for your physical and mental well-being, we offer lots of resources to help you along the way.\n#Leave We support you with leave when you need it, including 5 days of wellness leave each year and 10 days of sick leave from day 1.\n#Social Nothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company-paid lunches. Regular Friday drinks and nibbles, annual Trade Me company awards, celebrations and more.\n#Learning Whether it's on the job, formal training, mentoring or something else, you'll grow with us from Day 1. In this role you can expect to be: Owning the short and medium-term marketing technology product strategy and vision for how we'll meet user needs Developing a 12-36 month road map with clearly defined use cases and targets aligned to our customer engagement and business goals Building a good understanding of our customer's current and future needs through data, UX and journey planning Strong understanding and connection to your stakeholders goals and objectives across Property, Marketplace, Motors and Jobs Identifying and validating new product opportunities through our existing customer engagement technology, and/or new where applicable Prioritising quarterly focus areas to ensure we deliver business and customer outcomes aligned with our strategy Owning the product outcomes of the squads against your strategy and roadmap User stories: planning, estimating, prioritising, kicking off, and refining the backlog Measurement of product performance against key metrics to drive an outcome-focused approach Product lifecycle management from go-to-market, pricing, end of life Ensuring a shared understanding across all product and engineering functions What you will bring to our team: An experienced product professional (5+ years), having led product strategies that have achieved proven customer and commercial results Experienced at building & creating digital products that New Zealanders love Account experience from a digital marketing/media agency environment would be highly regarded Able to demonstrate experience across all aspects of product management, including prioritisation, measuring impact, competitor analysis, market research, UX testing, product marketing and strategy & roadmap development A good strategist, creative thinker and commercially astute. You'll have a good understanding of what works online, and be able to use sound judgement to assess the value of a diverse range of initiatives Commercially savvy, able to assess performance vs expectations Adept in analytical capabilities, ability to identify patterns and convert to recommendations Empathetic to customer needs and consistently seek opportunities to meet and understand our customers better Experienced in the Agile software development framework An outstanding communicator We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'. If you're excited about this opportunity, we'd still really like to hear from you. Trade Me is an INZ-accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"agile\", \"type\": \"methodology\"}]", "salary": 0, "date": "2024-11-18", "category": "product management"},
{"title": "Intermediate full stack software engineer (SaaS)", "location": "None", "company": "Sunstone Talent", "type": "None", "duration": "None", "description": "Description Love working in React, CSS, HTML, Python & Golang? Developing SaaS products? You'll love front end web development but also like backend challenges Work on building leading edge cloud products that help people :-) An exciting start-up SaaS company is looking for a full stack engineer to join their modern, lean scale-up company Love working in React, CSS, HTML, Python & Golang? What you'll bring: Bachelors degree or similar or not 2 years+ full stack web development experience in React, CSS, HTML with Python and/or Golang You'll love front end web development but be accustomed to working in backend too Work with modern databases MongoDB, PostGreSQL & Redis Experience with Microservices architecture & Agile A good eye for detail and creating functional UIs Work on AWS What you'll get: A lean start-up that is growing & profitable Leading edge Open Source tech stack on the cloud Be part of a talented, supportive, modern dev team Modern hardware ($10k allowance) Job is office based in Christchurch offices with working from home 50/50 you must have right to work in NZ 30 days annual leave Work on building leading edge cloud products that help people - get in touch with Paul :-) Please Click Apply now sending your CV & Cover Letter (If you prefer happy to receive a short video 60-90 secs maximum / MP4 with 1gb or less) or direct to mailto:paul@sunstonetalent.com", "source": "trademe", "skills": "[{\"name\": \"react\", \"type\": \"framework\"}, {\"name\": \"css\", \"type\": \"language\"}, {\"name\": \"html\", \"type\": \"language\"}, {\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"golang\", \"type\": \"language\"}, {\"name\": \"mongodb\", \"type\": \"database\"}, {\"name\": \"postgresql\", \"type\": \"database\"}, {\"name\": \"redis\", \"type\": \"database\"}, {\"name\": \"microservices\", \"type\": \"methodology\"}, {\"name\": \"agile\", \"type\": \"methodology\"}, {\"name\": \"amazon web services\", \"type\": \"platform\"}]", "salary": 0, "date": "2024-11-18", "category": "programming & development"},
{"title": "Data Analyst", "location": "None", "company": "Find IT Auckland", "type": "None", "duration": "None", "description": "Description Use cutting-edge tools like Qlik Sense and MS SQL Work in a flexible, inclusive environment Auckland location Your new company:\nThis is a leading organisation committed to delivering high-quality outcomes. Known for its innovative and compassionate approach, it prioritises data-driven decision-making to enhance client care across diverse communities. Your new role:\nAs a Data Analyst, you will be responsible for providing comprehensive data visualisations, performing in-depth statistical analyses, and creating reports to support key stakeholders. You'll work closely with both internal and external partners to ensure data integrity and offer insights that drive strategic decisions. Responsibilities: Develop and maintain data visualisations using Qlik Sense Conduct data validation and integrity checks across multiple sources Create detailed monthly, quarterly, and ad hoc reports Collaborate with healthcare teams to identify data-related challenges and provide solutions Support the data warehouse maintenance and integration processes Ensure compliance with data quality and governance standards Requirements: Proven experience as a Data Analyst, ideally within a healthcare setting Strong skills in data warehouse integration and advanced SQL queries Proficiency in Azure, Snowflake, and scripting languages like Python Familiarity with data visualisation tools such as Power BI or Qlik Sense Excellent problem-solving skills and attention to detail Perks and benefits: Opportunity to work on impactful projects that improve healthcare outcomes Flexible work hours and options for remote work Supportive team environment and ongoing professional development Competitive salary based on skills and experience If this sounds like you, then HIT APPLY NOW! You must have a valid working visa for NZ.", "source": "trademe", "skills": "[{\"name\": \"qlik sense\", \"type\": \"tool\"}, {\"name\": \"microsoft sql\", \"type\": \"database\"}, {\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"azure\", \"type\": \"platform\"}, {\"name\": \"snowflake\", \"type\": \"platform\"}, {\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "other"},
{"title": "Technology Solutions Systems Engineer", "location": "None", "company": "Te Papa", "type": "None", "duration": "None", "description": "Description Te Papa is looking for a Technical Technology Solutions Systems Engineer to join our truly iconic New Zealand institution. Te Papa's mission is to understand the past, enrich the present, and meet the challenges of the future. Te Papa is more than just the national museum that houses New Zealand's treasures. It is a meeting place, a place for lifelong learning, and a place that inspires a sense of wonder and connection. The Technology Solutions Systems Engineer will be in the Technology team and report to the Manager Creative Technology and Development. This team delivers high quality technology services to support Te Papa's audience facing programs and initiatives. The Technology Solutions Systems Engineer builds, evolves and maintains world leading, cutting edge Audio Visual (AV) technology and experiences. The Technology Solutions Systems Engineer is expected to have experience in providing technical solutions from requirements gathering and design, through to development, deployment, and ongoing support. They should have: 5+ years of experience as a Technology or Audio-Visual Systems Engineer and previous hands-on technical experience in the AV industry An in-depth working knowledge of integrated AV-IT system design, installation and operation Experience in technical installation of integrated AV-IT technology systems Experience in technology system programming Experience in working in a museum or cultural environment. Excellent relationship management and communication skills. Available to be rostered for weekends, early mornings, evening duties and occasional public holidays. The expected commencing salary range for the position is $83,500 to $102,000pa with further room for progression through the band.  Offers will be made within the range to reflect the skills and experience offered by the candidate and those required of the role, and internal relativities with other employees. Applications close on Tuesday 26th November 2024. Applicants will be advised of the status of their application as soon as an outcome is determined. The closing date for applications may therefore be earlier than anticipated. Applicants must have the ability to obtain and maintain the legal right to work in New Zealand. Prior to Te Papa confirming any offer of employment, pre-employment checks will be undertaken including criminal conviction history and reference checking as a minimum.", "source": "trademe", "skills": "[{\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 102000, "date": "2024-11-18", "category": "systems engineers"},
{"title": "Product Manager - Senior", "location": "None", "company": "Trade Me", "type": "None", "duration": "None", "description": "Description Trade Me is one of New Zealand's most popular websites with over four million members and more than 650,000 Kiwis visiting our site every day. We are seeking two highly motivated Senior Product Managers to join our Marketplace and Property B2B teams. The ideal candidates will be customer-centric individuals with a proven track record in product leadership and commercial acumen. They will have excellent communication and influencing skills, and be able to inspire and lead a cross-functional team to deliver outstanding results. Property B2B:  \nThis strategic role will need to help customers advertising property. Working closely together with your engineering, design, sales and marketing teams, you’ll identify opportunities and take solutions to market that align with our company and Property strategy. Marketplace:  \nYour focus will be on leading the product strategy and long term roadmap for our buyer and casual sellers across our Marketplace. This is a highly autonomous role with a high impact for our customers and business outcomes. Please let us know in your cover letter or CV if you have a preference for either Property or Marketplace or both. You'll have the best time working at Trade Me, and this is why: \n#Flexible \nFlexible working is the new normal. We have a guideline for our people to be in the office 60% of the time, with the remaining time being flexible. We support you with a home office setup and a utilities allowance to ensure you can work comfortably\n#Wellness \nBeing your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way.\n#Leave \nWe support you with leave when you need it, including 5 days of wellness leave each year and 10 days of sick leave from day 1.\n#Social \nNothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company paid lunches. Regular Friday drinks and nibbles, annual Trade Me company awards, celebrations and more.\n#Learning \nWhether it's on the job, formal training, mentoring or something else, you'll grow with us from Day 1. Here's what you can expect from this role: We're making meaningful headway into solving our customers' problems through improvements and innovations to our product offering, and we're achieving our desired customer and commercial outcomes. We have a 1 -3 year view of the problems we’re aiming to tackle and an outcome based roadmap to support it that our teams buy into. Strong discovery practices help us deeply understand the customer challenges we seek to solve. Problems are validated before we start building. Our teams are highly engaged with the ongoing customer and business value we're looking to deliver, and we're great at experimenting to quickly learn how to deliver the most value. We have transparent measurements of success that focus our efforts on outcomes over outputs, and help align our execution efforts with our long term strategic goals. Your stakeholders are involved and well informed with the problem you are trying to solve. We ruthlessly prioritise. We only work on things that provide value, we know when to stop iterating on an idea. You're creating and fostering a diverse and inclusive environment. What you will bring to our team: An experienced product professional (5+ years), having led product strategies that have achieved proven customer and commercial results. Experienced at building & creating digital products that New Zealanders love. Able to demonstrate experience across all aspects of product management, including prioritisation, measuring impact, competitor analysis, market research, UX testing, product marketing and strategy & roadmap development. A good strategist, creative thinker and commercially astute. You'll have a good understanding of what works online, and be able to use sound judgement to assess the value of a diverse range of initiatives. Commercially savvy, able to assess performance vs expectations. Adept in analytical capabilities, ability to identify patterns and convert to recommendations. Empathetic to customer needs and consistently seek opportunities to meet and understand our customers better Experienced in the Agile software development framework. Energetic, driven and enthusiastic for excellent results and have a genuine desire to help engage and motivate other cross-functional teams. An outstanding communicator - able to explain ideas simply & clearly, listen carefully to others, and proactively improve team communication. Confident in communicating to stakeholders and consumers. We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'. If you're excited about this opportunity, we'd still really like to hear from you. Trade Me is an INZ accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "source": "trademe", "skills": "[{\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"leadership\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"creativity\", \"type\": \"soft skill\"}, {\"name\": \"agile\", \"type\": \"methodology\"}]", "salary": 0, "date": "2024-11-18", "category": "other"},
{"title": "Senior Project Manager", "location": "None", "company": "Find IT", "type": "None", "duration": "None", "description": "Description 12-month hourly rate contract + Welllington based Proven experience with implementation of complex cloud-based solutions Data Centre Integration + Build + Networking Integration Are you an experienced ICT Project Manager with a proven track record in delivering complex, high-impact projects? Are you skilled in leading cross-functional teams and managing intricate stakeholder environments? If so, we are looking for you to join our team as a Senior ICT Project Manager. About the Role\nThis position requires a seasoned professional with expertise in large-scale ICT projects, particularly with cloud-based solutions, data centre integration, and networking. Given the critical timing and complexity of the project, we're seeking someone with the following key skills and experience: Essential Skills and Experience Complex Cloud Solution Implementation: Proven experience with the implementation of cloud-based solutions, data centre integration, and networking—this is a primary requirement. Systems and Services Integration: Extensive experience integrating complex systems and services. Vendor and Stakeholder Management: Demonstrated ability to manage multiple vendors and complex stakeholder relationships. Commercial Acumen: Skilled in negotiating commercial outcomes that align vendor performance with business objectives and Service Level Agreements (SLAs). Security and Compliance: Knowledge of compliance standards, particularly around security and New Zealand Information Security Manual (NZISM) standards. Change Management: Experienced in handling complex change within a dynamic, high-change environment. People-Focused Leadership: Proven track record in effectively managing and engaging multiple stakeholders at all levels within the organisation. If you are a highly motivated, results-driven project manager with the technical knowledge and interpersonal skills to excel in this role, we encourage you to apply. This is a unique opportunity to work on a challenging and rewarding project that makes a real difference. Apply today and join our client's mission to drive successful outcomes in the ICT space! For more information, contact Kylie Brocket via email mailto:kylie.brocket@findrecruitment.co.nz or txt me on 021 344 171", "source": "trademe", "skills": "[{\"name\": \"cloud-based solutions\", \"type\": \"platform\"}, {\"name\": \"data centre integration\", \"type\": \"tool\"}, {\"name\": \"networking\", \"type\": \"tool\"}, {\"name\": \"vendor management\", \"type\": \"soft skill\"}, {\"name\": \"stakeholder management\", \"type\": \"soft skill\"}, {\"name\": \"commercial acumen\", \"type\": \"soft skill\"}, {\"name\": \"security\", \"type\": \"protocol\"}, {\"name\": \"compliance standards\", \"type\": \"methodology\"}, {\"name\": \"change management\", \"type\": \"methodology\"}, {\"name\": \"leadership\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "project management"},
{"title": "Senior Software/Data Engineer", "location": "None", "company": "Find IT Auckland", "type": "None", "duration": "None", "description": "Description AI Cutting edge technologies Python About Us: Our client is shaking up the consulting and private equity landscape with a groundbreaking SaaS platform that brings new power and precision to market surveys. This innovative company combines cutting-edge AI with an intuitive, end-to-end survey solution that simplifies every step of the process—from creation to analysis. As they prepare for the public debut of their MVP, our client is on the hunt for talented tech professionals to join their dynamic, close-knit team and help bring smarter, faster decision-making to the forefront. The Role: Step into a pivotal role as a Senior Software/Data Engineer, where you'll take the reins in designing and developing core components of our client's revolutionary platform. This is your chance to own and innovate back-end modules, architect resilient, high-performing infrastructure, and build data systems that deliver real-time insights. In this high-impact role, you'll have significant autonomy and the unique opportunity to influence foundational architecture. Here, your work will shape a product that's set to become a game-changer in the market research field. What You'll Bring: Technical Mastery: Skilled in Python, PostgreSQL, and API development, with hands-on expertise in FastAPI for microservices that scale with ease. System Design & Architecture: Proven experience in architecting scalable, maintainable systems built for high-availability in cloud environments. Data Precision: Robust experience with database management, schema design, and strategies that prioritize data integrity. Full-Stack Flexibility: Comfort with JavaScript and Node.js to jump into front-end contributions when needed. Security Savvy: Knowledge of secure network architectures, IAM, and cloud security to safeguard data and meet compliance standards. Nice-to-Have: Familiarity with SQLAlchemy, event-driven tech like Apache Kafka, Google Cloud Platform, and an understanding of machine learning workflows. If you're ready to join a company that values innovation, ownership, and bold ideas, our client wants to hear from you! Be part of a mission to reshape the market research industry and make your mark in a high-growth, high-impact environment. Apply now to dive into a role where your expertise will propel real change.", "source": "trademe", "skills": "[{\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"postgresql\", \"type\": \"database\"}, {\"name\": \"api\", \"type\": \"protocol\"}, {\"name\": \"fastapi\", \"type\": \"framework\"}, {\"name\": \"javascript\", \"type\": \"language\"}, {\"name\": \"node.js\", \"type\": \"framework\"}, {\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"apache kafka\", \"type\": \"tool\"}, {\"name\": \"google cloud platform\", \"type\": \"platform\"}]", "salary": 0, "date": "2024-11-18", "category": "programming & development"},
{"title": "PL/SQL Developer", "location": "None", "company": "Platinum Recruitment", "type": "None", "duration": "None", "description": "Description Great team within a well known company Key role to the success of the department December or January start-date! We have an initial 3-month contract opportunity available for a Senior PL/SQL Developer to join our Christchurch based clients. The successful candidate will play a critical role in the continued growth of their PL/SQL capability and long-term development strategy. This is a Christchurch based role, we will not be considering remote or FIFO candidates for this position. ABOUT YOU: You will be a creative and motivated Developer who excels working individually and in a team environment. You'll have a problem-solving mindset and be able to contribute, innovate and deliver industry-leading solutions. You will bring excellent and concise written & oral communication skills whilst being able to adapt to your audience. RESPONSIBILITIES: Develop, execute, and manage Oracle PL/SQL as well as T-SQL stored program units such as procedures, functions, packages and database triggers. Participate in various project and new initiative as a technical resource as well as performing duties as documenting requirements, mapping and program logic, designing solutions, testing and implementation. Develop and maintain system documentation, including technical specifications, data mapping, program logic and flowcharts Design and development of software using primarily PL/SQL batch processing Learn and master database schema of complex third-party enterprise applications REQUIRED SKILL SET: Expert knowledge of SQL, PL/SQL and proficient at algorithm design. In-depth understanding of Oracle and/or SQL database administration tasks and can support database maintenance and tuning. Follows software development best practices for code control & environment migrations Understands data warehousing & ETL concepts READY TO APPLY? If you know this role matches your skillset and you are looking for a change hit APPLY NOW! To find out more or have a confidential chat you can contact Alicia via her details: Alicia - 027 752 8466 / mailto:alicia@platinumrecruitment.co.nz Applicants must have a valid work visa, permanent residency or NZ citizenship to be considered. Platinum Recruitment are proud to be a member of Diversity Works New Zealand and believe in equal opportunities for all and we actively promote diversity and inclusion in all our recruitment processes \"Do workplace inclusion well and do well because of it\".", "source": "trademe", "skills": "[{\"name\": \"pl/sql\", \"type\": \"language\"}, {\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"oracle\", \"type\": \"database\"}]", "salary": 0, "date": "2024-11-18", "category": "programming & development"},
{"title": "Developer Programmer", "location": "None", "company": "SharpMind Games Ltd", "type": "None", "duration": "None", "description": "Description We're a boutique game dev company looking for an enthusiastic web developer to join us in creating new online entertainment products (as well as perfecting existing ones), targeting our vast and diverse audience. If you consider game development a fun thing to spend your time on, and an ultimate challenge of tinkering with every little aspect in order to achieve a market-best result, then you must be the one we are looking for. Duties and Responsibilities Developing online versions of classic puzzle/logic games (such as Mahjong, Solitaire, etc.) from scratch,\nWriting well-tested and well-documented JavaScript, HTML, CSS,\nFocusing on every aspect of runtime performance, load optimization and accessibility\nRequirements and Qualifications 1+ years of web development experience,\nSolid background with HTML, CSS, cross-platform and cross-browser compatibility,\nVanilla JS, Vue or React, TypeScript,\nWebpack, git,\nCritical thinking and problem-solving skills\nTeam player\nGood time-management skills\nGreat interpersonal and communication skills As a Developer Programmer, you have to be able to Interpret specifications, technical designs and flow charts, builds, maintain and modify the code for software applications; construct technical specifications, including cyber security, from a functional business model; and test and write technical documentation.\nWe require a person with at least one year plus work experience and the ability to pass our tests.\nThe minimum pay for this position is 70K per annum and the maximum pay is 80K per annum.", "source": "trademe", "skills": "[{\"name\": \"javascript\", \"type\": \"language\"}, {\"name\": \"html\", \"type\": \"language\"}, {\"name\": \"css\", \"type\": \"language\"}, {\"name\": \"vue\", \"type\": \"framework\"}, {\"name\": \"react\", \"type\": \"framework\"}, {\"name\": \"typescript\", \"type\": \"language\"}, {\"name\": \"webpack\", \"type\": \"tool\"}, {\"name\": \"git\", \"type\": \"tool\"}, {\"name\": \"critical thinking\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"time management\", \"type\": \"soft skill\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 80000, "date": "2024-11-18", "category": "programming & development"},
{"title": "Network Operations Manager", "location": "None", "company": "Comspek International", "type": "None", "duration": "None", "description": "Description Our client is seeking a Network Operations Manager to lead a managed service customer contract. The ideal candidate will have experience running a network operations team and possess strong expertise in network infrastructure, particularly with routers, switches, and WiFi networks, specifically #CISCO. A key focus of the role is customer management, requiring excellent communication skills and a proactive, driven approach to ensure tasks are completed efficiently and effectively. As the Network Operations Manager, you will collaborate closely with the Technical and Service Delivery Manager and will also be hands-on with various network elements. As the Network Operations Manager, your key responsibilities will include: Overseeing the operations for connections to data centers, as well as national and global office networks Managing operations in alignment with agreed SLA's Demonstrating strong stakeholder engagement skills, with a high level of emotional intelligence for managing client relationships Ensuring service level management and compliance Delivering regular SLA reporting Driving initiatives for continuous service improvement Leading the team to achieve your service delivery goals If this sounds like the role for you, Apply Now! Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "source": "trademe", "skills": "[{\"name\": \"cisco\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "networking & storage"},
{"title": "Senior Cloud Infrastructure Engineer (Azure)", "location": "None", "company": "Find IT Auckland", "type": "None", "duration": "None", "description": "Description Lead cutting-edge IT projects & solve complex tech issues. Enhance systems with your Azure cloud expertise. Drive tech innovation in a top, specialised,  Auckland IT firm. Senior Cloud Infrastructure Engineer (Azure) - Leading IT Solutions Provider Our client, a leading IT solutions provider, is seeking a Senior Cloud Infrastructure Engineer with extensive Azure deployment/migration/management experience to join their visionary team. This role is based in their centrally located Auckland office, offering an opportunity to work in an innovative environment where technology enhances business success while minimizing risks associated with Cyber Security and data privacy. Role Overview: Senior Cloud Infrastructure Support Engineer, you will: Provide high-level support and lead complex IT projects from inception to completion. Diagnose and resolve technical issues across hardware, software, network configurations, and cloud services, with a special focus on Azure. Develop and maintain detailed system documentation to ensure optimal performance, security, and reliability. Role Requirements: The ideal candidate will have: A minimum of 5 years of experience as Systems engineer preferably within a managed service provider environment. Extensive knowledge of configuring and maintaining systems including Microsoft 365, Windows, MacOS, servers, and Azure cloud services including Networking, Firewalls and EndPoint Protection. Demonstrated capability in managing IT projects involving system upgrades and cloud migrations. Proficient with MS Azure and a passion for new tech. Additional responsibilities: Deliver remote support, with a focus on cloud-based solutions. Drive continuous improvements in IT systems and processes. Mentor junior engineers and provide training on the effective use of cloud technologies. Candidate Qualifications: We are looking for applicants who possess: Strong problem-solving skills and a thorough understanding of cyber security and business continuity planning. Experience with SQL and automation tools such as PowerShell and Microsoft Power Automate. A bachelor's degree in Computer Science, IT, or a related field, and relevant certifications like Microsoft Certified Professional or CompTIA, are preferred. Excellent self-management skills and a full NZ driver's license. Important Note: This position requires candidates who currently hold the legal right to work in New Zealand.\nThis is an excellent opportunity for a seasoned IT professional with a strong background in cloud technologies, particularly Azure, to advance their career within a supportive and dynamic company. If you are driven by innovative technology solutions and proactive work, please consider applying on behalf of our client. Joining our client's team offers not just a career advancement opportunity but also a chance to be part of a company that values visionary thinking and proactive improvements in the rapidly evolving IT landscape.", "source": "trademe", "skills": "[{\"name\": \"azure\", \"type\": \"platform\"}, {\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"powershell\", \"type\": \"tool\"}, {\"name\": \"microsoft power automate\", \"type\": \"tool\"}, {\"name\": \"microsoft certified professional\", \"type\": \"certification\"}, {\"name\": \"compTIA\", \"type\": \"certification\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "other"},
{"title": "IT and Project Administrator", "location": "None", "company": "UCOL", "type": "None", "duration": "None", "description": "Description In this role, you will provide coordination and administrative support to our Digital Services team.  You will work collaboratively with the team and with other departments across the organisation, providing coordinated support in procurement, software licensing, maintaining and renewing of IT contracts and subscriptions. There will be opportunities to contribute to the operations of the team, helping develop processes and documentation. You will bring to the role relevant experience in an IT administrative role, financial transaction processing, contract and license agreements, along with experience working with Microsoft services. At UCOL we embrace diversity, talent, and performance, and provide our staff with an extensive range of opportunities to develop intellectually, professionally, and personally.   We are passionate about the power of education to positively change the lives of our ākonga, their whānau, and the wider community. We want your energy, creativity, passion, and intelligence. Join the UCOL whanau and, together, let's deliver a bigger, brighter and better future. Apply now and make a meaningful impact - submit your cover letter and CV outlining your matched experience and skills. Please note - we do not always work to fixed closing dates and we will start considering applications as they are received, so we encourage you to apply early.", "source": "trademe", "skills": "[{\"name\": \"microsoft services\", \"type\": \"platform\"}]", "salary": 0, "date": "2024-11-18", "category": "other"},
{"title": "Business Analyst", "location": "None", "company": "Electrix", "type": "None", "duration": "None", "description": "Description Who are we? Omexom is part of a global family of energy infrastructure services providers operating under the VINCI group which is a world leader in concessions, energy, and construction, operating in more than 120 countries worldwide. The brand network is a multi-disciplinary network, able to offer customized multi-technical, multi-site, or multi-country services. With our 1,000+ employees in 29 locations nationwide and $340M in revenue, Omexom has long-standing partnerships with Vector, Transpower, Auckland Transport, and Firstgas, while servicing our newer clients Watercare, Auckland District Health Board, Powerco, and City Rail Link Limited. In Aotearoa, Omexom is well positioned through this international network with shared values and vast resources, and a continued commitment to safety, excellence, and sustainable solutions. At Omexom, we are committed to creating a safe and inclusive environment that values and respects diverse styles, backgrounds, experiences, and perspectives. We welcome and encourage women, and people from diverse backgrounds to apply. Based in Mt. Wellington Attractive Staff Benefits Great Earning Potential Be a part of a Great Team Full-time, Permanent contract Monday – Friday About the Role Come join our amazing Infrastructure Support team and drive improvement and efficiency within the Business Unit by analysing practices, identifying opportunities for optimisation, and recommending process and system integration solutions. Collaborate with stakeholders to gather and prioritise business requirements, ensuring alignment with business goals.\nAnalyse current processes and workflows, identify inefficiencies, and propose improvements for productivity and performance.\nUse data analytics to provide insights and create reports for decision-making and strategic planning.\nSupport managers to ensure business requirements are met, and projects are delivered on time and within scope.\nAct as a liaison between business users and IT, translating needs into technical requirements and ensuring alignment.\nDocument business processes, use cases, and specifications to support development and implementation.\nDevelop test plans and conduct testing to ensure solutions meet business needs and quality standards.\nPartner with developers to design and implement business solutions that meet objectives.\nCoordinate efforts between technical teams and business units for system development and keep stakeholders informed during implementation.\nLead end-user training on new systems and ensure a smooth transition, supporting users throughout.\nAssist in change management, including communication and training for new processes or systems.\nContinuously identify improvement opportunities and recommend solutions based on industry trends and best practices.\nImplement company health and safety policies, ensuring decisions reflect care, diligence, and skill. Technical Knowledge & Skills Relevant commercial or business tertiary qualification or equivalent experience.\n3+ years of experience as a Business Analyst with a successful project delivery track record.\nProficiency in business process modelling and workflow tools (e.g., Visio, Lucidchart).\nExperience with data analysis and reporting tools (e.g., SQL, Excel, Power BI, SAP).\nFamiliarity with project management methodologies (e.g., Agile, Scrum).\nHands-on experience with enterprise software (e.g., SAP, Sharepoint, Power Apps).\nRelevant project management and change leadership experience.\nExcellent written and verbal communication skills, with the ability to present complex information clearly to non-technical stakeholders.\nStrong analytical and problem-solving skills, with the ability to think critically and provide innovative solutions. Perks and Benefits Company provided health insurance for employees and dependents Access to VINCI Shares 6% Kiwisaver employer contribution and 9% after 10 years of service Career Advancement Opportunities How to apply If you like the sound of what we’re offering and think you are the right person for the job, we’d love to hear from you.  Hit the 'apply' button below.  Applications close on Friday 1st November 2024. Please note, that only candidates with the right to live and work in New Zealand will be considered for this role. According to the Harvard Business Review, men typically apply for jobs when they meet only 60% of the qualifications, whereas women and individuals from underrepresented groups usually apply only if they meet all the criteria. We're not just about checking boxes, so if you believe you have the skills but don't meet every requirement listed, please reach out if you would like to find out more, we'd love to talk with you.", "source": "trademe", "skills": "[{\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"excel\", \"type\": \"tool\"}, {\"name\": \"power bi\", \"type\": \"tool\"}, {\"name\": \"sap\", \"type\": \"tool\"}, {\"name\": \"project management\", \"type\": \"methodology\"}, {\"name\": \"agile\", \"type\": \"methodology\"}, {\"name\": \"scrum\", \"type\": \"methodology\"}, {\"name\": \"visio\", \"type\": \"tool\"}, {\"name\": \"lucidchart\", \"type\": \"tool\"}, {\"name\": \"sharepoint\", \"type\": \"tool\"}, {\"name\": \"power apps\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"critical thinking\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "business & systems analysts"},
{"title": "Software Engineer", "location": "None", "company": "None", "type": "None", "duration": "None", "description": "Description Our company is a small business offering tech products and exceptional customer services since 2021. With the growth of the company, we are looking for a full-time staff to handle our IT and finance systems as well as providing support for sales. You will be part of a growing team in an informal, friendly environment. We value ideas and creativity and here you can see your ideas taking a real shape. Your responsibilities will mainly include: Sales, Invoicing, billing and inventory management. Maintain company website and online store Digital Marketing and SEOs Optimisation Management of physical inventory Manage company social media accounts Management support and potential to get key position at the company About You Tertiary education in Engineering or Computer Sciences Tech savvy, knowledge of latest tech products Working understanding of IT/ERP systems. Experience working with MYOB Experience working with Opencart Excellent time management skills Strong and effective verbal and written communication skills Ecommerce and online sales & marketing experience", "source": "trademe", "skills": "[{\"name\": \"myob\", \"type\": \"tool\"}, {\"name\": \"opencart\", \"type\": \"tool\"}, {\"name\": \"creativity\", \"type\": \"soft skill\"}, {\"name\": \"time management\", \"type\": \"soft skill\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "other"},
{"title": "Project Team Lead", "location": "None", "company": "Find IT Auckland", "type": "None", "duration": "None", "description": "Description Full time, permanent role based in Auckland Car and fuel card provided Your new company Join a well-established security solutions provider known for its top-tier services across the Auckland region. The company prides itself on delivering high-quality security systems to both residential and commercial clients, ensuring peace of mind and safety for all. Your new role The Project Team Lead manages the installation and quality control of structured cabling and low voltage systems, ensuring project success through leadership and expertise. Responsibilities Oversee the installation, maintenance, and quality control of structured cabling and low voltage system Lead and manage a team of Site Foremen and technicians, ensuring projects are completed on time, within budget, and to quality standards Maintain project documentation and reports, ensuring accuracy throughout the project lifecycle Requirements Strong leadership and team management abilities Strong technical knowledge of general cable systems and electronic security systems Effective communication and interpersonal skills Proficiency in reading and interpreting technical drawings and specifications Clean NZ drivers license If this sounds like you then hit APPLY NOW!", "source": "trademe", "skills": "[{\"name\": \"leadership\", \"type\": \"soft skill\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "project management"},
{"title": "Project Team Lead", "location": "None", "company": "Find IT Auckland", "type": "None", "duration": "None", "description": "Description Full time, permanent role based in Auckland Car and fuel card provided Career Progression Your new company Join a well-established security solutions provider known for its top-tier services across the Auckland region. The company prides itself on delivering high-quality security systems to both residential and commercial clients, ensuring peace of mind and safety for all. Your new role The Project Team Lead manages the installation and quality control of structured cabling and low voltage systems, ensuring project success through leadership and expertise. Responsibilities Oversee the installation, maintenance, and quality control of structured cabling and low voltage system Lead and manage a team of Site Foremen and technicians, ensuring projects are completed on time, within budget, and to quality standards Maintain project documentation and reports, ensuring accuracy throughout the project lifecycle Requirements Strong leadership and team management abilities Strong technical knowledge of general cable systems and electronic security systems Effective communication and interpersonal skills Proficiency in reading and interpreting technical drawings and specifications Clean NZ drivers license If this sounds like you then hit APPLY NOW!", "source": "trademe", "skills": "[{\"name\": \"leadership\", \"type\": \"soft skill\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "project management"},
{"title": "Service Desk Lead", "location": "None", "company": "Find IT", "type": "None", "duration": "None", "description": "Description 12-month fixed-term contract $ - market rate Highly flexible working environment - three days in the office, two at home Company and role: \nMy client, a commercial organisation based in the Wellington region, is seeking a Service Desk Lead to join their team on a 12-month fixed-term contract. This is a critical, highly varied role with an organisation that is growing rapidly! Duties include the following: Management of vendors, both domestically and internationally - regular in-person/virtual meetings with vendors. No management of a team required. Hands-on 'break/fix' level 1 and 2 support at times. Triage of tickets of varying complexity. Assigning tickets to vendors. Conducting training of company employees and with vendor partners. Creating documentation for company employees and vendor partners. Ad-hoc duties. The ideal candidate will have a background in the following: Proven track record managing vendor partners required. The candidate will need to have had an aspect of hands-on support in recent role/s. Ability to work with urgency in a fast-paced environment required. Strong private sector experience required. Experience working in a broad role with a small team preferred, but not essential. This person will need to be able to show initiative and do what is required! Experience working in an international business preferred, but not essential. A few other points of note: There will be a small amount of work required outside of regular office hours. This is a highly flexible environment, and you will be able to start early/finish late at another time. The candidate is expected to be in the office for three days, with two days at home. The candidate must be currently based in the Wellington region, and must have the legal right to work in New Zealand. Apply now!\nThis is a dynamic business and a great learning environment. Please apply below, or email mailto:adam.poulopoulos@findrecruitment.co.nz with any questions, and a copy of your latest CV.", "source": "trademe", "skills": "[{\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"leadership\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "service desk"},
{"title": "Computer Engineer | Mobile Technician | ICT Tech", "location": "None", "company": "3CNZ Tech", "type": "None", "duration": "None", "description": "Description We 3CNZ Tech, NZ Accredited Employer and Trusted supplier and service provider to Schools, Governments, Small business, Major insurance companies and Corporates. Born and head quartered in Timaru, we have service and distribution branches in Oamaru, Ashburton and in Auckland and have foresight of more stores in NZ to support our schools' clients. We are regular supplier of IT Products to over 100+ Schools of New Zealand supplying Chromebooks, iPads, MacBook’s, Laptops, Desktops, Gaming Machines. We also repair over 100+ devices/each month of 70+ Schools and 20+ Government organization and 30+ companies of Major brands- fixing their iPhones, Samsung, Chromebooks, iPads, MacBook’s and Laptops. We also supply major IT equipment’s to Pacific Island nations such as Fiji, Samoa etc. Location: Timaru Offered Payrate:\nPayrate: $25/hr-$30/hr plus commission.\nWeekly hours: 32-45 hours per week.\nStrictly Weekend l required and travel within NZ required. Parking Provided Job Duties: You will be working in a retail store and on site working on Phones, iPads, MacBook’s ,Computers and Computer networks and IT peripherals devices. We are looking for experienced and someone who worked in similar previous role, taking responsibility of the job solely.\nIn this role you will be responsible to: Maintain and installation of new equipment such as Phones, Pads, MacBook’s PC's, laptops, printers, and modems.\nDetermining software and hardware requirements to provide solutions to problems\nProvide Telephonic and remote support for new and existing customers.\nEnsuring efficient use of applications and equipment acting in the best interests of the client.\nImplementing computer networks solutions\nProvide technical support and onsite trouble shooting strategies for both servers and work stations.\nAssimilate new hardware and software in the work place and onsite.\nPerform routine inspection, testing, and repair of smart phones screens -iPhone, Samsung screens and other mobile devices. The successful applicant will have: 'Must have at least 2 years relevant experience OR a relevant Level 5 or higher tertiary qualification’. \nProven experience and knowledge in repairing and maintaining of all audio-visual equipment\nHaving high skills in repairing iPhones, Samsung phones, iPads , Macbook and Laptops.\nStrong knowledge of the ICT industry, including the latest software and hardware developments\nStrong technical ability to provide L2 support\nProven ability to work well in a team and to train junior team members\nStrong verbal and written skills, and an excellent attention to detail\nGood at identifying problems and troubleshooting hardware issues.\nAble to work independently and compatibility to work on weekends.\nAvailable for Immediate start. Applicants for this position should have NZ residency or a valid NZ work visa. Visa support can be given to right candidate.", "source": "trademe", "skills": "[{\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"time management\", \"type\": \"soft skill\"}, {\"name\": \"computers\", \"type\": \"tool\"}, {\"name\": \"mobile devices\", \"type\": \"tool\"}, {\"name\": \"ict industry\", \"type\": \"platform\"}, {\"name\": \"technical support\", \"type\": \"methodology\"}]", "salary": 62400, "date": "2024-11-18", "category": "service desk"},
{"title": "Building Automation Technician", "location": "None", "company": "Twizel Electrical Ltd", "type": "None", "duration": "None", "description": "Description Our business is growing and we are expanding our services in the building\nautomation space. We are looking for someone with experience in building\nautomation and services, who can scope out projects with our clients, and then\nprovide full end-to-end services.\nThe role is full-time (minimum 30 hours per week, although the average is 35 hours per\nweek), and for the right candidates, remuneration will be between $30 to $35.00 per\nhour with scope to grow in the role and financial rewards.\nOur company is based in Twizel, Canterbury and some travel to client's sites will be\nrequired as part of the position. Key Duties Need to have experience in engineering and more specifically building\nautomation systems. Experience with Tridium Automation Services or similar systems. Experience with Modbus and BACnet systems. Ability to train other staff on these systems and units in the field, including\nonsite installations and updates. Some project management or administration experience is useful. Key Requirements At least three years of engineering or building automation experience\nrequired. Technical certificate or trade-related qualification is desirable, but not required if\nthe candidate has suitable experience. Ability to secure necessary registrations as a technician if required. Willing to upskill registration and undertake further electrical works training. Team player, willing to share their knowledge and experience. Application\nPlease apply using the TradeMe platform or contact Riaan van der Westhuizen from\nTwisel electrical directly.", "source": "trademe", "skills": "[{\"name\": \"tridium automation services\", \"type\": \"tool\"}, {\"name\": \"modbus\", \"type\": \"protocol\"}, {\"name\": \"bacnet\", \"type\": \"protocol\"}, {\"name\": \"project management\", \"type\": \"methodology\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}]", "salary": 72800, "date": "2024-11-18", "category": "other"},
{"title": "Systems Engineer", "location": "None", "company": "Platinum Recruitment", "type": "None", "duration": "None", "description": "Description Opportunity to drive business improvements by working with the latest technology Personal development and training regularly as part of their T&D strategy Attractive remuneration package and company benefits on offer Due to continued growth, our partners are seeking a skilled Systems Engineer to ensure the stable operation of their network and systems infrastructure while contributing to key project delivery. You will be a self-motivated systems engineer focused on delivering excellent management of Linux and Mac environments. You'll also work closely with vendors to maintain stability and high-level service delivery. What's on offer for you: Ongoing personal development and training as part of a comprehensive T&D strategy. A crucial role as the Subject Matter Expert for systems infrastructure. Opportunity to drive business improvements using the latest technology. Attractive remuneration package and company benefits. Requirements: Proven experience with Linux, Mac, or other operating systems. Strong knowledge of cybersecurity practices, including threat detection, vulnerability management, and system hardening. Experience providing 2nd and 3rd-level technical support for LAN, WAN, wireless services, enterprise and workstation operating systems, and core business solutions. Experience with Python scripting for automation and system management tasks. Familiarity with virtualisation platforms: VMware and Proxmox Excellent stakeholder and vendor relationship management skills. If you're looking for an exciting opportunity to be part of a growing team, apply now!\nTo have a confidential chat you can contact Nicholas 027 752 8468 / mailto:Nicholas@platinumrecruitment.co.nz", "source": "trademe", "skills": "[{\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"vmware\", \"type\": \"platform\"}, {\"name\": \"proxmox\", \"type\": \"platform\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "systems engineers"},
{"title": "Databricks Solution Architect", "location": "None", "company": "Find IT", "type": "None", "duration": "None", "description": "Description Permanent role Wellington-based position Salary negotiable Company and role: \nMy client, a private-sector organisation based in the Wellington region, is seeking a solution architect with strong Databricks architecture knowledge and experience to join their team on a permanent basis. Duties for the role include, but are not limited to: End-to-end design and implementation of Databricks solutions. Collaboration with cross-functional teams and stakeholders at various levels. Internal contribution to knowledge around Databricks and the latest data technologies. Project scoping and some project resource management needed. Ad-hoc duties The candidate will ideally have a background in the following: Demonstrable solution architecture experience with Databricks required. Ideally, you'd be able to show this in more than one organisation, but this is not a requirement. Excellent communicator, with the ability to engage technical and non-technical stakeholders high up in the organisation, and present technical solutions articulately. Strong problem solving skills, and the ability to think outside the square. Private sector experience preferred, but not essential. The candidate must be willing to work in a hybrid working environment, with more time in the office than at home. NB: The candidate must already be based in New Zealand, and if based outside the Wellington region. be willing to relocate. \nNB: The candidate must have the legal right to work in New Zealand. Apply now!\nPlease apply below, or email mailto:adam.poulopoulos@findrecruitment.co.nz with any questions, and a copy of your latest CV.", "source": "trademe", "skills": "[{\"name\": \"databricks\", \"type\": \"platform\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "architects"},
{"title": "IT Sales, Admin, Service & Support", "location": "None", "company": "Tech4You", "type": "None", "duration": "None", "description": "Description Tech4You is looking for a full-time permanent Sales, Admin, Warehouse, Onsite Service & Support person to join our team of professional people at our Auckland and Hamilton Samsung Authorised Service Centres. If you love working with people and providing great service and want to work in a vibrant, innovative, and rewarding environment then this is the role for you! The hours of work will include weekdays and weekends. We will give you: A competitive remuneration package with a generous commission structure On-going training with new technology A great platform from which to progress and grow your career in sales, admin, service & support As part of the in-store sales, admin, warehouse, and onsite service/support team: You will be assisting our customers with a wide range of Mobile and Laptop products and services from the latest mobile phones, laptops, and accessories to data products You will be working at our stores in Auckland & Hamilton You will be tailoring IT solutions to our customer's needs You will be assisting in customer order processing pickup & packaging You will be processing incoming purchase orders You will be setting up and troubleshooting tech devices Ideally, you will have: A minimum of one year’s IT sales/service/support experience or similar Exceptional customer service skills Confidence in approaching customers to sell and recommend products Ability to relate with people at all levels Good Knowledge of Mobile Phones and Laptops The ability to pick up new mobile and laptop technology Current NZ driving license Don't miss out on this great opportunity. Applicants for this position should have NZ citizenship/residency or a valid NZ work permit.", "source": "trademe", "skills": "[{\"name\": \"customer service\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "sales & pre-sales"},
{"title": "Systems Engineer", "location": "None", "company": "Seeka", "type": "None", "duration": "None", "description": "Description Focused on orchard-to-market excellence, Seeka is an integrated horticultural and produce company that grows, processes, distributes and markets high quality produce to world markets. At Seeka we are nothing without the talents of our people. Authentic, skilled, curious and earning respect through our actions. Our inspirational people are passionate, ambitious and demonstrate a passion for excellence and self-leadership. We are seeking a talented IS Systems Engineer to join our hard-working Informations System's team. This position is primarily based at Head Office, end user facing role providing on-site helpdesk support to users and departments across all Seeka sites as well as to the Infrastrucuture engineers. The role provides second level support and assists other members of the Ops Team to ensure remote sites are fully operational. You will be working with end users to ensure their problems are solved, and they are trained in all Seeka systems. The role is also responsible for the management and delivery of device deployment and system upgrades so attention to detail is a key skill. The successful applicant will have: 5 years+ experience in a similar role with specific experience in configuration and maintenance of Intune, Autopilot & SCCM. Experience installing and maintaining IT systems in a corporate environment Experience in Miradore & SOTI would be advantageous Full New Zealanders Driver's License required Excellent desktop and laptop deployment & Support experience Experience in Server and SAN technologies Our ideal person is a team player with strong verbal and interpersonal skills who can think on their feet. They will have the ability to be creative, innovative and show initiative. This person will be well organised, analytical, self-motivated, meets deadlines and works well under pressure. Benefits of joing us at Seeka(We like to look after our staff): Life, Medical and Trauma Insurances for full time employees We have a gym at our Head Office that is free to all employees You get full training to ensure your success in the role We have a great Time in Lieu Policy If you think you tick all these boxes and have the ability to make this role your own, apply now!", "source": "trademe", "skills": "[{\"name\": \"intune\", \"type\": \"tool\"}, {\"name\": \"sccm\", \"type\": \"tool\"}, {\"name\": \"miradore\", \"type\": \"tool\"}, {\"name\": \"soti\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"creativity\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "other"},
{"title": "Senior Business Analyst - IAM", "location": "None", "company": "Find IT Auckland", "type": "None", "duration": "None", "description": "Description Work from anywhere in New Zealand Immediate start Excellent daily rate. Position: Senior Business Analyst - Identity and Access Management (IAM)\nContract Duration: 3 Months (High likelihood of extension)\nLocation:  Flexible\nRate: Competitive daily rate About the Role: We are working with a leading organisation to find a talented Senior Business Analyst with extensive experience in Identity and Access Management (IAM). This is an exciting opportunity to contribute to a high-priority project that will enhance the organisation's security and identity management frameworks. The role offers an initial 3-month contract with a strong likelihood of extension based on project needs and performance.\nKey Responsibilities: Collaborate with stakeholders across business and IT to define, document, and prioritise IAM requirements. Analyse current IAM systems and processes, identifying gaps and recommending improvements. Translate business needs into clear technical requirements and functional specifications. Work closely with the project team on the design and delivery of IAM solutions, including provisioning, authentication, and authorisation. Facilitate workshops and stakeholder engagement sessions to ensure alignment and buy-in. Provide high-quality documentation, including business cases, process diagrams, and reports. What We're Looking For: Proven experience as a Senior Business Analyst, ideally within IT security or IAM projects. Strong knowledge of Identity and Access Management tools (e.g., Okta, SailPoint, Azure AD). Ability to effectively bridge the gap between technical teams and business stakeholders. Familiarity with IAM frameworks, regulatory compliance, and best practices. Excellent stakeholder engagement and facilitation skills, with a collaborative approach to problem-solving. Proficiency with tools such as JIRA, Confluence, or similar project collaboration platforms. Relevant certifications (e.g., CBAP, CISSP, or similar) are an advantage but not essential. Why Apply? Opportunity to work with a leading organisation on a high-profile IAM project. Initial 3-month contract with a strong chance of extension. Competitive rates and flexible working arrangements. A chance to make a tangible impact within a supportive and collaborative environment. How to Apply: As a trusted recruitment partner, we are managing applications on behalf of our client. Please submit your CV and a short cover letter outlining your experience with IAM. Please as this is a contract opportunity only people with current NZ working rights will be considered.", "source": "trademe", "skills": "[{\"name\": \"identity and access management\", \"type\": \"framework\"}, {\"name\": \"okta\", \"type\": \"tool\"}, {\"name\": \"sailpoint\", \"type\": \"tool\"}, {\"name\": \"azure active directory\", \"type\": \"tool\"}, {\"name\": \"jira\", \"type\": \"tool\"}, {\"name\": \"confluence\", \"type\": \"tool\"}, {\"name\": \"cbap\", \"type\": \"certification\"}, {\"name\": \"cissp\", \"type\": \"certification\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"collaboration\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "business & systems analysts"},
{"title": "ICT SUPPORT TECHNICIAN", "location": "None", "company": "Rapid Tech Solutions", "type": "None", "duration": "None", "description": "Description We are looking for a full time energetic Micro soldering/ICT Support Technician with solid experience in repairing iPads, iPhones, Macintosh computers, and PC computers to join our team. This is not an entry level or a temporary position. You need to be really good at physically fixing iPhones and iPads and understand how they work on the component level. You need to have general knowledge in electronics and the ability to diagnose and resolve computer related issues properly and efficiently.This role is for you if you are a quick thinker,solutions focused and love challenges, as varied customers have varied issues and requirements. You will need to provide remote and on-site technical support to domestic and business customers and resolve their issues.\nRole and Responsibilities: Experience in micro soldering IC chips,read schematics/diagrams is a must. This position is very hardware focused. Must be very proficient with micro soldering and small repair tools. Use the BGA Rework station to remove and install BGA components. Replace PCB components including soldering and de-soldering of through-hole and SMT components. Maintain work environment clean and organized. Must be able to carefully open up electronic devices without causing damages. Must be able to do research on how to perform repairs. Board level repair for all devices including iPhones and iPads. Demonstrate knowledge and experience of hardware and software repair for computers, laptops, and tablets and Mobile Phones of all types including Apple Diagnose for software and hardware issues and requirements to provide appropriate solutions to problems. Do tasks such as installation, configuration and troubleshooting of operating systems like Windows 10, Latest Windows Servers, Mac OS and iOS. Demonstrate knowledge and experience of repairing and replacing peripheral equipment such as terminals, printers and modems Upgrade software; apply patches on client system as and when required. Visit home users to set up their PCs or fix faulty equipment and provide required support. Troubleshoot hardware and software issues for diagnosing root cause analysis. Support and maintenance of computer systems and components. Install, configure and manage Local Area Networks. Respond to customer technical inquiries over the phone and in-store. Install and troubleshoot hardware and device drivers on client machines Install and configure monitors, desktop, keyboards, printers and other peripheral devices. Improving and upgrading the technical services provided by company. ? Perform other relevant duties as required time to time.\nQualifications and Experience required: At least 2 years of relevant work experience Knowledge of micro soldering techniques Mobile Phone Screen glass repair\n Other Skills &amp; Competencies Required: A clean Full New Zealand drivers license as sometimes, you may be required to drive to on- site within the         city for work. We will provide company vehicle for this. Excellent communication skills, must be able to clearly communicate over the phone and in person Ability to work to a tight schedule, highly organized and ability to handle between multiplejobs and display prioritization skills. Excellent customer service skills We may ask for criminal record check and drug test\nSalary range for this job is between $30-35 per hour depending upon skills and experience. Applicants for        this position should have NZ residency or a valid NZ work visa. WORK PLACE\nRAPID TECH SOLUTIONS \n348 HERETAUNGA ST WEST HASTINGS.", "source": "trademe", "skills": "[{\"name\": \"micro soldering\", \"type\": \"tool\"}, {\"name\": \"local area networks\", \"type\": \"networking\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"customer service\", \"type\": \"soft skill\"}, {\"name\": \"troubleshooting\", \"type\": \"methodology\"}]", "salary": 72800, "date": "2024-11-18", "category": "service desk"},
{"title": "Practice Lead", "location": "None", "company": "TurboTech Ltd", "type": "None", "duration": "None", "description": "Description The Business:\nWe’re Auckland based innovative Business, who are into IT solutions and services. Role Purpose:\nThis role will see you leading and facilitating consultancy / change management activities across projects and programs, challenging the status quo and identifying improvement opportunities resulting in Improvement in key performance measures, greater levels of customer satisfaction, improved operational efficiency. As well as leading the team you'll will be responsible for analysing, planning, implementing, and evaluating change strategies and implementation of IT projects, facilitating a collaborative approach to change, building ownership and capability.  In a role like this, and it goes without saying that you will communicate, engage and influence adoption of change with Internal stakeholders, and external key stakeholders. The ideal candidate will have strong project management skills, as well as experience in the IT field. Role Specific Knowledge, Skills & Experience: Essential Minimum 10+ years as an EPM consultant and Project Management experience. Desired technical experience in ANAPLAN, Informatic or equivalent. Exceptional written and oral communication skills including well-developed facilitation and presentation skills. Strong skills in partnering with customers and stakeholders to think and work creatively. Ability to influence and motivate others and move toward a common vision or goal. Familiarity with project management approaches, tools and phases of the project lifecycle. Excellent planning and organisation skills. Personal Attributes Experience in working effectively to demanding deadlines, and ability to manage a range of tasks at any one time and prioritize own workload. Displays drive, energy and enthusiasm for making things happen CI Mindset – Looking at ways to work smarter to get a better outcome Desirable Bachelor’s degree in relevant discipline or equivalent experience 10+ years of experience as a IT consultant. Strong understanding of IT project management principles and methodologies Excellent communication and interpersonal skills Ability to work independently and as part of a team Work will be onsite at Papakura, Auckland. Operations open between 9am and 6pm, 6 days a week.\nThis is Full-time permanent 40 hours (guaranteed 30 hours minimum) and pay between $35 to $40 per hour depending on experience and ability. Currently, it is 5 days per week, including Saturday. No late nights.\nAccredited employer so relevant CV's will be considered.\nThis will be a hands-on role in a relaxed and happy environment, working alongside a small team to provide a great experience for our customers. Apply now if this sounds like your next role!", "source": "trademe", "skills": "[{\"name\": \"anaplan\", \"type\": \"tool\"}, {\"name\": \"project management\", \"type\": \"methodology\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"creativity\", \"type\": \"soft skill\"}]", "salary": 83200, "date": "2024-11-18", "category": "project management"},
{"title": "Senior .Net Developer (6-month Contract)", "location": "None", "company": "Platinum Recruitment", "type": "None", "duration": "None", "description": "Description Competitive contracting rate Large pipeline of work available for the right candidate Varied and modern technology stack We have a 6-month contract opportunity available for a Senior .Net Developer to join our clients working across their in-house application. The successful candidate will have proven experience in providing mentorship and guidance across .Net technologies to development teams and helping strengthen skill sets. This is a Christchurch based role, we will not be considering remote or FIFO candidates for this position. THE ROLE & YOU: You will work closely with the wider Development Team including QAs and Developers of various skill levels to build and maintain our clients software application to high-quality standards. You'l be required to assist across the full software development lifecycle in design, development, testing and documentation of software to meet product / solution roadmaps.\nYou'll be a self driven individual who excels working independent and in a team environment. Previous experience in legacy projects will be beneficial in this role. REQUIRED TECHNICAL SKILL SET: Skilled across the Microsoft Stack, specifically C#, .Net and SQL. High level expertise in Angular, Git, TypeScript and JavaScript. Previous experience in HTML, CSS and APIs. Skilled across AWS Cloud platforms. Exceptional written and verbal communication skills with the ability to adapt to your audience. Docker, GitHub and Jenkins experience is advantageous. READY TO APPLY? If you know this role matches your skillset and you are looking for a change hit APPLY NOW! To find out more or have a confidential chat you can contact Alicia via her details: Alicia - 027 752 8466 / mailto:alicia@platinumrecruitment.co.nz Not the right role for you? We have a number of other IT opportunities nationwide and welcome your interest. Applicants must have a valid work visa, permanent residency or NZ citizenship to be considered. Platinum Recruitment are proud to be a member of Diversity Works New Zealand and believe in equal opportunities for all and we actively promote diversity and inclusion in all our recruitment processes \"Do workplace inclusion well and do well because of it\".", "source": "trademe", "skills": "NULL", "salary": "NULL", "date": "2024-11-18", "category": "None"},
{"title": "Clinical Effectiveness Advisor", "location": "None", "company": "Kiwi Health Jobs", "type": "None", "duration": "None", "description": "Description Based at Auckland City Hospital, Grafton\nPermanent, Full-time role, Monday  Friday\nSalary $86,000 - $100,000 pa (commensurate with skills and experience) Te whiwhinga mahi | The Opportunity As a Clinical Effectiveness Advisor, you will work in partnership with the Directorate as a trusted and objective voice-review to understand clinical risks and their implications for patient safety. In addition, you will facilitate learning from normal work, adverse events, and incidences, to enable processes, models of care, and quality of delivery, to be improved. For all aspects of this role, required experience/knowledge please click through to the position description. Nga Pukenga Motuhake | Important Skills A Tertiary qualification in a health profession\nAt least 3 years work experience in a healthcare setting\nExperience in risk management and quality system frameworks\nExperience in a role with substantial focus on healthcare quality and/or safety\nCommitment to biculturalism and to achieving equitable outcomes for Maori Ko wai matou | Our Organisation We are Te Whatu Ora Te Toka Tumai Auckland. We provide health and disability services to more than half a million people living in central Auckland, regional services for Northland and greater Auckland, and specialist national services for the whole of New Zealand. Our main sites are Auckland City Hospital, Greenlane Clinical Centre and Starship Children's Hospital, located in central Auckland. We are part of Te Whatu Ora  Health New Zealand, the overarching organisation for New Zealand's national health service. Te Whatu Ora leads the day-to-day running of the health system, with functions delivered at local, district, regional and national levels. We are committed to upholding Te Tiriti o Waitangi and providing culturally safe care. We value role modelling manaakitanga as demonstrated by Ngati Whatua in the gifting of their whenua on which our hospitals stand. We aspire to having a workforce reflective of the communities we serve and achieving equitable outcomes for all. He aha nga painga o tenei mahi mou | Why you will enjoy working here We recognise there is more to life than mahi | work, and we encourage and provide access to all our staff several services and benefits to support themselves whilst they are employed within Te Toka Tumai Auckland. For more information on what we offer, please click here. Me pehea te tuku tono | How to apply Please submit your application online via our website, outlining your experience and motivation to apply to this role. (Please note: We do not accept CV applications emailed to us). To view details about our recruitment process, click here. If you have any queries, please contact Recruitment Consultant, Belinda Peddie - mailto:belinda.peddie@tewhatuora.govt.nz and quote ADHB21957. If we receive a high number of applications for this position, we may have to close our advertising early. We recommend that you submit your application as early as possible.", "source": "trademe", "skills": "[{\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"leadership\", \"type\": \"soft skill\"}]", "salary": 100000, "date": "2024-11-18", "category": "other"},
{"title": "Technician ( Security,Data and Voice) N Cabling", "location": "None", "company": "Clartech ltd TA Focus eye ltd", "type": "None", "duration": "None", "description": "Description We are actively seeking experienced candidates to join our team, requiring a minimum of 2-4 years of experience in IT/telecom/security. The ideal applicant should be versatile, a team player, and a quick learner, as this is an urgent position. Proficiency is expected in various areas, including Data and Cabling standards (Cat6, Cat6a, Cat7, Multimode, and Single-fiber cabling splicing),Alarm systems, Access controls, CCTV Installer and along with expertise in desktops, laptops, Microsoft Operating systems, MS Office 365, and Adobe Creative Cloud suite, especially Adobe Illustrator. Special training will be given on IP CCTV S VMS-based security applications, WIFI design,\nscope and installation. Salary range: $30 - $35 per hour Key tasks and responsibilities: Data cabling like Cat6, Cat6a, and Cat7 copper and Fiber Multimode and Single fiber cabling splicing, testing, and commissioning. Ensure that all CCTV and Biometric systems are well maintained (Configure and Support). Installation,commissioning and cabling of Alarm system,cctv ,Access control system and having experience minimum 1 year to 4 years In addition to the base salary, this position may include commission, piece rates, or non-guaranteed bonuses based on individual and/or team performance. The company provides a reasonable estimate of actual earnings, taking into account these variable components. This estimate is subject to change based on business conditions and individual performance, and actual earnings may vary. The company is committed to providing transparency and will communicate any adjustments to compensation structures as needed. Place of work: shall be at the Employer’s premises (East Tamaki, Auckland), remotely, when the employer requests to attend to issues. Occasionally, at employers' request, candidates may need to attend to jobs outside of Auckland and may have to travel/work after-hours for emergency breakdowns. Candidates will be extra for more hours. Overseas applicants can also apply for this position; please send your complete CV and cover letter to apply for this position. Applications without a cover letter and references won't be considered.", "source": "trademe", "skills": "[{\"name\": \"cat6\", \"type\": \"cabling\"}, {\"name\": \"cat6a\", \"type\": \"cabling\"}, {\"name\": \"cat7\", \"type\": \"cabling\"}, {\"name\": \"cctv\", \"type\": \"tool\"}, {\"name\": \"biometric systems\", \"type\": \"tool\"}, {\"name\": \"microsoft office 365\", \"type\": \"tool\"}, {\"name\": \"adobe illustrator\", \"type\": \"tool\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}]", "salary": 72800, "date": "2024-11-18", "category": "networking & storage"},
{"title": "ICT Computer & Mobile Phones Repair Technician", "location": "None", "company": "Tech Engineers & AppleFix", "type": "None", "duration": "None", "description": "Description We are accrediated employer immigrants can apply. \nEmail cv to mailto:applefixnewzealand@gmail.com Job Description:\nYou will be responsible for: Diagnosing and repairing various phone and computer & hardware and software issues.\nSolid and proven repair experience in fixing electronics like iphone samsung \nProviding technical support and advice to customers.\nMaintaining accurate records of repairs and inventory.\nEnsuring all repairs are completed in a timely and efficient manner.\nPerforming system installations, configurations, and upgrades.\nTroubleshooting network and connectivity problems. Key Responsibilities: Device Diagnosis & Troubleshooting: Skilled in identifying and resolving technical issues across a variety of devices, including smartphones, laptops, desktops, and gaming consoles. Hardware Repair & Maintenance: Expertise in handling physical repairs such as screen replacements, battery swaps, component-level diagnostics, and circuit board repairs for various electronic devices. Software Installation & Support: Proficient in software troubleshooting, including operating system installations, configuration, updates, malware removal, and resolving software compatibility issues. Customer-Focused Technical Support: Excellent communication skills, ensuring customers receive clear, easy-to-understand guidance and maintaining high levels of customer satisfaction. Technical Documentation: Ability to document diagnostic findings, repair processes, and service reports and maintain detailed service history records for future reference. Operating Systems Knowledge: Strong understanding of Windows, macOS, iOS, and Android systems, allowing for versatile device support and multi-platform troubleshooting. Networking & Peripheral Support: Skilled in setting up and troubleshooting network connections, as well as configuring and repairing peripheral devices like printers, scanners, and other accessories. Quality Assurance & Testing: Conducts thorough testing and quality control on repaired devices to ensure reliability, functionality, and customer satisfaction post-service. Inventory & Tool Management: Efficient in managing tools and spare parts inventory to ensure timely repairs and minimize service downtime. Time Management & Multitasking: Strong organizational skills, capable of handling multiple service requests, prioritizing tasks, and managing time effectively in fast-paced environments. > Hands-on experience troubleshooting and replacing any part that causes an issue, such as capacitors, ICs, power supplies, fan heating, and resisters, on any kind of motherboard. Qualification: Minimum Year 12, High School degree within engineering main subjects. Experience: Minumum 3 years of hands-on experience, full time. Requirements: Solid Experience in phone and computer repair.\nExperienced in diagnosing the fault up to chip level.\nDesoldering and soldering IC chips.\nSamsung & iPhone new logicboard double layer rebelling & separation.\nComplete understating of electronic circuits in phones, laptops, tablets, etc Send your CV to mailto:applefixnewzealand@gmail.com", "source": "trademe", "skills": "[{\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"time management\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "service desk"},
{"title": "Workday Solution Lead", "location": "None", "company": "Find IT", "type": "None", "duration": "None", "description": "Description Fixed-Term position Strong experience in Workday Finance and HCM modules Great work flexibility on offer We're looking for an experienced and enthusiastic Workday Solution Lead to join an established Public Sector organisation in their post-implementation phase. If you have expertise in Workday Finance modules like Financial Accounting, Budgets, Projects, and more, we want to hear from you. Experience with HCM modules (Core HCM, Recruitment, Compensation, and Talent) is a bonus. You'll play a key role in making sure our Workday systems are running smoothly and supporting our team. Key responsibilities: Owning the Workday System: You'll take charge of designing and configuring our Workday system (both HCM and Finance), making sure it works seamlessly for everyone. Partnering with the Business: You'll work closely with different teams to keep improving the way we use Workday, helping resolve any issues and ensuring we're getting the most out of the system. Enhancing the System: You'll look for ways to enhance our Workday system, recommending improvements and staying on top of new features and releases. Leading the Team: You'll be a key leader in our Workday support team, balancing day-to-day support with strategic projects and system upgrades. Providing Training: You'll help train business owners and subject matter experts, guiding them through the system and making sure they feel confident using Workday. What We're Looking For: Proven experience as a Workday Functional Lead in Finance, or similarly a Lead role where you have worked in implementing or managing Workday systems and modules. Solid experience with Workday Finance and HCM modules. Great leadership and communication skills - you know how to guide a team and explain complex ideas clearly. Strong organisational skills with the ability to juggle multiple tasks at once. You'll be part of a friendly, supportive team that values collaboration and innovation. There are great opportunities for growth and learning - our client is always looking to improve and stay ahead of the curve. Great work-from-home flexibility on offer! If you're excited about leading a team and making a real impact with Workday, we would love to hear from you. Apply now or reach out to Kylie at mailto:Kylie.Brocket@findrecruitment.co.nz", "source": "trademe", "skills": "[{\"name\": \"workday\", \"type\": \"platform\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"leadership\", \"type\": \"soft skill\"}, {\"name\": \"organisational\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "consultant"},
{"title": "Senior .Net Developer", "location": "None", "company": "Platinum Recruitment", "type": "None", "duration": "None", "description": "Description Short-term engagement to deliver a key project Competitive contracting rate Hybrid working model We have a short-term contract available for a Senior .Net Developer to join our clients and deliver a key project. The successful candidate will have proven experience in the .Net framework and GitHub migration projects. Please note that this role is based in Christchurch, we will not be considering remote candidates for this role. THE ROLE: You will work closely with the wider Development Team including QAs and Developers of various skill levels to migrate our clients old .Net projects to GitHub. You will also be required to bring their framework version up to the latest available as well as setting up their GitHub. SKILL SET: Skilled across .Net frameworks. Proven experience across Azure, including DevOps and Pipelines. Skilled across GitHub Actions and Octopus Deploy. Exceptional stakeholder engagement and written / verbal communication skills with the ability to adapt to your audience. Strong documentation skills to create an easy to follow path for the wider teams to self service the remaining migration. READY TO APPLY? To be considered for this position, apply with a cover letter and current resume outlining your relevant experience. To confidentially discuss your skill alignment with the role, you can contact Alicia on 027 752 8466 | mailto:alicia@platinumrecruitment.co.nz Please note only candidates with current NZ work rights will be considered for this position. Applications will be reviewed as they are received.", "source": "trademe", "skills": "[{\"name\": \".net\", \"type\": \"framework\"}, {\"name\": \"github\", \"type\": \"tool\"}, {\"name\": \"azure\", \"type\": \"platform\"}, {\"name\": \"devops\", \"type\": \"methodology\"}, {\"name\": \"pipelines\", \"type\": \"tool\"}, {\"name\": \"github actions\", \"type\": \"tool\"}, {\"name\": \"octopus deploy\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "programming & development"},
{"title": "Laboratory IT Specialist and Support - North Shore", "location": "None", "company": "Kiwi Health Jobs", "type": "None", "duration": "None", "description": "Description Full time, permanent Laboratory IT Technical Specialist and Support Waitemata District Laboratory Health New Zealand is Aotearoa's national health authority, committed to delivering a health system that is simpler and more coordinated, allowing for better and more consistent care to support all New Zealanders to live longer and have the best possible quality of life. Health New Zealand  Waitemata District serves the communities of Rodney, North Shore and Waitakere. With a population of over 630,000 people, we are the largest New Zealand District by population. We provide secondary hospital and community services from North Shore and Waitakere Hospitals and 30 community sites throughout the district, and employ more than 6800 people. Your clinical and IT experience with the ability to prioritise and strong communication skills will all be essential as you work to support the laboratory in the provision of a timely and effective service to clinicians and patients using informatics. Requirements: Understanding of the LIS\nUnderstanding of Clinical Laboratory testing\nTechnical background in Delphic Systems with the ability to program in these systems\nFamiliarity with HL7 messaging\nCapable communicator in both a technical and non-technical manner with internal and external stakeholders\nDemonstrated initiative and own learning development\nAble to produce business analysis and quality reports Preference will be given to a candidate with: Medical Laboratory Scientist qualification\nProject experience\nFamiliarity with Python, SQL, JavaScript or Bash scripting is a bonus To view the position description, please click here. To be considered for this role, please apply online via http://www.wdhbcareers.co.nz and include your CV and cover letter. For assistance with your application, please contact Sarah Kneller - Recruitment Consultant via mailto:sarah.kneller@tewhatura.govt.nz. Job reference: WDHB18318", "source": "trademe", "skills": "[{\"name\": \"lis\", \"type\": \"database\"}, {\"name\": \"delphic systems\", \"type\": \"tool\"}, {\"name\": \"hl7\", \"type\": \"protocol\"}, {\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"javascript\", \"type\": \"language\"}, {\"name\": \"bash\", \"type\": \"language\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "other"},
{"title": "Solutions Architect", "location": "None", "company": "One Technology", "type": "None", "duration": "None", "description": "Description Do you want the opportunity to develop control systems for some of the nation’s greatest companies?  The successful candidate will play a key role in designing, developing, and maintaining sophisticated software solutions, leveraging their expertise in object-oriented programming and database management. Top Reasons to Work with Us Flexible work schedule with work from home options for numerous roles Competitive Compensation including a bonus plan A path for growth, a great culture AND MORE! What You Will Be Doing Develop HMI/SCADA/MES and system integration solutions for various clients High level language programming for a variety of applications. This includes .NET, Python,  etc. Act as the technical lead on projects and interface with technical clients regarding the solution. What You Need for this Position Bachelor of Software Engineering/Computer science or related engineering field OR relevant experience Experience developing software solutions preferably in a project based industry. Experience with Ignition or Sepasoft is a huge plus Ability to travel up to 20% https://www.1tech.nz", "source": "trademe", "skills": "[{\"name\": \"object-oriented programming\", \"type\": \"methodology\"}, {\"name\": \".net\", \"type\": \"framework\"}, {\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"database management\", \"type\": \"database\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "programming & development"},
{"title": "Reporting Analyst - 6 Month Contract", "location": "None", "company": "Find IT Auckland", "type": "None", "duration": "None", "description": "Description Provide insights, driving decisions with Excel, SAP ECC, and planning expertise. Streamline reporting, using Excel & SAP to ensure efficient merchandise planning Solve data challenges, delivering accuracy and insights to fuel business growth. About the Role: Reporting Analyst - Initial 6 Month contract Are you a skilled Reporting Analyst looking to make an impact with your analytical expertise and keen problem-solving abilities? Join our clients dynamic team, where you'll be pivotal in ensuring accurate, timely, and insightful reporting to support strategic decision-making within our organisation.\nKey Responsibilities: Develop and maintain daily and weekly reports, providing stakeholders with timely insights. Utilise advanced Excel skills to create complex models, automate processes, and streamline reporting functions. Conduct analysis and reporting using SAP, with a focus on SAP ECC to track and manage data accurately. Engage in merchandise planning, collaborating with cross-functional teams to drive data-driven decision-making. Troubleshoot reporting issues and provide high-level solutions, ensuring data integrity and accuracy. What They Are Looking For: Advanced Excel: Extensive experience in formulas, pivot tables, data modelling, and automation. SAP Reporting: Strong understanding of SAP reporting tools, particularly within SAP ECC. Merchandise Planning: Experience in the retail sector, ideally with a background in merchandise planning. Problem Solving: High-level problem-solving abilities, with a keen eye for detail and data accuracy. What They Offer: A collaborative team environment. Competitive contractor rate. The chance to work on exciting projects that make a real impact on the business. If you're passionate about data, have a strong analytical mindset, and are ready to make a meaningful difference, we'd love to hear from you! NZ Visa holders only please - Immediate start for the right candidate!", "source": "trademe", "skills": "[{\"name\": \"excel\", \"type\": \"tool\"}, {\"name\": \"sap ecc\", \"type\": \"platform\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-11-18", "category": "other"}
]