[
{"title": " Senior Marketing Automation Analyst ", "description": ["Description", "Right now we have an opportunity for a Senior Customer Automation Analyst to join our Property Audience Marketing team.  This role involves working in squads with our marketing and customer lifecycle managers to scope, develop and create targeted campaigns, insights and automations. Also working closely with our data science, analytics engineering and data platforms teams to identify opportunities, prepare data models and manage reporting data pipelines respectively.   ", "\n", "This is a hands-on role where you'll use your knowledge in data technologies and analysis skills, combined with your continuous improvement mindset and ability to think outside the box to create exceptional data driven marketing campaigns at pace.  ", "\n", "Here's what you can expect from this role:   ", "\n", "Work with marketing teams to support a data driven approach to omni channel marketing campaigns and target audiences.", "Conduct A/B tests and multivariate experiments to optimise campaign effectiveness and drive continuous improvement.", "Analyse test results and provide recommendations for refining targeting, messaging, and creative strategies", "Collaborate closely with cross-functional teams including Marketing, Data Science, and Data Engineering to ensure preparedness for campaigns, priorities, and execution strategies and identify innovative ways to use Trade Me’s data to send relevant and targeted omni-channel communications. ", "Utilise our cloud data warehouses and ETL tools to perform data modelling and analysis, extracting actionable insights to inform marketing strategies.", "Develop advanced SQL queries and scripts to manipulate and transform data for reporting purposes.", "Development of post campaign analysis using industry leading BI tools for campaigns, benchmarking results against business objectives and presenting these results back to key stakeholders.", "Be a key member of the team responsible for the management of our key Martech platforms including Segment.io, Braze and GA4.", "What you will bring to our team:", "\n", "Experience: ", "\n", "Hands-on competency with data technologies to support digital customer analytics e.g. SQL,Python, Business intelligence tools. ", "Experience with ETL tools like DBT and cloud data warehouses like Snowflake. ", "Advanced Dashboarding skills & Reporting Automation (PowerBI, Google Data Studio) ", "Marketing or IT degree or equivalent Business degree is desirable. ", "Experience working with the Martech platforms would be an advantage.", "The successful candidate will be a strong analytical thinker with a bias to action who is skilled at out of the box thinking. They will be highly driven to achieve and exceed commercial outcomes for our Property vertical.", "\n", "We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'.  If you're excited about this opportunity, we'd still really like to hear from you.", "\n"], "location": " Auckland City, Auckland ", "company": " Trade Me ", "type": " Full time ", "duration": " Permanent "},
{"title": " Technical Customer Support Specialist ", "description": ["Description", "Join our pre-opening team for Harvey Norman Papanui and make history! We are opening a brand new store and we need your help.  ", "\n", "Combine your IT expertise and customer service skills in this Technical Customer Support Specialist position in our Papanui store, Computers department! This full-time role provides software and hardware support to customers and aims to grow the Tech2Home business.", "\n", "About the Role\nWe are looking for a positive and enthusiastic candidate to join our small team. This role includes tasks such as software and hardware installation for customers both in the Tech Bay and customer homes providing a positive experience for all customers. Training will be provided on our systems and machinery to ensure you are fully supported when you start with us.", "\n", "Some key tasks will include:", "\n", "Troubleshoot, diagnose, and provide solutions to customers on desktop, laptops, tablets, smart phones, and other computer peripherals.", "Drive sales of TechTeam services within the sales team, tech bay and with customers.", "Process all returns and faulty products correctly and dispatch for repair, replacement, or credit.", "Liaise with suppliers and repair agents to ensure that customers get their products repaired or replaced promptly.", "Undertake cashiering and sales duties as required.", "About You\nWe are looking for a technical expert who can provide great customer service. Some attributes we are looking for include:", "\n", "Technical understanding of computers and computer products.", "Customer service skills.", "Current, full NZ Drivers License.", "Retail experience desirable.", "IT certifications or qualifications desirable.", "Able to work weekends and public holidays essential.", "About the benefits\nOur staff make our brand amazing and over the last 25 years have built our business into one of NZ’s leading retailers. Working with us means you get access to some exclusive staff perks, including:", "\n", "Discounted, gym membership, eye care, dental care, and banking products.", "Exclusive staff discounts on our products.", "Access to Employee Assistant Programme Services (Raise).", "Long service recognition at each of your 5-year milestones.", "We pride ourselves on being a market leader and have a great track record of providing high quality products and outstanding customer service. Here at Harvey Norman, we are proud to boast that all our General Managers and retail Store Managers have been promoted from within the business. This is your opportunity to learn from the best and grow to be one of the best!", "\n", "At Harvey Norman it’s never just a job, it’s a career. If you’re the kind of person who’s dedicated, people-oriented, loves tackling new challenges and has an interest in retail, you’re perfect for us. You’ll be encouraged to show your entrepreneurial side and, if the opportunity arises, explore a role you feel best suits your skill set.", "\n", "Don’t miss this opportunity, APPLY NOW!", "\n"], "location": " Christchurch City, Canterbury ", "company": " Harvey Norman ", "type": " Full time ", "duration": " Permanent "},
{"title": " Senior Network Support Consultant ", "description": ["Description", "Continue to grow your career in New Zealand's millennial university", "Use your proven specialist expertise to explore and push your innovative boundaries", "Full-time, permanent role based in Auckland CBD", "AUT's ICT Services directorate is one of NZ's largest and an outstanding team that prides itself in working with leading technologies to deliver cutting-edge services that solve real-world problems for the demands of the University. With over 100 staff committed to the mission of AUT, ICT Services holds responsibility for the technology, supporting over 30,000 educators, researchers, and students at New Zealand's only University of Technology.", "\n", "Te Whiwhinga mahi | The opportunity", "\n", "We have a fantastic opportunity for a seasoned, business-savvy Senior Network Support Consultant to join our integrated ICT department, dabbling in the best-in-breed technologies. You will be involved in a combination of data center, Level 3 and Level 2 Network Operations, Switching & Routing, Lifecycle, Incident, and Change management with some design. You will also have an opportunity to mentor junior team members, including those on other frontline teams. There may be some travel involved between our data centres and after-hours work, to support a high-performing team leading the way in technology.", "\n", "He kōrero mōu | About you", "\n", "You will have:", "\n", "At least 7 years of Network Enterprise IT systems experience (WAN technology such as MPLS architecture, Internet BGP) and associated tools and languages.", "Knowledge of routing and switching (Cisco and Aruba would be great)", "Experience in Network performance engineering, scaling, capacity management, and automation.", "Experience in 24x7 production environments.", "Work in conjunction with other departments to ensure service-impacting incidents are minimised.", "CCNP certified or relevant experience and working towards certification.", "Knowledge of programming skills such as Python and Ansible", "Experience in SNMP, MRTG, Cactcti, Wireshark, and Linux-based environments.", "Experience working in Nexus environment - an advantage", "Competent communication and negotiation skills - ability to communicate to customers professionally on technical and non-technical issues and strong written communication is preferred.", "Ability to clarify customers' requirements and provide suitable solutions to cater to them", "Coaching and facilitation skills to empower and encourage employee experience through the learning and change process and value any input received.", "Excellent communication skills and an ability to communicate effectively with diverse stakeholders and customers to achieve understanding and action", "An organised nature and a desire to plan for success.", "Proven experience in influencing and relationship management with an ability to balance and manage diverse stakeholder interests.", "If this sounds like you and love variety in the workplace, come join us! Your love for learning new technology, a keen eye for detail, proactivity, forward-thinking, diligence, and get-things-done approach are keys to success in this role.", "\n", "AUT is a great place to work and our staff are highly valued in the contributions of their diversity of thought, backgrounds, and experience, which help to make our university the unique workplace it is today. You will also enjoy excellent staff benefits, which include free study, a personal fund for continued professional development, and generous leave allowances.", "\n", "Please note: You must be eligible to work in New Zealand to be considered for this role.", "\n", "Ref: 89812", "\n", "Closing Date: 26th August 2024, at 11:55 pm. ", "\n", "*Full-time denotes 37.5 hours per week", "\n", "At AUT we strive to be a place where people love to work and learn. We are committed to te Tiriti, excellence and inclusivity and aspire to be the University of choice for Māori and Pacific communities. We welcome people of all ethnicities, genders, sexual orientations, religious and political beliefs, socio-economic situations and accessibility needs.", "\n"], "location": " Auckland City, Auckland ", "company": null, "type": " Full time ", "duration": " Permanent "},
{"title": " IT Systems Engineer ", "description": ["Description", "We have an opportunity for an experienced Systems Engineer. You will provide technical support to our client base within the Wellington Region and Nationwide, remotely and onsite, for software, desktops, servers, and network issues.", "\n", "Tasks vary and include desktop troubleshooting, hardware and network implementations and supporting applications. ", "\n", "You will have the following:", "\n", "2+ Years of proven experience working in an IT support role", "Proven experience with Windows-based computers and network systems", "Excellent troubleshooting and repair skills", "Knowledge and experience with Windows Server configuration", "Networking skills, switch patching and management, TCP/IP networking including DHCP and DNS", "Experience configuring, managing and troubleshooting routers, switches, VPNs, firewalls", "Excellent knowledge of 365, Exchange, IIS, SSL, and Group Policies", "What you'll bring with you:", "\n", "A logical problem solver", "Ability to think outside the box", "Work well in a team environment", "A passion for technology", "Excellent interpersonal and customer service skills", "Full driver's license with a clean record", "Effective communication: written, interpersonal and telephone\n*Ability to self-manage, identify the causes of issues, and determine required action to resolve, including escalation", "You will work within a small central Wellington team supported by 4 full-time technicians. Our clients' broad and exciting nature and needs will challenge you; no two days will be the same.", "\n", "Applicants must be legally entitled to work in New Zealand.  A full, clean New Zealand driver's license is essential.", "\n", "When applying, please provide an up-to-date CV and Cover letter detailing your skill set and why you're the right person for the job.", "\n"], "location": " Wellington, Wellington ", "company": " Redstripe Ltd ", "type": " Full time ", "duration": " Permanent "},
{"title": " Systems Engineer ", "description": ["Description", "Systems Engineer - Linux/AWS", "Auckland CBD - Flexible work hours, Hybrid", "Permanent - Up to $100K per annum based on experience", "About the Company", "\n", "Our client specialises in delivering niche solutions to target customers across the world, revolutionising their ways of working. Our client delivers meaningful work, delivering real change in the market and ensures embracing emerging technologies.", "\n", "About the Role:", "\n", "You will be joining a highly supportive team in delivering support across all of the business. You will be engaging in Cloud Automation, Cyber Security and all things Infrastructure. A great opportunity to be a highly contributing member in a tight-knit team.", "\n", "Skills Required:", "\n", "2-3 years' experience in Systems Administration and Engineering", "Experience in IT Systems, Networks and Cloud", "Experience in Linux and AWS", "Experience in SCIM, OKTA or similar technologies", "Experience in Terraform and Ansible", "NOTE: You will need to be in New Zealand presently with full working rights and eligibility to work. ", "\n", "Job#128315", "\n"], "location": " Auckland City, Auckland ", "company": " Beyond Recruitment ", "type": " Full time ", "duration": " Permanent "},
{"title": " Commercial Consultant ", "description": ["Description", "Our Enterprise client seeks an experienced Commercial Consultant with proven experience and track record of working across complex business cases.", "\n", "As a Commercial Consultant key skills and attributes include:", "\n", "Contract negotiation and the resulting executive outcomes", "Demonstrate experience and delivery across structured complex contracts and then close out the agreement", "Exceptional Customer and Stakeholder management/engagement", "If you are keen and wish to learn more, Apply Now!", "\n", "Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "\n"], "location": " Auckland City, Auckland ", "company": " Comspek International ", "type": " Full time ", "duration": " Permanent "},
{"title": " Project Coordinator - HR ", "description": ["Description", "Our client is seeking an experienced and organised Project Coordinator to come in and work across a busy environment and provide support on varying and interesting projects. ", "\n", "We're looking for a resource with exceptional communication, organisation skills and attention to detail who is keen to come in and hit the ground running! ", "\n", "Some of your responsibilities will include:", "\n", "Developing and maintaining project registers and reports.\n", "Maintaining and updating project review documentation.\n", "Reporting\n", "Providing support services for Project Manager\n", "Working across HR and people and Culture\n", "Must have supported multiple projects / work streams\n", "Building and maintaining effective working networks  to enhance programme and project efficiency.\n", "Strong financial background\n", "If this sounds like you then Apply now!", "\n", "Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "\n"], "location": " Auckland City, Auckland ", "company": " Comspek International ", "type": " Full time ", "duration": " Contract "},
{"title": " Business Analyst  ", "description": ["Description", "We are seeking a seasoned Business Analyst to support the management and development of the Oracle Financial Services Analytics Application (OFSAA) to meet changing business requirements for wider Bank projects.", "\n", "You will be eager to get your hands dirty with data and can provide analytical support across financial services. You will work collaboratively with Bank stakeholders to develop and implement enhancements and can analyse and translate insights and business needs into technical solutions.  ", "\n", "Main Tasks and Responsibilities:\n*    Conduct business and technical analysis to identify solutions to stakeholder requirements and supporting those solutions through to delivery.\n*    All initiatives are undertaken in accordance with established risk and compliance principles and policies.\n*    Consistently deliver high quality, successful, strategic outcomes, working with key stakeholders.\n*    Develop and implement successful solutions to issues meeting and exceeding stakeholder expectations.\n*    Collaborate with wider bank projects to deliver strategic themes.\n*    Develop effective working relationships internally with the IT team to enhance OFSAA functionality and manage issue resolution.", "\n", "Technical Competencies:\n*    Financial modelling and technology skills including MS Excel, Access, VBA/SQL/SAS, OBIEE and relational databases.\n*    Successful change management and implementation of OFSAA BAU system enhancements.\n*    Simplify and streamline OFSAA processes.\n*    Support the implementation of BAU enhancements and system changes.\n*    Have knowledge of systems and relational databases whilst developing an understanding of business processes and methodologies.\n*    Enhance and maintain functional documentation libraries for key processes.", "\n", "Qualifications and Experience:\n*    Experienced Business Analyst with at least 2+ years of banking experience.\n*    Knowledge of a range of banking and financial market products and their purpose.\n*    Leadership skills demonstrated through delivery of outcomes and development of collaborative relationships and networks.\n*    Strong emphasis on both technical and business analysis skills and experience.\n*    Team worker with excellent written and verbal communication skills.", "\n", "Benefits: \n*    Hybrid working, including two days’ work from home a week.                         \n*    Four weeks + three days of annual leave per year.       \n*    Uncapped/managed sick leave allowance with 10 days carers leave annually.\n*    Ability to opt into purchased annual leave for flexibility and annual volunteer leave.\n*    Banking benefits (lower rates, reduced fees etc) and benefits with retail partners.\n*    KiwiSaver + Southern Cross health insurance.", "\n", "If you’re an experienced BA and passionate about banking & financial services, we would love to hear from you. Please send your cover letter expressing your relevant experience to the above requirements and CV in Word format to Bella Richardson mailto:bella.richardson@beyond.co.nz.", "\n"], "location": " Wellington, Wellington ", "company": " Beyond Recruitment ", "type": " Full time ", "duration": " Permanent "},
{"title": " Product Designer - Dunedin ", "description": ["Description", "Are you a skilled Product Designer looking for your next challenge? Did you ever consider Dunedin? We have an amazing opportunity based down south with our client who has a national NZ owned product in the Fintech space. Open to junior to senior options. ", "\n", "Essential skills and experience", "\n", "Minimum of 2-5 years of experience in product design", "Proficiency in design tools such as Sketch, Figma, Miro and prototyping tools like Balsamiq.", "Strong understanding of design led principles, Product discovery & delivery process, and information", "This role is working out of our clients head office in Dunedin, a modern office with all the bells and whistles. Our client offers a competitive package which includes a bonus, insurance, training and more.", "\n", "Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "\n"], "location": " Wellington, Wellington ", "company": " Comspek International ", "type": " Full time ", "duration": " Permanent "},
{"title": " Support Engineer - Junior ", "description": ["Description", " At Trade Me, we're about connecting Kiwi to create the life they want. Whether it's the big things like finding a home, a job, a car or growing their business, or the smaller things, like finding that right bedside table or parting ways with some old stuff. At Trade Me our vision is to be the place where Kiwi look first.     Our Motors Engineering team is looking for a new Support Engineer who will be responsible for helping our customers to seamlessly integrate with Trade Me, providing excellent customer service and being a key problem-solver for our customer support teams\n \n You'll have the best time working at Trade Me, and this is why: \n #Flexible \nFlexible working is the new normal. We have a guideline for our people to be in the office 60% of the time, with the remaining time being flexible. We support you with a home office setup and a utilities allowance to ensure you can work comfortably.\n #Wellness \nBeing your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way.\n #Leave \nWe support you with leave when you need it, including 5 days wellness leave and 10 days sick leave from day 1.\n #Social \nNothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company paid lunches. Friday drinks and nibbles every fortnight, annual Trade Me company awards, celebrations and more.\n #Learning \nWhether it's on the job, formal training, mentoring or something else, you'll grow with us from Day 1.\n \n Here's what you can expect from this role: ", "\n", "Work with Motors integrators for new releases/troubleshooting", "Work closely with our Motors Customer Experience team in triaging and resolving issues", "Help our Sales teams with technical queries.", "Collaborate with Engineering teams during discovery and implementation phases to identify best practice & risk.", "Front line technical help eg: CRM.", "Working with Product to ensure CX & Sales voices are heard and there is a strong communication loop.", "Work  with our integration partners to provide the best possible experience for our mutual customers", " \n Here's what you will bring to the role: ", "\n", "1+ years' experience in similar development roles.", "Sound C# development experience (or similar language), and ideally a good understanding of the .NET Framework.", "Understanding of relational databases and SQL, in particular Microsoft SQL Server.", "A good understanding of OO design patterns, and when to use them.", "Appreciation of SOLID principles, elegant and testable code and what that looks like in a constantly changing codebase with a history.", "A strong understanding of API technologies (preferably REST) and familiarity with API logging, OpenAPI and technical documentation.", "Experience with front-end technologies such as CSS, JavaScript and/or Angular is a bonus, not a must.", "A good team player with a positive attitude and a willingness to collaborate.", "Strong interpersonal, written communication and presentation skills.", "Organised and comfortable with self-directed work; adaptable and can cope with change in a fast-moving environment. ", "Passionate about business improvement and getting better business, people and customer outcomes. ", "Be able to update and create documentation in order to support our Customer Experience team and customers.", "Have a sense of urgency and ability to prioritise while comfortable juggling multiple initiatives concurrently.", "A critical thinker who is detail-oriented, creative, and has a passion for acquiring new skills.", "The ability to work proactively, both independently and collaboratively.  We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'. If you're excited about this opportunity, we'd still really like to hear from you.", " \nAt Trade Me, we're about connecting Kiwis to create the life they want. Whether it's the big things like finding a home, a job, a car or growing their business, or the smaller things, like finding that right bedside table or parting ways with some old stuff. At Trade Me our vision is to be the place where Kiwi's look first.\n \nTrade Me is an INZ accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential. ", "\n"], "location": " Auckland City, Auckland ", "company": " Trade Me ", "type": " Full time ", "duration": " Permanent "},
{"title": " Website Designer ", "description": ["Description", "Flexibility to Suit you!!", "Contracting Opportunity!!", "Competitive Rates!!", "Seeking an Experienced Website Developer for a Contracting Role!!", "\n", "This is a fantastic opportunity for an experienced developer seeking contracting work. ", "\n", "What Makes you a good fit??", "\n", "App development would be advantageous", "Confident working independently on Projects", "To Learn more about this opportunity, please call Max on 021 885 188", "\n"], "location": " Auckland City, Auckland ", "company": " Pineapple Recruitment ", "type": " Full time ", "duration": " Contract "},
{"title": " DevOps Engineer ", "description": ["Description", "We are looking for a DevOps Engineer - Group ICT to join and become part of our One Winning Team! ", "\n", "Full-time.", "Based in Auckland.", "Work on innovative projects within a supportive team environment.", "What you’ll do\nReporting to the Cloud Manager, you’ll be responsible for ongoing support and development of the cloud and hybrid environment to ensure that the services are delivered to business needs and to ensure that KiwiRail is meeting security and compliance requirements.", "\n", "Key Responsibilities include:", "\n", "Maintain documentation on services to ensure robust knowledge base for cloud and hybrid environments.", "Troubleshoot issues and proactively report and remediate problems before they become incidents, escalating to team manager where required.", "Analyse and report on cost of services, identifying opportunities for optimisation of service costs.", "In collaboration with Cloud, Networks, Wintel & OT team, provide 24/7 support incident management for cloud, networks, and OT when and where required.", "Actively engage with Architects, Security Teams, and Vendors for BAU and project delivery.", "Build into all solutions DR capabilities and ensure they are tried and tested, delivering to the business owners’ expectations.", "Identify and recommend opportunities for process and systems improvement and work with the team and relevant parties to develop and execute improvements.", "What you’ll need\nYou’ll have a Tertiary level qualification in computer science or similar and Azure certification along with 4+ years Azure Cloud experience. You will be an explorer, independent thinker with a can-do attitude.\nIn addition, you will have:\nEssential Cloud Skills", "\n", "Experience with Azure DevOps Pipelines", "Proficiency in managing Azure CDN, particularly Front Door and Application Gateway, for content delivery and load balancing.", "Expertise in managing Azure Virtual Machines for hosting applications and services.", "Experience in Certificate Management for secure communication within Azure environments.", "Understanding of Azure Virtual Network for network isolation and segmentation.", "Experience in Conditional access policies and AAD Features.", "Desirable Cloud skills", "\n", "Prior experience in a hybrid cloud environment.", "Experience supporting Infrastructure & Network services in an Enterprise environment.", "Familiarity with Azure Firewall for network security management.", "Knowledge of Azure Kubernetes Service for container orchestration and management.", "Understanding of Intune for managing mobile devices and applications.", "What you’ll get", "\n", "Competitive remuneration.", "Supportive team and environment.", "Flexible working.", "5 weeks annual leave.", "Commitment to continued learning and development.", "Access to discounted travel, health insurance & holiday houses across NZ. as part of our Staff Welfare Trust.", "Why KiwiRail?\nOur people are everything. That’s why KiwiRail is committed to an inclusive, flexible, and supportive workplace where everyone can feel valued, respected, and have equal opportunity to succeed. We encourage applications from people of all ages, genders, sexual orientation, personalities, ethnicities, abilities, and cultures.  \nWe’re going places. Are you? \nApply today! Applications close September 4th, 2024. \nPosition Description", "\n"], "location": " Auckland City, Auckland ", "company": " KiwiRail Ltd ", "type": " Full time ", "duration": " Permanent "},
{"title": " Product Owner - Motors ", "description": ["Description", "The Trade Me Motors teams use world-class approaches to understand our customers, engage our teams and develop high-quality solutions.\nWe're now looking for a Product Owner who shares our vision to achieve great customer and commercial outcomes. To achieve this, they will work closely with teams to prioritise and refine the roadmap and backlog, identify and manage dependencies and maintain the robust health, resilience and stability of our systems.", "\n", "You'll have the best time working at Trade Me, and this is why:\n#Flexible\nFlexible working is the new normal. We have a guideline for our people to be in the office 60% of the time, with the remaining time being flexible. We support you with a home office setup and a utilities allowance to ensure you can work comfortably.\n#Wellness\nBeing your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way.\n#Leave\nWe support you with leave when you need it, including 5 days wellness leave and 10 days sick leave from day 1.\n#Social\nNothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company paid lunches. regular Friday drinks and nibbles, annual Trade Me company awards, celebrations and more.\n#Learning\nWhether it's on the job, formal training, mentoring or something else, you’ll grow with us from Day 1.", "\n", "Here's what you can expect from the role:", "\n", "Strike the balance between value, viability, feasibility and usability and be accountable for the short-term roadmap and committed outcomes of the product’s delivery", "Create, refine and maintain and robust, adequately resourced Epic backlog", "Lead release change management including customer adoption/rollout planning and both internal and external engagement and communication around the change", "Be a strong advocate for the customers and our products ", "Keep everyone informed and aligned ", "Adhere to agile principles", "What you will bring to our team:", "\n", "3+ years experience leading Product Engineering teams to deliver great outcomes, good understanding of product, design & engineering practices with knowledge of web & mobile technologies", "A proven track record of successfully developing flexible value driven product roadmaps to clarify where we are going, taking ownership of outcomes and delivering measurable results", "Experience with opportunity definition and discovery, goal-oriented product roadmaps and using outcome based metrics to measure the impact of change", "Experience working in technical roles within product driven software development teams within a complex and fast paced environment", "You're an outstanding communicator - able to explain ideas simply & clearly, listen carefully to others, and communicate across a wide audience", "You're highly organised and result oriented with strong planning and facilitation skills", "Experienced in leading technical teams within an agile environment with an excellent understanding of agile ways of working & engineering practices", "You are confident using collaborative tools to clarify work scope, sizing, trade offs, dependencies and other planning considerations. (eg. Miro, LucidChart, Jira)", "We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'. If you’re excited about this opportunity, we'd still really like to hear from you.", "\n", "At Trade Me, we're about connecting Kiwis to create the life they want. Whether it’s the big things like finding a home, a job, a car or growing their business, or the smaller things, like finding that right bedside table or parting ways with some old stuff. At Trade Me our vision is to be the place where Kiwi's look first.", "\n", "Trade Me is an INZ accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "\n"], "location": " Auckland City, Auckland ", "company": " Trade Me ", "type": " Full time ", "duration": " Permanent "},
{"title": " Senior Full Stack Developer ", "description": ["Description", "My client is looking for a permanent Senior Full Stack Developer. In this role you will use agile methodology to develop, implement, deploy, and support modern software solutions with modern practices including Domain Driven Microservices, Feature Flagging and Continuous Integration and Delivery.", "\n", "As a cross-functional squad member, you will collectively own your product and can be involved in all aspects of the design, creation, testing and maintenance of the product as well as providing fail and fix application support. The squads are agile, impactful and collaborate and work effectively and efficiently thanks to the strong focus on team culture, professional development, and continuous improvement.", "\n", "In addition to the above, you will have the ability to contribute to technical discussions and with your robust coding and digital development skills. You will commit to promoting the culture of collaboration with both your squad members, your work leads, architects, and our key stakeholders during Programme Increment (PI) planning and during the creation of iteration plans, team PI objectives, release, release planning and product backlog. Helping you to achieve this will be your effective communication skills which will see you influence others in the programme and build a strong consensus behind your ideas and commitments.", "\n", "Skills & Experience:", "\n", "If the above role sounds appealing and you feel you have knowledge of a range of software development skills including the following: ", "\n", "Full stack development with experience in modern development methods ", "ReactJS and Typescript or similar ", "Kotlin or Java and Spring Boot or similar ", "Building web applications and APIs using design standards, patterns, and best practices (e.g., REST, OpenAPI) ", "Source control using git and GitHub", "With some of the following skills being advantageous:", "\n", "Experience in common tool chain elements such GitHub Actions ", "Experience using AWS CDK or CloudFormation ", "Containerisation using Docker  ", "Enterprise development including domain modelling and microservices ", "Playwright to create E2E testing  ", "Storybook testing ", "Spatial skills e.g. GeoServer", " ", "\n", "Note: You must have the legal right to work in New Zealand and be physically present in the country. Overseas applicants will not be considered.", "\n", "Get in touch today and send your CV to:", "\n", "mailto:Dylan.Campbell@beyond.co.nz\n02102339067", "\n", "Job number #128309", "\n"], "location": " Wellington, Wellington ", "company": " Beyond Recruitment ", "type": " Full time ", "duration": " Permanent "},
{"title": " Product Owner - Motors ", "description": ["Description", "The Trade Me Motors teams use world-class approaches to understand our customers, engage our teams and develop high-quality solutions.\nWe're now looking for a Product Owner who shares our vision to achieve great customer and commercial outcomes. To achieve this, they will work closely with teams to prioritise and refine the roadmap and backlog, identify and manage dependencies and maintain the robust health, resilience and stability of our systems.", "\n", "You'll have the best time working at Trade Me, and this is why:\n#Flexible\nFlexible working is the new normal. We have a guideline for our people to be in the office 60% of the time, with the remaining time being flexible. We support you with a home office setup and a utilities allowance to ensure you can work comfortably.\n#Wellness\nBeing your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way.\n#Leave\nWe support you with leave when you need it, including 5 days wellness leave and 10 days sick leave from day 1.\n#Social\nNothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company paid lunches. regular Friday drinks and nibbles, annual Trade Me company awards, celebrations and more.\n#Learning\nWhether it's on the job, formal training, mentoring or something else, you’ll grow with us from Day 1.", "\n", "Here's what you can expect from the role:", "\n", "Strike the balance between value, viability, feasibility and usability and be accountable for the short-term roadmap and committed outcomes of the product’s delivery", "Create, refine and maintain and robust, adequately resourced Epic backlog", "Lead release change management including customer adoption/rollout planning and both internal and external engagement and communication around the change", "Be a strong advocate for the customers and our products ", "Keep everyone informed and aligned ", "Adhere to agile principles", "What you will bring to our team:", "\n", "3+ years experience leading Product Engineering teams to deliver great outcomes, good understanding of product, design & engineering practices with knowledge of web & mobile technologies", "A proven track record of successfully developing flexible value driven product roadmaps to clarify where we are going, taking ownership of outcomes and delivering measurable results", "Experience with opportunity definition and discovery, goal-oriented product roadmaps and using outcome based metrics to measure the impact of change", "Experience working in technical roles within product driven software development teams within a complex and fast paced environment", "You're an outstanding communicator - able to explain ideas simply & clearly, listen carefully to others, and communicate across a wide audience", "You're highly organised and result oriented with strong planning and facilitation skills", "Experienced in leading technical teams within an agile environment with an excellent understanding of agile ways of working & engineering practices", "You are confident using collaborative tools to clarify work scope, sizing, trade offs, dependencies and other planning considerations. (eg. Miro, LucidChart, Jira)", "We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'. If you’re excited about this opportunity, we'd still really like to hear from you.", "\n", "At Trade Me, we're about connecting Kiwis to create the life they want. Whether it’s the big things like finding a home, a job, a car or growing their business, or the smaller things, like finding that right bedside table or parting ways with some old stuff. At Trade Me our vision is to be the place where Kiwi's look first.", "\n", "Trade Me is an INZ accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "\n"], "location": " Wellington, Wellington ", "company": " Trade Me ", "type": " Full time ", "duration": " Permanent "},
{"title": " Product Owner - Motors ", "description": ["Description", "The Trade Me Motors teams use world-class approaches to understand our customers, engage our teams and develop high-quality solutions.\nWe're now looking for a Product Owner who shares our vision to achieve great customer and commercial outcomes. To achieve this, they will work closely with teams to prioritise and refine the roadmap and backlog, identify and manage dependencies and maintain the robust health, resilience and stability of our systems.", "\n", "You'll have the best time working at Trade Me, and this is why:\n#Flexible\nFlexible working is the new normal. We have a guideline for our people to be in the office 60% of the time, with the remaining time being flexible. We support you with a home office setup and a utilities allowance to ensure you can work comfortably.\n#Wellness\nBeing your best self means caring for your physical and mental wellbeing, we offer lots of resources to help you along the way.\n#Leave\nWe support you with leave when you need it, including 5 days wellness leave and 10 days sick leave from day 1.\n#Social\nNothing beats getting together to have some fun and celebrate our success. Join us in the office on payday for company paid lunches. regular Friday drinks and nibbles, annual Trade Me company awards, celebrations and more.\n#Learning\nWhether it's on the job, formal training, mentoring or something else, you’ll grow with us from Day 1.", "\n", "Here's what you can expect from the role:", "\n", "Strike the balance between value, viability, feasibility and usability and be accountable for the short-term roadmap and committed outcomes of the product’s delivery", "Create, refine and maintain and robust, adequately resourced Epic backlog", "Lead release change management including customer adoption/rollout planning and both internal and external engagement and communication around the change", "Be a strong advocate for the customers and our products ", "Keep everyone informed and aligned ", "Adhere to agile principles", "What you will bring to our team:", "\n", "3+ years experience leading Product Engineering teams to deliver great outcomes, good understanding of product, design & engineering practices with knowledge of web & mobile technologies", "A proven track record of successfully developing flexible value driven product roadmaps to clarify where we are going, taking ownership of outcomes and delivering measurable results", "Experience with opportunity definition and discovery, goal-oriented product roadmaps and using outcome based metrics to measure the impact of change", "Experience working in technical roles within product driven software development teams within a complex and fast paced environment", "You're an outstanding communicator - able to explain ideas simply & clearly, listen carefully to others, and communicate across a wide audience", "You're highly organised and result oriented with strong planning and facilitation skills", "Experienced in leading technical teams within an agile environment with an excellent understanding of agile ways of working & engineering practices", "You are confident using collaborative tools to clarify work scope, sizing, trade offs, dependencies and other planning considerations. (eg. Miro, LucidChart, Jira)", "We know some candidates can be reluctant to apply for roles if they feel they don't 'tick all the boxes'. If you’re excited about this opportunity, we'd still really like to hear from you.", "\n", "At Trade Me, we're about connecting Kiwis to create the life they want. Whether it’s the big things like finding a home, a job, a car or growing their business, or the smaller things, like finding that right bedside table or parting ways with some old stuff. At Trade Me our vision is to be the place where Kiwi's look first.", "\n", "Trade Me is an INZ accredited employer. We truly value diversity and embrace a flexible workplace where people are encouraged to achieve their potential.", "\n"], "location": " Christchurch City, Canterbury ", "company": " Trade Me ", "type": " Full time ", "duration": " Permanent "},
{"title": " CONTRACT Full Stack Developer (Python / SaaS) ", "description": ["Description", "CONTRACT Full Stack Developer? Solid backend experience in Python? Django?", "12 month Contract role? WFH in NZ? Work on SaaS platform build?", "Supportive team, interesting project get in touch with Paul :-)", "A new contract role has just come live with an exciting global client looking for a CONTRACT Full Stack Developer to work on a SaaS platform build :-)", "\n", "Solid Python backend experience? Ideally Django? Bonus if you have Angular or JavaScript/Typescript experience :-)", "\n", "What you'll bring:", "\n", "BSc or BEng or similar or not", "At least 2 years full stack experience creating features & functionality writing code in Python (Django) with JavaScript and/or TypeScript", "2 years+ Angular experience ideally or another JS framework (React or Vue etc)", "5 years+ full stack web development experience ", "Happy to work in Python (Django) with Angular", "PostgreSQL", "What you'll get:", "\n", "Good team, flexible / WFH, professional & fun", "Work on an exciting global web platform build for a SaaS product", "12 month WFH / remote contract (ideally Christchurch based but happy to consider remote across NZ)", "An excellent CONTRACT role on an exciting platform build that is WFH across New Zealand contact Paul", "\n", "Please Click Apply now sending your CV & Cover Letter (If you prefer happy to receive short video if you prefer 60-90 secs max / MP4 with 1gb or less) or direct to mailto:paul@sunstonetalent.com", "\n"], "location": " Christchurch City, Canterbury ", "company": " Sunstone Talent ", "type": " Full time ", "duration": " Contract "},
{"title": " Business Analyst ", "description": ["Description", "Our client is currently looking for a Business Analyst to join their team!", "\n", "About you: ", "\n", "Seasoned Business Analyst with a background in crafting Business Cases and driving Transformation Programmes", "Experience across data projects", "Experince with Power BI", "Proficient in process mapping, eliciting requirements, and formulating business cases", "Experience with tools such as Jira, Miro and salesforce is a plus!", "Has worked on delivering in an Agile environment", "Large enterprise experience would be ideal", "If this sounds like you, then APPLY NOW! ", "\n", "Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "\n"], "location": " Hamilton, Waikato ", "company": " Comspek International ", "type": " Full time ", "duration": " Contract "},
{"title": " Information Technology Manager\t ", "description": ["Description", "Nau mai haere mai ki Te Selwyn Foundation | Welcome to The Selwyn Foundation", "\n", "The Selwyn Foundation is an independent registered charity. Our purpose is to enable older people with great need to age respectfully. In this regard, we develop and implement social impact initiatives, as well as providing services to older people and their families at Selwyn Village, Auckland. We have a long track-record of care, having supported of the vulnerable elderly for 70 years.", "\n", "Selwyn Village is one of the largest retirement villages in New Zealand. We employ over 300 staff, provide rest-home, dementia and hospital-level of care for over 170 residents and support over 400 independent living residents. Our Information Technology infrastructure is of critical importance to us to ensure our residents are well cared for and to support our social impact efforts.", "\n", "Mō tēnei tūranga mahi | About this role:", "\n", "The Information Technology Manager will oversee and manage The Selwyn Foundation's information technology infrastructure, systems and support. This role involves coordinating and leading projects, managing a small team of professionals and aligning systems and services to the achievement of our organisational goals.", "\n", "Nga kawenga matua |Key responsibilities:", "\n", "You will be responsible for developing and implementing the IT Strategy. This includes business planning and budget preparation", "Develop and execute plans for improvements, enhancements and innovations to The Foundation's IT functionality, working closely with key stakeholders. This includes identifying and deploying technologies that enhance our internal processes and service delivery", "Ensure our IT infrastructure and systems are optimally scaled to meet the organisation's needs, while maintaining expected service levels and operating within acceptable risk parameters", "Lead stakeholder engagement on projects to ensure business needs and project timeframes are met", "Manage the IT Team, ensuring overall team performance and that responsiveness of IT support, is prompt and to a high standard", "Ensure daily user experience and network stability is achieved", "Build and sustain relationships with technology providers to ensure cost-effectiveness, reliability and security of all systems, services, and infrastructure", "Oversee and manage the IT budget", "He pūkenga tou | Skills & Experience:", "\n", "The successful candidate will have a strong background and proven experience in the management of an IT function. An important aspect of this position is your ability to work with key stakeholders to identify aspects that require improvement and to bring about effective change. You will also have the ability to develop a strong culture within your team, through leading, coaching and developing staff to ensure standards of excellence are achieved. You lead from the front and are prepared to actively participate in tasks, as this role involves both doing and managing a small team to achieve results. Five years or more experience, successfully managing an IT function, is required.", "\n", "Other skills and experience preferred:", "\n", "A degree in computer science or other related qualification", "IT systems and network administration knowledge and experience", "Ability to manage IT projects from end to end", "Knowledge of risk management approaches and countering cyber security threats", "Excellent verbal and written communication", "Team focused, approachable, flexible", "You will be based at our village in Point Chevalier, along with our Information Technology team. You will be required to travel to different sites as required - so you'll need to have a full, clean NZ drivers Licence.", "\n", "If you are a self-starter, driven, and thrive on the challenge of managing your own projects while being part of a great team, then we would love to hear from you.", "\n", "To apply for this job go to: https://selwynfoundation.recruitmenthub.co.nz/Vacancies & enter ref code: 6643379. ", "\n", "Applications close 09 September 2024", "\n"], "location": " Auckland City, Auckland ", "company": " The Selwyn Foundation ", "type": " Full time ", "duration": " Permanent "},
{"title": " Sec Ops Engineer ", "description": ["Description", "SecOps Engineer", "\n", "We are seeking a SecOps Engineer to contribute to the smooth running of Security Operations. \nThis role focuses on strengthening and maintaining the security of their compute platforms and offering environments while also supporting broader systems operations tasks and managing cybersecurity risks.\nExperience operating on a Linux environment will be key to the success of this role", "\n", "Key Responsibilities:", "\n", "Implementation of MS Defender EDR and antivirus software like Nessus specifically for systems infrastructure.", "Collaborate with IT and development teams and external suppliers to address vulnerabilities, applying necessary patches and security enhancements.", "Monitor EDR, security logs and alerts to detect and respond to threats and anomalies promptly.", "Develop and enforce security policies and procedures tailored to their compute environment", "Implement and manage security tools and technologies", "Monitor security logs and alerts, detect and respond to threats", "Conduct risk assessments and threat modeling", "Provide ongoing maintenance and support for servers", "Assist in broader system operations tasks", "Educate team members on security best practices", "Your Profile and Experience:", "\n", "Relevant tertiary qualification in Computer Science or 3-5+ years of relevant experience\n", "Previous hands-on experience using: \n", "Linux-based systems (Debian and Ubuntu)\n", "Automation tools\n", "Database platforms\n", "Virtualization and cloud infrastructure\n", "Applications\n", "Filesystems and storage\n", "Network services\n", "Proficient in managing security protocols, encryption techniques, and network access controls in a Linux environment\n", "Experience with popular Linux distributions (e.g., Ubuntu, CentOS, RedHat) and their respective security tools\n", "Strong understanding of network security, operating system security, and malware analysis\n", "Familiarity with scripting languages (e.g., Bash, Python) for automation\n", "Able to build rapport and credibility with stakeholders\n", "Robust understanding of Linux systems and cybersecurity principles\n", "Strong documentation and communication skills\n", "Excellent problem-solving skills and ability to work under pressure\n", "Certifications such as CISSP or similar will be considered an asset.", "\n", "Kia ora, Comspek and our clients fully support and encourage diverse hiring and inclusive recruitment processes. Don&amp;amp;rsquo;t meet every single requirement of this job description? That&amp;amp;rsquo;s ok - You do not need to tick every box or have expertise in the full JD. Comspek is dedicated to building diverse, inclusive and authentic workplaces based on different clients&amp;amp;rsquo; needs. So, if you&amp;amp;rsquo;re excited about this role, we encourage you to apply.", "\n"], "location": " Wellington, Wellington ", "company": " Comspek International ", "type": " Full time ", "duration": " Permanent "},
{"title": " Customer Service Agent ", "description": ["Description", "Inspire Net is an award-winning internet service provider, based in Palmerston North. \nLocally owned and operated for over 26 years, we pride ourselves on real people and real service.", "\n", "Due to an internal promotion, we’re looking for another enthusiastic customer service agent to come and be part of our highly regarded team. So, if you like solving problems and helping people, a role in our helpdesk could be your calling! As a full-time customer service agent based in Palmerston North you will be responsible for gathering the correct information, troubleshooting and resolving or escalating calls.", "\n", "You will be a customer service superstar, with the ability to: ", "\n", "communicate well with people from all walks of life", "solve problems", "You will have experience in:", "\n", "common operating systems, browsers and mail clients", "knowledge and even a passion for the internet and networking along with a basic understanding of accounts, invoicing and payments.", "Your positive disposition and friendly attitude will ensure you convey technical information to those without a technical background, building confidence and understanding. You’ll have strong customer service skills, a confident phone manner and first-class communication skills (both written and oral), a motivated and positive approach with the focus to make things happen and you’ve previously worked with basic computer programs.", "\n", "As well as a competitive salary, you'll also receive a range of benefits by being part of the Inspire team, along with a positive and supportive work environment.", "\n", "If you’ve read this far, it’s safe to say you’re seriously considering a change.", "\n", "You may be thinking “I could totally do this – but I’m unsure about a career move” – We get it. Stepping into the unknown is tricky. Like, what if we have bad coffee? Let’s connect, and we can share what life is like at Inspire.", "\n", "Other’s might be thinking “This sounds good, but I’m a little light on experience” – That’s okay too! Some of our best agents have been people who had less formal backgrounds and experience, but had plenty of drive and spirit. Ultimately this is a supportive environment, just bring your experience, passion, and energy, and we’ll figure out the rest together.", "\n", "So, are you ready to be part of a company that’s growing and trying to do good in our community? Then please send through your cover letter and CV. \nWe’ll keep any and all communications confidential.", "\n", "Applicants for this position should have NZ Residency or a valid NZ work permit, and be open to a Police background check and drug screening.", "\n", "Applications close Friday 16th August at 6pm.", "\n"], "location": " Palmerston North, Manawatu / Whanganui ", "company": " Inspire Net ", "type": " Full time ", "duration": " Permanent "},
{"title": " AWS Technical Consultant (TAM), ES - NZ ", "description": ["Description", "Join AWS as we invest NZ$7.5 billion in New Zealand over the next 15 years. As an AWS Technical Consultant (Technical Account Manager) you will provide consultative architectural and operational guidance to New Zealand's Independent Software Vendor (ISV) customers to help them achieve the greatest value from AWS.", "\n", "Key job responsibilities", "\n", "You’ll build solutions, provide technical guidance and advocate for the customer\nEnsure AWS environments remain operationally healthy whilst reducing cost and complexity\nDevelop trusting relationships with customers, understanding their business needs and technical challenges\nUsing your technical acumen and customer obsession, you’ll drive technical discussions regarding incidents, trade-offs, and risk management\nConsult with a range of partners from developers through to C-suite executives\nCollaborate with AWS Solutions Architects, Business Developers, Professional Services Consultants, and Sales Account Managers\nWith a bias for action, you'll proactively find opportunities for customers to gain additional value from AWS\nProvide detailed reviews of service disruptions, metrics, detailed prelaunch planning\nBeing part of a wider Enterprise Support team you’ll provide post-sales, consultative expertise\nSolve a variety of problems across different customers as they migrate their workloads to the cloud\nUplift customer capabilities by running workshops, brown bag sessions, etc.", "\n", "As we continue to rapidly expand in NZ, you’ll have plenty of opportunities to develop your technical, consulting and leadership skills. You’ll work with talented cloud technologists whilst expanding your knowledge of AWS products. You’ll also have the chance to receive mentorship and gain AWS certifications.\nA day in the life\nAs a trusted advisor you’ll have a direct impact in helping our customers gain the most value from cloud technology. You’ll craft and execute strategies to drive our customers’ adoption and use of AWS services.", "\n", "Our Technical Account Managers partner with some of the most iconic businesses in the country. These range from rising startups building their business from scratch through to large enterprises going through significant transformation. You’ll provide advice on architecture, support strategy, project, and launch planning as well as ongoing operational issues. Watch a short video about life as a Technical Account Manager team here https://bit.ly/2AivWrM.", "\n", "Basic qualifications\n3+ years of experience in a similar role as a Technical Account Manager, Consultant, Solutions Architect, Cloud Architect, Service Delivery Manager, Platform Engineer, Systems Engineer, etc.\nExpertise in two or more technical domains (e.g. System administration, networking, programming, dev ops, security, compute, storage, databases, big data, analytics, etc.)\nInternal enterprise or external customer-facing experience with the ability to clearly articulate to small and large audiences\nAbility to juggle tasks and projects in a fast-paced environment", "\n", "Preferred qualifications\nProfessional experience with AWS and/or other cloud offerings such as Azure, Google Cloud Platform, etc.\nExperience with presentations and speaking with executives, IT, management, and developers\nExperience working within software development or Internet-related industries\nExperience migrating, transforming or modernising legacy customer solutions to/in the cloud\nExperience working with AWS technologies from a DevOps perspective, including understanding of best practices, tools, CI/CD, etc.\nAble to present to technical and business audiences (training, workshops, publications)\nFamiliarity with ISV customer drivers like Cost to Serve, Customer Acquisition Cost, TAS/TAM, etc.", "\n"], "location": " Auckland City, Auckland ", "company": " Amazon Web Services ", "type": " Full time ", "duration": " Permanent "}
]
