[
{"title": "Test Engineer", "description": "About the Role\nOur Test Engineers are essential to ensuring only the highest quality software products reach our farmers! They are responsible for developing and executing quality assurance and control processes in line with test plans and test cases to verify that software products conform to defined acceptance criteria and behaviours. Test Engineers are central to the selection of testing methodologies and tools and the sharing of these with the agile teams.\nAbout You\nAlong with proven experience in end-to-end system testing, including writing test scripts, you'll be an effective communicator with the ability to train others. You'll have a working knowledge of Lean-Agile practices and automated testing tools.\nOur ideal candidate will have:\n\nMinimum of 2 years of experience in Quality Assurance (QA).\nRelevant tertiary qualification in IT or similar field.\nExperience in at least one programming language for writing and executing test automation scripts (JavaScript, C#, Python, or Java).\nExperience with API testing and tools such as Postman or ReadyAPI.\nExperience with test automation using open-source tools/frameworks, including BDD tools for front-end, middleware, or mobile automation (e.g., Cypress, Playwright, Selenium, Appium).\nFamiliarity with cloud platforms and DevOps tools.\nExperience with test management tools such as Atlassian, Xray, TestRail, or similar.\nUnderstanding of SQL with practical experience working with databases.\nSkilled in writing and executing both manual and automation test cases.\nKnowledge of Agile/Scrum methodologies.\nStrong communication and interpersonal skills.\nCertification in QA (e.g., ISTQB) is a plus.\nexperience in performance or security testing is also a plus\n\nTo be successful at LIC means you'll thrive in a fast-paced, busy environment and you'll be adaptable to change. You'll also enjoy working within a team of dedicated individuals and be able to deliver a professional approach when working with a wide array of customers.\nAbout Us\nAt LIC we value the NZ farming industry and are proud of our successful contribution to this sector. We'll do whatever it takes to support our farmers - our customers are key to how we do business. Our vision is to improve prosperity and the productivity of our farmers, and we want great people to join us on our journey.\nThe Digital Engineering group is responsible for the software development and test functions for our herd management software products and associated back-office systems. The group is also responsible for the Agile practice including scrum mastery, coaching and supporting a Lean-Agile mind-set and best practices across technology.\nHow to Apply\nIf you're after a rewarding and social career with people who embrace our company values of Integrity, Innovation, Spirit of Co-Operation, In-tune and Passion, then we would consider ourselves lucky to welcome you on-board.\nFor more information and to apply, go to our website https://careers.lic.co.nz/home\nJob code: 48613\nApplications Close: 31 October 2024", "location": "Ruakura,", "company": "LIC", "duration": "Full time", "category": "Testing & Quality Assurance (Information & Communication Technology)", "source": "seek", "skills": "NULL", "salary": "NULL", "date": "2024-10-18", "type": "None"},
{"title": "CONTRACT Intermediate Shopify Plus Web Developer (Remote)", "description": "A dynamic company is looking for a CONTRACT Intermediate Shopify Plus Web Developer to work on NEW eCommerce website projects? Love seeing a new Shopify Plus website come to life? Enjoy writing new features & functionality?   Come work for a product company launching new eCommerce websites?   What you’ll bring:  BEng or BSc or BA or tertiary degree or not  3 years+ experience of developing Shopify Plus ecommerce web solutions  Experience of developing in HTML, CSS, JavaScript & Liquid Experience with Shopify Plus apps and API integrations  Knowledge of SEO best practices for eCommerce  Optimise site performance and user experience Troubleshoot and resolve technical issues related to Shopify Plus Collaborate with cross-functional teams to align web development with business goals Excellent problem-solving skills and attention to detail  Good collaborative team player  What you’ll get:  Market hourly rate for 6-12 month contract (lots of work so likely to roll on) Work on two fresh Shopify plus ecommerce launches  Modern offices role is based in Christchurch + Free parking + flexible / remote working Opportunities for professional growth and development  Must have right to work in NZ  Happy to consider remote for a well qualified candidate and flexible hours ie 3-5 days per week (24-40 hours or similar)  Come join a great bunch of humans working on NEW eCommerce projects in a friendly, supportive team :-) Please Click Apply now sending your CV & Cover Letter (If you prefer happy to receive short video 60-90 secs max / MP4 with 1gb or less) or direct to [email protected]", "location": "Christchurch", "company": "Sunstone Talent", "duration": "Contract/Temp", "category": "web design", "source": "seek", "skills": "[{\"name\": \"shopify plus\", \"type\": \"platform\"}, {\"name\": \"html\", \"type\": \"language\"}, {\"name\": \"css\", \"type\": \"language\"}, {\"name\": \"javascript\", \"type\": \"language\"}, {\"name\": \"liquid\", \"type\": \"language\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "Network Consulting Lead", "description": "We are a highly regarded, New Zealand owned technology company. We offer a creative and stimulating work environment and we value and respect inclusivity and diversity.  About this role | Mō tēnei tūranga mahi We are expanding and looking for a seasoned network security professional to join our talented Network and Security Consultancy team. Our team provides technical network and network security engineering services to Theta’s customers – architecting, implementing and providing operational support to ensure the functionality, availability, and security of our customers ICT networking systems, infrastructure, data, and communications.  In this pivotal role, you'll leverage your deep understanding of network and firewall infrastructure (both on premises and in the cloud) to drive innovative solutions and deliver exceptional service. As a Lead Consultant, a key component to the role includes architecting and building quality solutions that can be delivered to our customers. Your interpersonal skills will be crucial as you collaborate with both customers and internal teams to diagnose and resolve technical problems as they arise.  You will work closely with our Relationship Managers and the Sales team, assisting in a presales capacity and support them with customer visits, proposals and statements of work.  You’ll also act as a liaison with vendors and 3rd parties, providing sales and procurement support.  Skills and experience | Ngā pūkenga me ngā wheako   We are looking for someone who has the following:  10+ years skills and expertise in Networking Security - architecture, design and implementation.   Current professional or industry certifications.  Relevant commercial experience in areas including:    Network implementation and operational support.      Cloud and on-premises network solutions including public cloud, private cloud, and hybrid environments.    Network security implementation and support.    3rd level network support and troubleshooting.    Demonstrable, strong technical experience with products including Palo Alto Networks, Juniper and Cisco essential (Fortinet, HP and Extreme advantageous).  Excellent skills in supporting sales and business development with strong industry and customer contacts.  Excellent relationship development and relationship management skills.  Excellent customer service focus.  Innovative, forward thinking – able to conceive and deliver better ways of doing business for customers and Theta.  Excellent analytical and problem-solving abilities.  Proven experience with the delivery of high-quality solutions according to set timelines and budgets are essential.  You will work at least three days a week in the office - our offices are located in Auckland, Tauranga, Wellington and Christchurch. You are available to travel occasionally and there may be an element of out of hours work from time to time. About us | Mō mātou We have over 25 years of experience as a New Zealand-owned technology consultancy. We take pride in our multicultural and diverse team of 300+ skilled professionals. Our offices are in Auckland, Tauranga, Wellington, and Christchurch. Working with clients in both the public and private sectors, we strive to deliver innovative solutions and enable smarter outcomes. Our company attracts some of the brightest minds in the industry, as we foster a culture of excellence and continuous learning.  Our values are:  Our people are our greatest asset.  We conduct business ethically.  Invention, imagination and creativity are the foundation for growth.  We work with positive energy, enjoyment, humour and work/life balance.  Excellence is our passion and we deliver what we promise – or more!  We strive to take a pragmatic approach to all of our activities  We value and appreciate our natural environment and seek to play our part to maintain it  Benefits of working at Theta | Ngā hua ka puta i te mahi ki Theta Theta offers a family friendly work environment with flexible work hours where practical; especially relevant for caregivers. We embrace gender equality and are committed to providing a supportive, diverse and inclusive work environment. Theta is committed to giving back to the community and are avid supporters of Cure Kids. We compete in various adventure races and do many other things to raise money for Cure Kids. And we make time for the fun things in life! We currently provide the following benefits to ensure your professional development and personal wellbeing:  Professional growth and learning opportunities A competitive salary (commensurate with experience) Hybrid working model Fully subsidised medical insurance for employees Heavily discounted medical insurance for immediate family of employees Enhanced parental leave payment – salary top-ups plus return-to-work incentive Volunteer days Internal Referral Incentive Staff Assistance Programme Annual Flu injections Sick leave from your first day on board Remote working options where practical and mutually agreed Daily fresh fruit basket, coffee machine, wide selection of teas and biscuits in all of our offices. We are also an accredited employer with INZ Please note:  Applicants will be required to consent to a Ministry of Justice and Credit Check.We are only able to consider applicants who are currently residing in NZ with relevant visas.", "location": "Wellington", "company": "Theta", "duration": "Full time", "category": "Security", "source": "seek", "skills": "[{\"name\": \"network security\", \"type\": \"methodology\"}, {\"name\": \"network implementation\", \"type\": \"methodology\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"customer service\", \"type\": \"soft skill\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "IT Service Desk Engineer", "description": "We are looking for passionate, experienced Service Desk Engineer who are ready to hit the ground running and play a key role in supporting our critical internal systems. If you're innovative, eager to learn, and thrive in a collaborative environment, this could be the perfect opportunity for you.What You’ll Bring:As a Service Desk Engineer, you’ll work closely with teams across the organization, making excellent communication skills, an agile mindset, and a collaborative spirit essential for success. You'll also have the chance to explore and implement cutting-edge technologies, so a willingness to learn and adapt is key.Technologies You’ll Work With: Microsoft Azure Defender, Darktrace Windows 365 & Azure Virtual Desktop macOS Windows Hello Microsoft Teams (Voice) Cisco Meraki Switches Requirements Excellent communication and customer service abilities. Strong problem-solving skills with a passion for technology. Proven experience in a Service Desk environment, managing support requests and troubleshooting. Ability to work independently and manage your time efficiently. Provide a professional and responsive first point of contact for IT incidents and service requests via phone and email. Prioritize and manage service requests and incidents to ensure a seamless IT experience for end users. Deliver effective Level 1 and Level 2 support for internal software and systems. Familiarity with Windows OS, macOS, Office 365 Suite, Cloud technologies, PowerShell, etc Benefits Onsite gym Flexible working hours with the option to work from home Recently refurbished office space A strong focus on research and development Ongoing training and career development opportunities Access to the latest technologies and industry-leading vendor partnerships Location & Work Hours: East Tamaki, Auckland Hours: 8:30 AM – 5:00 PM If you’re ready to be part of a dynamic, fast-paced team and embrace new challenges, we want to hear from you!", "location": "Auckland", "company": "Vulcan", "duration": "Full time", "category": "Service desk", "source": "seek", "skills": "[{\"name\": \"microsoft azure defender\", \"type\": \"tool\"}, {\"name\": \"darktrace\", \"type\": \"tool\"}, {\"name\": \"windows 365\", \"type\": \"tool\"}, {\"name\": \"azure virtual desktop\", \"type\": \"tool\"}, {\"name\": \"macos\", \"type\": \"platform\"}, {\"name\": \"windows hello\", \"type\": \"tool\"}, {\"name\": \"microsoft teams\", \"type\": \"tool\"}, {\"name\": \"cisco meraki switches\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"customer service\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}, {\"name\": \"time management\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "Senior Data Engineer", "description": "Our client is an award winning company based in New Zealand, with an international presence and providing solutions to millions of users worldwide! With collaboration from multiple teams in the US, UK, etc., this role isn’t just focusing on local growth. You’ll be joining them at a great time as they are expanding rapidly, and will be an essential part of the team’s structure.As a Senior Data Engineer, you’ll be working across the data solutions from building backend data warehouses to transformation and modelling, as they build up major parts of their data stack. You will be a key player in the Data teams as you mentor junior team members and collaborate closely with the data analyst teams and the software engineers to understand the requirements. This is a great opportunity to contribute to a new transformation and data models, and make a lasting impact.What you’ll need to succeed:  In-depth knowledge of SQL and/or other database solutions Proficiency with data warehousing and ETL tools, and environments including AWS and Azure Be able to translate business requirements into conceptual and logical data models Experience working in a variety of data platforms / tools (DBT, knowledge of Google Cloud Platform is a plus) Strong experience working with various local stakeholders to build the requirements  Why Apply:This is your opportunity to make your mark and contribute to a growing organisation internationally! If you are interested to have a discussion, please call Marian at +64 20 4065 7533 or email [email protected]", "location": "Auckland", "company": "RWA People - Connecting IT people with outstanding jobs", "duration": "Full time", "category": "Database Development & Administration", "source": "seek", "skills": "[{\"name\": \"sql\", \"type\": \"database\"}, {\"name\": \"aws\", \"type\": \"platform\"}, {\"name\": \"azure\", \"type\": \"platform\"}, {\"name\": \"dbt\", \"type\": \"tool\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "Full Stack Developer", "description": "Are you a full stack developer passionate about empowering Māori and Indigenous communities in the digital sphere while safeguarding their privacy and data sovereignty? Welcome to Te Hiku Media! At Te Hiku Media, we're at the forefront of transformative projects:Developing a bilingual transcription model: Join us in creating a ground-breaking model for te reo Māori and New Zealand English transcription with the view to include Natural language understanding models. Enhancing te reo Māori accessibility: Contribute to projects that bring te reo Māori to more people through advancements like on-device speech synthesis.Exploring te reo Māori pronunciation: Dive into research on te reo Māori pronunciation and the transmission of sound across generations.Advocating for Indigenous Data Sovereignty: Join our efforts to champion the significance of Indigenous Data Sovereignty.Driving tool adoption: Play a pivotal role in putting our transformative tools into the hands of users, furthering our mission's impact.Te Hiku Media was established in December 1990 by virtue of its Whakapapa and is an organisation committed to the revitalisation of tikanga and te reo Māori. Te Hiku Media is an iwi radio station and digital hub representing the collective rights and Māori language broadcasting interests and is a symbol of courage and tenacity in the recognition of mana Māori Motuhake. Our commitment extends to crafting natural language processing tools for indigenous languages, with te reo Māori taking the lead. In addressing the data complexities of machine learning, we've introduced koreromaori.com—a platform that harnesses crowdsourcing to collect hundreds of hours of spoken language, thus streamlining machine learning through a comprehensive API. Moreover, our efforts encompass a real-time pronunciation tool, aimed at restoring the authentic sounds of te reo Māori and mitigating the influence of colonization and the English language.The roleThis is a fixed term role to support two of the projects Te Hiku Media is undertaking. The first being ‘Leveraging te reo Māori natural language processing for collaborative climate change action’ which is a project that considers the needs of communities around Aotearoa and the impacts of climate change and adverse weather conditions. The second project is ‘Papa Reo - a multilingual language platform’ which aims to use machine learning methods to develop digital tools for te reo Māori, and to support indigenous communities globally in language revitalisation.The successful applicant will be well versed across both front and back-end web application development as well as being knowledgeable about the foundational principles of computer science, user interfaces and user experiences, database architecture, and computational tasks. As you delve into your day-to-day tasks, adaptability and collaboration are crucial. Being flexible, having a solution-based approach and the ability to work both independently and in collaboration with others is essential. A strong sense of self-awareness and a mature approach are essential attributes in this roleQualifications, Skills & Experience:Key Skills and Experience:Bachelor’s degree in Computer Science/Engineering or a related field (or equivalent experience).Knowledge of tikanga Māori and te reo Māori is desirable.Excellent knowledge of front-end web programming languages, such as HTML, CSS, JavaScript, and Vue.js, with the ability to render server-side and client-side content.Excellent knowledge of back-end programming languages, frameworks, and tools like Python, Django, gunicorn, FastAPI, NGINX, and supervisor.Familiarity with common programming design patterns and best practices.Experience with common web deployment tools and services, such as version control software, package managers, and CI/CD pipelines.Excellent written and verbal communication skills.Strong attention to detail and problem-solving skills.Advantageous Skills:Keen knowledge and interest in DevOps and automation.Keen knowledge and interest in mobile application development.It is not necessary that you tick all the boxes, Te Hiku Media encourage a readiness to learn and will provide the necessary kanohi ki te kanohi mentoring.Te Hiku Media operates as a registered charity and cultivates a welcoming work environment that cherishes whānau values, embraces tikanga, and upholds a healthy work-life balance. Our unwavering commitment to data sovereignty and privacy serves as the cornerstone of our endeavours. Diversity thrives at Te Hiku Media, particularly in the STEM field. We encourage applications from Māori, Pasifika, Indigenous, Women, and LGBTQI+ individuals.For more information, please reach out to H2R Technology Whānau, Daniel Wharakura, Katie Millar ([email protected]) or Torban Otway ([email protected]). To apply, follow the link provided.", "location": "Auckland", "company": "Te Hiku Media", "duration": "Full time", "category": "Programming & development", "source": "seek", "skills": "[{\"name\": \"html\", \"type\": \"language\"}, {\"name\": \"css\", \"type\": \"language\"}, {\"name\": \"javascript\", \"type\": \"language\"}, {\"name\": \"vue.js\", \"type\": \"framework\"}, {\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"django\", \"type\": \"framework\"}, {\"name\": \"fastapi\", \"type\": \"framework\"}, {\"name\": \"nginx\", \"type\": \"tool\"}, {\"name\": \"gunicorn\", \"type\": \"tool\"}, {\"name\": \"supervisor\", \"type\": \"tool\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "None", "description": "We're looking for a talented Senior developer experienced with Python programming to help us further develop our innovative in-house software.This is an exciting position for a motivated developer to make a real impact on their IT career by employing a diverse range of technical skills.  Your tasks will vary including working with other staff on requirements and development of an application that delivers information to sales, warehouse, finance and management teams.Our developers work closely with the staff, and owners of this NZ privately owned company with over 400 staff, turning over, $300 million NZ a year.  Full Training will be provided.Skills and experienceA relevant qualification in Software Programming - Bachelors degreeProgramming languages – Python experience is a must have - at least 5 yearsA strong customer and team-oriented focusExperience with modernising software A commitment to continued personal development in IT.Your Role:Helping develop software programs and applications - modernising codeAnalyse existing code, assist with moving to new code, documenting, testing, updating and supportEffectively communicate with the business and technical staffMust be able to plan/prioritize work and report on progressThe ability to work autonomously is important.  You will need to be disciplined, well organised and proactive and must demonstrate a willingness and commitment to do what it takes. This is a full-time permanent position, for a minimum of forty hours per week.  In return, we offer a vibrant, fun working atmosphere, full ongoing product training and the opportunity to excel. We offer 20% discount on food products, Life insurance, Family day and wellness bonus.  If you have a positive attitude and believe you have what it takes to be part of our dynamic team, apply now.", "location": "None", "company": "None", "duration": "None", "category": "Programming & development", "source": "seek", "skills": "[{\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"customer service\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"time management\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 60000, "date": "2024-10-18", "type": "None"},
{"title": "Support Engineer", "description": "About the roleAs a Support Engineer, you will play a key role in our support services team, providing top-notch customer service and technical assistance. Serving as the first point of contact for our global customer base, you'll be responsible for escalating issues when necessary and providing essential hardware, network, and software support. Duties will include:Respond to customer incidents and requests via phone and support ticketsAssist with the deployment and implementation of additional services and projectsManage incidents and service requests following standard processesDeliver basic hardware, network, and software troubleshooting and support BenefitsFlexible Working Policy after a minimum periodFree onsite parking in AvondaleDiscounted Southern Cross health insuranceEmployee referral program of $1500 NZDAccess to INSTEP EAP wellbeing support servicesEarn person airpoints on company travel Skills & ExperienceThis is an excellent opportunity for an engineer eager to gain experience with real-world scenarios in a global company. You will need a process driven approach to work, and be confident with your planning and organisation skills.You will already have the legal right to work in New Zealand, along with  the following:Degree or Diploma qualification in Engineering (Electrical, Mechanical, Mechatronics or similar)PLC coding knowledgeA general knowledge of Networking, especially IP telemetry and Windows server operating systems MS SQL knowledge Experience with conveyor systems (advantageous)Strong analytical and problem-solving skills with high attention to detail About Alstef Group:Alstef Group designs, integrates, and supports automated turnkey solutions for the airport, intralogistics and parcel handling markets. Its mission is to create intelligent solutions that not only meet the needs of its customers, but also provide them with the long-term benefits of a tailor-made automated system that is eco-designed, efficient, scalable and innovative.With a local presence in sixteen countries and a wide range of systems installed across five continents, Alstef Group is a force to be reckoned with in the materials handling industries on a global scale.We offer a promise of excellence for our dedicated 950 employees and a desire to exceed the needs of all our customers; delivering intelligent solutions and providing the long-term benefits of tailormade, automated systems that are efficient, scalable and innovative.How to Apply:Click APPLY to submit your CV and cover letter.", "location": "Avondale,", "company": "Alstef Group", "duration": "Full time", "category": "Service desk", "source": "seek", "skills": "[{\"name\": \"plc coding\", \"type\": \"tool\"}, {\"name\": \"networking\", \"type\": \"platform\"}, {\"name\": \"windows server\", \"type\": \"platform\"}, {\"name\": \"ms sql\", \"type\": \"database\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"organization\", \"type\": \"soft skill\"}, {\"name\": \"planning\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "IT & Technology Services Engineer", "description": "If you like getting hands-on with all kinds of technology across MSP/IT and telecommunications businesses, with every day presenting a new challenge, this is for you!Who and whyVetta Group is an award-winning, end-to-end technology solutions provider. We are the 2022 winners of the South Canterbury Business Excellence Award for Innovation & Technology. We operate multiple IT and telecommunications businesses & brands, providing services and support to businesses of all shapes and sizes throughout New Zealand. We work with customers on a day to day basis to improve their technology usage and experiences through innovative and bespoke solutions, both on-site and cloud.To cater for our growing customer base, we are seeking an individual who can deliver effective IT solutions to small to medium business customers across the country, based out of our Timaru office. We take pride in our ability to offer a prompt and friendly service whilst working in a fun, fast paced, team environment. We are seeking a dynamic individual for our range of IT and internet connectivity-based operations, who is passionate about technology. The successful candidate will have the ability to consult with customers to deliver the best solutions for their needs.Company culture is of great value at Vetta, and therefore this role will suit a genuinely flexible, personable team player. We're after an engineer who can demonstrate talent and passion, is willing to share their expertise with colleagues, and who truly enjoys working in a well organised but fun team environment, while maintaining our simple, key company values:Don't be a jerkGet stuff donePassion over credentialsSet really high standardsKeep ahead of the curveLove what you doTake ownershipPut customers firstA day in the lifeCurious what a day in the life of this role looks like? A normal day looks something like the below:Grab a cup of freshly ground java (don't worry, not the programming language!) while familiarising yourself with the days prioritiesRespond to customer support ticketsAnswer the helpdesk phonesCollaborate with your team mates on curly issuesFinely tune your additions to the Spotify playlistAssist in technical salesAttend site for physical implementations and troubleshootingRead and update Wiki materialGet involved in Slack, provide feedback and ideas on product, marketing, opportunities, or throw your favourite meme into the #random channelListen, identify opportunities and propose solutionsHave fun!We are looking forIdeally will have 2-5 years of practical work experience in a technical environment, however on-the-job training will be provided.It is essential that you have a great attitude and be genuinely passionate about doing things better and more efficiently while constantly seeking improvement. You must be a dynamic & keen technician with excellent organisational and time management skills, and can enthusiastically embrace new technology. Excellent customer service skills are vital in this role where you will support both office based and remote users. You will have the ability to work within a growing team, covering both projects and operational work.Ideally, we are seeking an individual with the following skills:     • MCSE, CompTIAA+ and/or Network+ would be an advantage• Administering business networks and hardware solutions• Microsoft & Apple products and technologies• Mikrotik, Ubiquiti and other vendor networking experience would be an advantage• Cloud solutions including Microsoft 365 and Azure desirable• Advanced skills in latest versions of Windows Server, Exchange & Windows Desktop operating systems• Networking, Routing & Firewalling• Sales or customer facing service experience You will also have the ability to build excellent working relationships externally and internally, and have excellent problem solving and communication skills.We will require you to have a full clean NZ drivers license and existing rights to work in New Zealand.You will be expected to be part of the support team after-hours rotation roster to provide customers with assistance outside of business hours.This is a tremendous opportunity with career development and opportunity for growth within a support network of trained, experienced, professional people.A competitive remuneration package will be tailored based on the applicants' skills, alongside perks included of being a Vetta Group team member.", "location": "Timaru,", "company": "Vetta Group", "duration": "Full time", "category": "Service desk", "source": "seek", "skills": "[{\"name\": \"mcse\", \"type\": \"certification\"}, {\"name\": \"comptia a+\", \"type\": \"certification\"}, {\"name\": \"network+\", \"type\": \"certification\"}, {\"name\": \"microsoft 365\", \"type\": \"platform\"}, {\"name\": \"azure\", \"type\": \"platform\"}, {\"name\": \"windows server\", \"type\": \"tool\"}, {\"name\": \"exchange\", \"type\": \"tool\"}, {\"name\": \"windows desktop\", \"type\": \"tool\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"time management\", \"type\": \"soft skill\"}, {\"name\": \"customer service\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "Senior Business Analyst", "description": "WFH + Flexible working \n\nBeautiful waterfront CBD location \n\nGreat culture and fun team\nWe do things a bit differently here Ando are proud to be a majority-locally owned multi-lines insurance business. We operate as an underwriting agency in partnership with The Hollard Insurance Company Pty Ltd and sell our policies through New Zealand’s leading insurance brokers. At Ando we believe that the fundamental purpose and function of insurance is to help people reduce their losses when bad things happen.  That’s why at Ando we’ve always believed in the importance of treating your insurance as a relationship, not a transaction. And why our purpose is to positively impact the wellbeing of New Zealanders. The role We have an exciting opportunity for an experienced, high-performing Business Analyst with strong analytical and stakeholder engagement capabilities to join the Ando Digital Delivery team. Reporting to the Head of Digital Strategy, you will be working with key business and delivery team stakeholders to enhance the way in which we work, using technology and process improvements to enable smarter ways of working to deliver valued Insurance solutions to our internal teams and external customers.  As a key member of the Distribution business team (Underwriting and Operations), you will build strong, authentic business relationships and a deep business understanding to identify, prioritise and deliver highly valued business solutions that are aligned to Ando’s strategic objectives.  You will be confident in building a strong understanding of business problems and needs, accurately capturing business requirements that are understandable to business users and usable by delivery teams.  Using your well-developed business analysis skills, combined with your ability to communicate with business users and technology team members, you will enable and support continuous business improvement both in practical deliveries and business mindsets.  In addition to strong communication and process improvement skills, you will have project experience working in the insurance sector (either for an insurance company or in a broker environment). Responsibilities \nEstablish and maintain credible and trusted inter-personal relationships with key stakeholders. \n\nIdentify areas for improvement in line with Ando Business and Digital Strategies. \n\nWorking within business teams to understand current processes and define new ways of working (future state). \n\nLead the elicitation of business requirements and undertake options and scenario analysis of the impact of design decisions.  \n\nConstructively evaluate business requirements to guide users on solutions considering both process change and technology enablers. \n\nAssist in change management activities through leading and supporting change principles.  \n\nDeliver measurable benefits and improved outcomes for Ando customers and/ or internal teams. \n\nHelp drive a culture of continuous improvement.\nQualifications and experience \n8+ years’ experience as a Business Analyst or experience in a similar role. \n\nExperience working in the insurance industry. \n\nAccreditation in Business Process Analysis (or similar). \n\nWorkshop facilitation – preparation, leading, collating and summarising outcomes. \n\nRequirements gathering – analytical, critical thinker, root course analysis. \n\nProcess & data modelling - Proficient in BPM tools e.g. Visio, Lucidcharts, etc. \n\nAgile SCRUM team experience.  \n\nEpic, Feature & User Story writing - proficiency using Jira. \n\nStrong stakeholder engagement and management skills.  \n\nStrongly articulate communicator that can adjust for audiences (verbal and written). \n\nStrong MS Office skills, especially Excel, and Word.\nWant to surround yourself with great people? We’re proud that we’re a bit different from regular insurance companies – knowing it’s our people and their relationships who make that difference. We know when to work hard, be focused and smart, but we also never underestimate the importance of the human connections that make us tick and get along together.  Jump in! So when you put a group of people together who all share that thought, you get a truly inclusive, supportive culture and a special group of people. If that sounds like something you’d like to be part of, then Jump In!", "location": "Auckland", "company": "Ando", "duration": "Full time", "category": "business & systems analysts", "source": "seek", "skills": "[{\"name\": \"business process analysis\", \"type\": \"certification\"}, {\"name\": \"bpm\", \"type\": \"tool\"}, {\"name\": \"visio\", \"type\": \"tool\"}, {\"name\": \"lucidcharts\", \"type\": \"tool\"}, {\"name\": \"agile\", \"type\": \"methodology\"}, {\"name\": \"scrum\", \"type\": \"framework\"}, {\"name\": \"jira\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"critical thinking\", \"type\": \"soft skill\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "Network Engineers", "description": "This is an opportunity for someone wanting to step into a Senior Network Engineer role or join a customer that has an enterprise network that touches many parts of New ZealandWe seek a candidate who brings some of the following experience and skills:  Significant experience in IT Infrastructure management, networking concepts, switching, routing, firewalling and load balancing Strong technical experience in managing and supporting a distributed enterprise network consisting multiple technologies and services An excellent understanding of the operational requirements of a complex, multi-vendor, multifaceted production environment Expert knowledge of Cisco Networks and Juniper Firewalls Strong appreciation of formal IT disciplines, methodologies and techniques including change management and service level management Strong experience in management, configuration and upgrading of routers, switches and VPN gateways.   For more info drop Nathan a note - [email protected] or apply online", "location": "Wellington", "company": "Taska360", "duration": "Full time", "category": "Networking & storage", "source": "seek", "skills": "[{\"name\": \"networking\", \"type\": \"methodology\"}, {\"name\": \"change management\", \"type\": \"methodology\"}, {\"name\": \"service level management\", \"type\": \"methodology\"}, {\"name\": \"cisco networks\", \"type\": \"platform\"}, {\"name\": \"juniper firewalls\", \"type\": \"tool\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "Technical Product Support - Smart Farming", "description": "About DatamarsDatamars is a Global company, with a strong reputation for research and development-based innovations in the agricultural, textile and animal tracking sectors.  Datamars ANZ works alongside farmers to develop award-winning innovative farming technologies that stand the test of time. Our globally recognised family of product brands, including Tru-Test, Zee Tags, Speedrite, Prattley and NJ Phillips, allows us to offer a comprehensive range of integrated products and smart farming solutions.   At Datamars we believe in doing excellent work with passion.An insight to the roleWorking in our small, friendly Customer Success Team, this role involves working with our customers and partners locally and globally, to diagnose and resolve hardware and software issues related to our farming product range, including smart farming technologies.  This is a 24-hour 7 day per week operation, in conjunction with our Customer Success team based in Ireland .  A full induction and product training will be provided. To be successful in this role you will bringan Agricultural background/farming experience or degree with a focus on Dairy farming is an advantage.2 years experience in a customer support or technical support rolea proven track record of problem solving and trouble shooting experiencestrong attention to detail, with problem solving and organisational skills excellent written and verbal communication skills, professional and friendly phone manner“can do” attitude and a strong ability to multi-task in a fast-paced environmentthe ability to work equally well under supervision and on your own initiative ability to work in a flexible manner and adapt to changing environmentthe ability to prioritise your workload.the capacity to clearly explain a technical problem to a customer / colleagueexperience with software such as Salesforce, Jira, Confluence, Microsoft 365, Dialpad advantageousProficiency in SQL, VBA or Python is an advantage.BenefitsBase salary + Kiwi Saver ContributionsEnjoy a paid day off on your birthday each yearEmployee Assistance Programme Reward & Recognition Program across AustralasiaGlobal secondment opportunities for those interested in international experiencesPlease apply online and for further insight into our business, products and innovations visitwww.livestock.datamars.com and www.datamars.com and follow us on LinkedIn https://www.linkedin.com/company/datamars-sa", "location": "Christchurch", "company": "Datamars Ltd", "duration": "Full time", "category": "Service desk", "source": "seek", "skills": "[{\"name\": \"customer service\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}, {\"name\": \"sql\", \"type\": \"language\"}, {\"name\": \"vba\", \"type\": \"language\"}, {\"name\": \"python\", \"type\": \"language\"}, {\"name\": \"salesforce\", \"type\": \"tool\"}, {\"name\": \"jira\", \"type\": \"tool\"}, {\"name\": \"confluence\", \"type\": \"tool\"}, {\"name\": \"microsoft 365\", \"type\": \"tool\"}, {\"name\": \"dialpad\", \"type\": \"tool\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "IT Specialist", "description": "We are a New Zealand operated National company with a significant presence in the New Zealand Wool Industry. We operate world standard production facilities at Timaru in South Canterbury and Napier in Hawkes Bay. These operate 24 hours per day, 7 days per week and are operational continuously for the full year.Our busy team plays an important role in ensuring the smooth processing of product, and is part of how we accomplish high quality and great results for our clients. To enable us to continue delivering excellence, we are on the lookout for a standout IT Specialist to join our Support Team.This is a stand-alone role and those that can demonstrate ability to develop, manage networks and troubleshoot IT problems should apply.  A focus on IT support is essential, and this role requires at least two years experience in a relevant position. The role is a sole charge position, reporting directly to the Executive Team.  Location, Napier, New Zealand.  Regular travel to Timaru will also be required. Objectives of the role:Deep dive into a complete and thorough understanding the current system – expected in the first three months;Work closely with the executive team to develop a long-term plan taking into account all the business needs, both future and current;Formulate a comprehensive plan of proposed change with milestone goals, timings and associated KPI’s;Provide key management reporting to ensure target progress, transparency and outcome achievement;Key requirements include:Bachelor's degree in a relevant field;Knowledge of the software development life-cycle;The desire to work in a fast-paced environment;Ability to develop unit testing of code components or complete applications;Must understand the concepts of software engineering;Must be able to develop and adapt bespoke software for individual and unique applications;Experience working on a variety of software development projects;Deep programming language knowledge;Research and evaluate emerging technologies, hardware, and software;Your remuneration will be somewhere between $90,000 – 110,000 depending on your qualifications and experience. This will be negotiated individually with the successful candidate and we will indicate this early in our process.If you are hard-working, committed to quality and keen to work within a team of highly motivated passionate people where your abilities will be recognized and contribution rewarded, please apply to: [email protected], mention in the subject line IT Specialist.If this sounds like you, we’re keen to hear how you can add value to our business. Send us your CV, plus a quick note why you think you’re the one for us.Applicants for this position should have NZ residency and must have a clear criminal record. All contact is via email [email protected]", "location": "Napier", "company": "Employment Relations HB", "duration": "Full time", "category": "Other", "source": "seek", "skills": "[{\"name\": \"software development life cycle\", \"type\": \"methodology\"}, {\"name\": \"software engineering\", \"type\": \"methodology\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}]", "salary": 110000, "date": "2024-10-18", "type": "None"},
{"title": "None", "description": "Who we are: -HCL Technologies is a global transformational enterprise with significant presence in Australia and New Zealand. Our offices in Sydney, Melbourne, Brisbane, Auckland and Wellington offers an integrated portfolio of services including software-led IT solutions, remote infrastructure management, engineering and R&D services and BPO by leveraging its extensive global offshore infrastructure that impact and redefine the core of our clients' business. For more information, please visit us at www.hcltech.com. We are HCLTech, one of the fastest-growing large tech companies in the world and home to 219,000+ people across 54 countries, supercharging progress through industry-leading capabilities centered around Digital, Engineering and Cloud.We are looking for an experienced Solution Architect SAP FICO Professionals in NZLocation – Auckland, New ZealandMode of employment: Full-Time onlyJob Role DescriptionThe Solutions Architect will be part of SAP ECC FICO, CFIN and FSCM team working with set of Business SMEs, Business Analyst, SDMs/Business IT managers and Technical/Functional SMEs to ensure that the project is delivered on-time with highest quality and/or with minimum supervision.The role demands someone who owns at least 4-5 ends-to-end complex implementations, rollouts, Support/BAU & delivery engagements assisting customers on their transformation journey from ECC to S4 hana.A significant component of the role is to comprehend the system both from a business requirement as well as technical solution point of view.  The role demands outstanding analytical and problem-solving skills and requires the capability to think swiftly and productively as well as making decisions / recommendations to business team and stakeholders/clients.Major Accountabilities Will be responsible for the end-to-end delivery of the following functions to the Project team, Upgrade & BAU space in SAP FICO, CFIN and FSCM. At least, 4-5 end-to-end implementation experiences in ECC FICO/CFIN/FSCM.Must be a Subject Matter Expert (SME) in SAP FICO/CFIN/FSCM.Systematic understanding of Agile Practices and Agile Methodology; in-depth knowledge and practical experience of SAP Activate and ASAP project management methodology as well as SAP Rapid Deployment Solutions (RDS), Best Practices, and on legislative requirements.  Strong business process understanding from start to finish to deliver the projects in SAP is a must.Solution and architectural experienced and managed by own the projects in ECC SAP FICO/CFIN/FSCM.  Focusing on engaging at the most senior client levels, verifying business need, and subsequently proposing the high-level solution.Experience to lead and build team.Experience in managing and delivering projects (implementation), rollout, transformation, and enhancements.Key focus in Design thinking (Reusable solutions), Technical developments, Delivery Management, Solution Designing, Reporting, Integration and Process improvements.Experience in Implementation & rollouts comprise of Designing, Build, Unit Testing, and Integration Testing & post Go-live Support.Expert in gathering requirements from clients and solutioning and delivery.Expert in configuration, unit test, integrated testing, user testing & support in the areas of SAP FICO/CFIN/FSCMWork and collaborate with integration teams to develop, refine, and implement client development strategies, ensuring alignment with the needs, requirements, vision, and objectives of the client.Identify and resolve system performance issues.Configuration & then execution of various test scenarios across modules like SAP ECC Modules of SD, MM, PM, PS, BW, BPC, MDG etc.Why HCLWe are one of the fastest-growing large tech companies in the world, with offices in 50+ countries across the globe and 219,000 employeesOur company is extremely diverse with 165 nationalities represented.We offer the opportunity to work with colleagues across the globe.We offer a virtual-first work environment, promoting a good work-life integration and real flexibility.We offer comprehensive benefits for all employees.We are a certified great place to work and a top employer in 17 countries, offering a positive work environment that values employee recognition and respect.How to apply:To apply for this role, you should have a full work right to work in New Zealand. press to \"Apply now \" button to submit your resume.HCL's enlightened approach to employee development focus on giving people whatever they need to succeed: be it a virtual assistant or talent transformation sabbaticals; expert guidance or fast track growth; inner peace or democratic empowerment.Candidate Data Privacy Notice | HCL Technologies", "location": "None", "company": "None", "duration": "None", "category": "Other", "source": "seek", "skills": "[{\"name\": \"sap fico\", \"type\": \"platform\"}, {\"name\": \"sap cfin\", \"type\": \"platform\"}, {\"name\": \"sap fscm\", \"type\": \"platform\"}, {\"name\": \"agile\", \"type\": \"methodology\"}, {\"name\": \"sap activate\", \"type\": \"framework\"}, {\"name\": \"asap\", \"type\": \"methodology\"}, {\"name\": \"design thinking\", \"type\": \"methodology\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"leadership\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "Contract Software Engineer - C#, React, AWS", "description": "Contract Full Stack Engineers (Auckland)Join one of the leading software consulting organizations, known for their strong background in bespoke Software Engineering practices. As part of a high-performing team, you’ll work on complex, award-winning, and market-leading projects making an impact on users around the world. - Auckland-based, flexible hybrid model, must have the ability to work onsite with teams, approx 2 days p/w.- Immediate start- 6-month contract term with extensionsWe are looking for Full Stack Engineers to join our client’s team due to recent growth. You’ll collaborate with cross-functional teams to deliver the next age in SaaS product development and customer-focused projects. We're looking for proven skills with below- Frontend - React.js, Javascript, Typescript,- Backend, C# .NET, SQL- REST API design and development- Some experience with AWS (or Azure), CI/CD pipelines & containers (TeamCity, Docker, Kubernetes)- Testing - Unit, some experience with Test-driven development, E2E would be ideal.Effective communication, documentation, and teamwork skills are essential as you'll work with a tight-knit team based in Auckland and across NZ.If you’re ready for your next challenge, apply now!You must be eligible to work in NZ to be successful in your application. For more info [email protected] is best.", "location": "Auckland", "company": "Archway Recruitment", "duration": "Contract/Temp", "category": "Programming & development", "source": "seek", "skills": "[{\"name\": \"react.js\", \"type\": \"framework\"}, {\"name\": \"javascript\", \"type\": \"language\"}, {\"name\": \"typescript\", \"type\": \"language\"}, {\"name\": \"c#\", \"type\": \"language\"}, {\"name\": \".net\", \"type\": \"framework\"}, {\"name\": \"sql\", \"type\": \"database\"}, {\"name\": \"rest api\", \"type\": \"protocol\"}, {\"name\": \"aws\", \"type\": \"platform\"}, {\"name\": \"azure\", \"type\": \"platform\"}, {\"name\": \"teamcity\", \"type\": \"tool\"}, {\"name\": \"docker\", \"type\": \"tool\"}, {\"name\": \"kubernetes\", \"type\": \"tool\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "Graduate Opportunity in Cloud Computing", "description": "What Are You Looking For?       An exceptional, well-established and very successful entry-level graduate training programmeFantastic opportunity to join the brightest young team you could ever wish to work with in the exciting high-growth fields of AI and cloud computingAttractive and strong company culture – family atmosphere, continuous learning, mentored skill development, caring, friendly and welcoming environmentPersonalised career plan with rapid and challenging technical skill developmentBroad range of cloud-based technology training and exposure to security, networking, server and storage infrastructure, OneNet private cloud, Microsoft’s Azure cloud, AWS, implementations of AI within OneNet and client sites, application deployment, managed workstations, systems integration and client supportLeadership development with an opportunity to specialise in any of the above technologies, thus providing a pathway to potential future career roles including CTO, CIO, CCO, CISO, solution architect or network architectExcellent commencing salaryPerformance-based salary growth What Are We Looking For?Recent graduate from a leading NZ universityHigh intellect, evidenced by your academic resultsOutstanding attitude, aptitude, native talent and problem-solving skillsStrong motivation to excel in the information technology industryGood cultural fit within the OneNet teamWill consider any degree major, subject to the above requirementsPrefer engineering, computer science or similar majorNOTE: We are NOT looking for software developers  Who is OneNet?Pioneer and New Zealand market leader in cloud computing and AIClients include large corporates, mid-sized businesses and start-upsAI solutions from www.grizzly.ai, OneNet's sister company, and othersEmployer of choice for exceptional people - see www.glassdoor.co.nzLocated in beautiful offices, right in the heart of Herne BayAmple free parkingLiberal work from home policy   Next StepForward your cv and non-certified academic results to Dr Michael Snowden, CEO, OneNet Limited", "location": "Herne", "company": "OneNet Limited", "duration": "Full time", "category": "Other", "source": "seek", "skills": "[{\"name\": \"ai\", \"type\": \"tool\"}, {\"name\": \"cloud computing\", \"type\": \"platform\"}, {\"name\": \"microsoft azure\", \"type\": \"platform\"}, {\"name\": \"aws\", \"type\": \"platform\"}, {\"name\": \"leadership\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "Regional Deployment Manager", "description": "Regional Deployment Manager\n\tContract Opportunity: 12-Month (Start date early November 2024)\n\tWellington based client\n\nWe have an exciting 12-month contract opportunity for a seasoned Regional Deployment Manager with extensive experience in technical programme management, particularly within large-scale digital transformation projects.\n\nIf you are passionate about leading complex transitions and ensuring seamless delivery, this could be the right role for you.\n\nKey Responsibilities:\n\n\n\tOversee programme and project-level planning, delivery, and testing, with a focus on radio technology transitions.\n\tDevelop and manage transition schedules in line with fleet and device readiness across multiple regions and teams.\n\tBuild flexible frameworks that adapt to changing priorities within a large-scale digital transformation environment.\n\tLead and collaborate with both technical and operational teams, ensuring successful migration to Business-as-Usual (BAU).\n\tAdvocate and communicate confidently with a broad range of stakeholders, including senior executives.\n\nExperience Required:\n\n\n\t5-10 years' experience in programme management, particularly in radio technology transitions and large digital transformation programmes.\n\tProven experience in infrastructure and network project transitions, with a focus on planning and sequencing across multiple teams.\n\tStrong presentation and communication skills with senior stakeholders.\n\tExperience leading technical and operational teams to ensure smooth transitions and successful migration outcomes.\n\nThis role offers a dynamic and challenging environment for a proactive individual with a strategic mindset. If this sounds like the right fit for you, we would love to hear from you!\n\nYou must be in New Zealand with the legal right to work.\n\nRef : 128584\n\nBeyond Recruitment Technology, Transformation & Digital, connecting IT talent with IT opportunities. Visit www.beyond.co.nz for more roles and information.", "location": "Wellington", "company": "Beyond Recruitment - NZ’s best career opportunities – jobs all over Aotearoa", "duration": "Contract/Temp", "category": "project management", "source": "seek", "skills": "[{\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}, {\"name\": \"leadership\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "DevOps Engineer", "description": "Opportunity to have real input and be at the leading edge of change Technologies such as Kubernetes supporting a microservice architecture Make an impact with NZ’s largest grocery distributor  Partner collaboratively with a future focused and innovative IT team  About FoodiesYou know New World, PAK’nSAVE and Four Square right? That’s us! We are one of NZ’s biggest companies, you just don’t know it, because in true Kiwi style – we are humble about it (apart from right now maybe)!  Our Support Centre is 1,000 people strong, which includes 300+ IT employees, who all play a vital role in supporting our network of 330+ stores across the North Island. About the role Foodies is on an awesome journey to become a truly customer insights-driven and efficient Co-op, and one that is digitally enabled.  As a DevOps Engineer you’ll work collaboratively across the business to automate and streamline CI/CD, operations, systems, processes and tooling – ensuring we are best placed to extend and leverage the platforms that underpin our digital initiatives.   You'll be working on a variety of tasks and projects including performance improvements, cost optimisation, application rollouts, CI/CD, security, monitoring, infrastructure upgrades, capacity planning, debugging, and incident response. About you With the core fundamentals of DevOps behind you, you’ll be ready to take on a new opportunity and leverage your skills and knowledge with an innovative and maturing DevSecOps function.  Comfortable in partnering with the business you’ll have a focus on continuous improvement - constantly looking at what’s possible, discovering and building your knowledge on potential solutions. With a focus on automation and innovation, key to your success will also include; Great spread of technology knowledge – AWS, Linux and CI/CD tooling just to start  Networking experience  Security experience and awareness, from conception to implementation and automation  This is a hands-on engineering role where you’ll partner and be involved from day one.  A great opportunity to be a part of a digital operations team working with bleeding edge technologies such as Kubernetes supporting a microservice architecture. We’re not your average IT team – apply today! What's in it for You? In return, we offer a competitive salary package, including fully subsidised health insurance, flexible working arrangements, free parking, participation in the company superannuation fund, birthday leave, and long service leave! Additionally, we provide abundant learning and development opportunities to help drive your career forward.Experience awesome. Achieve Awesome. Be awesomely you.We’re proud to have a focus on Diversity & Inclusion here at Foodies and welcome applications from you all regardless of who you are or what you do. We welcome courageous behaviour, encourage togetherness, inspire our people to be their best selves in our Foodies whānau, but most importantly we celebrate our people - our taonga, every day for being uniquely them.", "location": "Mangere,", "company": "Foodstuffs North Island Ltd", "duration": "Full time", "category": "Other", "source": "seek", "skills": "[{\"name\": \"kubernetes\", \"type\": \"tool\"}, {\"name\": \"aws\", \"type\": \"platform\"}, {\"name\": \"linux\", \"type\": \"platform\"}, {\"name\": \"ci/cd\", \"type\": \"methodology\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "Guidewire Team Lead/ Experienced PolicyCenter Developer", "description": "Location: Hybrid/FlexibleAbout us: At Tenzing (Technology Services), we specialise in delivering cutting-edge technology solutions to the insurance industry. Our Guidewire team is dedicated to innovation and excellence, helping our clients stay ahead in a competitive market. We are currently seeking a talented and experienced Guidewire PolicyCenter Developer to join our team and lead our clients through their transition to Guidewire Cloud. We have a strong long-term pipeline of work and can offer technical and management career pathways.Role Overview: As a Senior Guidewire PC Developer, you will play a pivotal role in our client's journey to migrate their insurance operations to the Guidewire Cloud. Your expertise in Guidewire PolicyCenter and will be essential in ensuring a seamless and efficient transition. You will work closely with our clients, understanding their unique requirements, and delivering customized solutions that drive their success. You will also act as Technical Lead of development team.Key Responsibilities:• Technical lead working with architecture, project management and others to lead the agile team• Lead the migration of the client's insurance operations to the Guidewire Cloud.• Develop, configure, and implement Guidewire Policy Centre solutions to meet client needs.• Knowledge of other Guidewire functionality and Integration• Collaborate with cross-functional teams to gather requirements, design solutions, and implement changes.• Utilise your rating experience to ensure accurate and efficient policy rating processes.• Provide technical guidance and support throughout the project lifecycle.• Troubleshoot and resolve issues related to Guidewire Policy Centre and associated integrations.• Stay updated with the latest Guidewire technologies and industry trends to deliver innovative solutions.Qualifications:• Experience: 5+ years of hands-on experience with Guidewire Policy Centre development.• Guidewire Cloud: Proven experience in migrating to or working with Guidewire Cloud. • Specialised Knowledge  Strong knowledge of some or all of product modelling, rating frameworks, and underwriting• Technical Skills: Proficiency in GOSU, Guidewire configuration, and integration.• Problem-Solving: Excellent analytical and troubleshooting skills.• Communication: Strong verbal and written communication skills to effectively interact with clients and team members.• Team Player: Ability to work collaboratively in a fast-paced, dynamic environment.Why Join Us:• Innovation: Be part of a team that is at the forefront of GW technology in the insurance industry.• Growth: Opportunities for professional development and career advancement.• Flexibility: Hybrid/Flexible work options to suit your lifestyle.• Impact: Make a meaningful impact by helping clients transition to state-of-the-art cloud solutions.• Benefits: Enjoy great benefits like Life & Income Protection Insurance,  Discounted Health Insurance, Phone Plans and the option to purchase  additional annual leave.How to Apply: If you are a skilled Guidewire PC Developer with a passion for cloud migration and rating experience, we want to hear from you! Please submit your CV (and cover letter) via the provided link.", "location": "Wellington", "company": "Tenzing Ltd", "duration": "Full time", "category": "Other", "source": "seek", "skills": "[{\"name\": \"gosu\", \"type\": \"language\"}, {\"name\": \"guidewire policy center\", \"type\": \"tool\"}, {\"name\": \"guidewire cloud\", \"type\": \"platform\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"agile\", \"type\": \"methodology\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "Integration Designer (Contract)", "description": "We are currently seeking an Integration Designer for a 6-12 month contract role for one of our clients. The role can be based in Wellington or Auckland and will be an ongoing program of work.What you will have in your tech-stack:  IBM Datapower; Designing of Datapower applications, XSLT creation, routing of requests, creating domains and groups, proxy creation, logging configuration, creating security profiles Node.js; Experience in building microservices using Node.js frameworks        Familiarity with general DevOps technologies (CI/CD pipelines, Jenkins, OpenShift, Docker, Kubernetes, Splunk, Dynatrace)  If this sounds like your next gig, please get in touch ASAP. We will only consider candidates who have the right to work in NZ. Ideally we would like someone to start within a week or ASAP but can wait on notice periods.", "location": "Wellington", "company": "Socialite Recruitment Ltd.", "duration": "Contract/Temp", "category": "Other", "source": "seek", "skills": "[{\"name\": \"ibm datapower\", \"type\": \"tool\"}, {\"name\": \"xslt\", \"type\": \"language\"}, {\"name\": \"node.js\", \"type\": \"framework\"}, {\"name\": \"devops\", \"type\": \"methodology\"}, {\"name\": \"jenkins\", \"type\": \"tool\"}, {\"name\": \"openshift\", \"type\": \"platform\"}, {\"name\": \"docker\", \"type\": \"tool\"}, {\"name\": \"kubernetes\", \"type\": \"tool\"}, {\"name\": \"splunk\", \"type\": \"tool\"}, {\"name\": \"dynatrace\", \"type\": \"tool\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "Technology Services Compliance & Risk Specialist", "description": "He angitūtanga: The Opportunity  Auckland Council is seeking a highly skilled Risk and Compliance Advisor to join our team. In this critical role, you will ensure that our projects, agile release trains, and operational teams are well-informed about their Risk and Compliance obligations, including relevant Policies and PCI DSS standards. You will play a pivotal role in the continued development of security governance artifacts and facilitate the consistent capture and reporting of risks. Additionally, you will conduct risk assessments to support our Governance, Risk, and Compliance (GRC) function, ensuring that the organization adheres to established Security Policies. Key Responsibilities: Uphold and exemplify the principles of Our Charter, establishing clear expectations for conduct across Auckland Council. Demonstrate Our Behaviours in fostering inclusivity and adaptability in all aspects of work. Advocate for a proactive health and safety culture, adhering to our Health and Safety Policy and Management Framework. Provide expert guidance on compliance obligations, ensuring effective risk recording, mitigation, and reporting processes. Conduct regular compliance audits to identify and report deviations from internal and external obligations. Assist in the development and implementation of the Information Security Strategy, Roadmap, and associated controls. Conduct content searches in response to requests from the LGOIMA and Integrity teams.  He kōrero mōu: About You     Tertiary qualification in Law, Computer Science, Information Technology, or a related field, or extensive relevant business experience. A minimum of 5 years of experience in Information Security, with a focus on compliance and risk management. Proven track record in providing GRC advisory and assurance services to medium to large organizations. Strong thought leadership abilities and a comprehensive understanding of design practices related to Information Security best practices. Excellent interpersonal skills, with the capacity to communicate effectively, build rapport, and influence stakeholders at all levels. Exceptional verbal and written communication skills. Strong business acumen, with the ability to balance pragmatism and risk management effectively. Familiarity with Agile delivery methodologies.    Ngā āhuatanga kei a mātou: What we offer At Auckland Council, we believe that diverse teams are key to driving innovation and achieving great outcomes. We actively support an inclusive and flexible working environment, where every individual's unique contributions are valued. You'll join a dynamic, forward-thinking team working to shape the future of our city.    Competitive salary and benefits package.  Long service leave and ongoing learning opportunities.  Access to a range of discounts and lifestyle perks.  A workplace that fosters diversity and inclusion, creating opportunities for all.    If you're ready to lead with empathy, inspire diverse teams, and make a lasting impact on Auckland's future, apply now! #WorkingforAuckland  Applications Close : Friday 1st November", "location": "Auckland", "company": "Auckland Council", "duration": "Full time", "category": "Other", "source": "seek", "skills": "[{\"name\": \"pci dss\", \"type\": \"protocol\"}, {\"name\": \"governance, risk, and compliance\", \"type\": \"methodology\"}, {\"name\": \"communication\", \"type\": \"soft skill\"}, {\"name\": \"adaptability\", \"type\": \"soft skill\"}, {\"name\": \"problem solving\", \"type\": \"soft skill\"}, {\"name\": \"leadership\", \"type\": \"soft skill\"}, {\"name\": \"teamwork\", \"type\": \"soft skill\"}, {\"name\": \"agile\", \"type\": \"methodology\"}]", "salary": 0, "date": "2024-10-18", "type": "None"},
{"title": "Scrum Master", "description": "He angitūtanga: The Opportunity At Auckland Council, we believe in leading with heart and vision. As Practice Manager - Scrum Masters, you will inspire, guide, and uplift our Scrum Masters, creating a culture where collaboration and inclusivity drive agile success. You'll champion best practices, nurture talent, and align the practice with organisational goals, ensuring our teams deliver with excellence and care. Key Responsibilities:   Empowerment & Strategy: Develop a strategic vision that empowers Scrum Masters to thrive and deliver.     Nurturing Leadership: Provide mentorship, creating pathways for growth and leadership within your teams.     Continuous Learning: Foster a culture of improvement, refining Scrum processes to meet evolving needs.     Supportive Resource Management: Balance team allocation and development to ensure both organisational and personal growth.     Measurable Impact: Define and track key metrics, helping teams succeed with clarity and purpose.    He kōrero mōu: About You You are a people-first leader with a passion for agile methodologies and talent development. With strong technical expertise and a proven ability to drive results, you lead with empathy and innovation. What you'll bring:   5+ years of leadership experience managing large teams (30+ people).     10+ years of technical expertise in agile delivery.     Strong mentoring and strategic planning skills.     Commitment to diversity, inclusion, and Auckland Council's values.   You also embrace tikanga, with the ability to use basic te reo Māori in your communications. We value diverse perspectives.   Ngā āhuatanga kei a mātou: What we offer At Auckland Council, we believe that diverse teams are key to driving innovation and achieving great outcomes. We actively support an inclusive and flexible working environment, where every individual's unique contributions are valued. You'll join a dynamic, forward-thinking team working to shape the future of our city.   Competitive salary and benefits package.     Long service leave and ongoing learning opportunities.     Access to a range of discounts and lifestyle perks.     A workplace that fosters diversity and inclusion, creating opportunities for all.    If you're ready to lead with empathy, inspire diverse teams, and make a lasting impact on Auckland's future, apply now! #WorkingforAuckland Applications close 25th OctAuckland Council is an equal opportunity employer. If you have any specific support or access needs, let us know, and we'll assist you throughout the recruitment process.", "location": "Auckland", "company": "Auckland Council", "duration": "Full time", "category": "management", "source": "seek", "skills": "[{\"name\": \"leadership\", \"type\": \"soft skill\"}, {\"name\": \"agile\", \"type\": \"methodology\"}, {\"name\": \"mentoring\", \"type\": \"soft skill\"}, {\"name\": \"strategic planning\", \"type\": \"soft skill\"}]", "salary": 0, "date": "2024-10-18", "type": "None"}
]